{
  "classId": "dec07",
  "date": "December 7, 2025",
  "session1": {
    "chantedPrayers": {
      "time": "N/A",
      "note": "Recording started after prayers and meditation"
    },
    "guidedMeditation": [],
    "classIntro": [],
    "shantidevaReading": [],
    "postReading": [],
    "teaching": [
      {
        "speaker": "Kadam Kyle",
        "time": "43:30",
        "text": "Oh, this is a very fun day. How interesting. Testing, testing.\n\nOkay."
      },
      {
        "speaker": "Student",
        "time": "43:53",
        "text": "I'm going to walk to the So you can hear us."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "44:15",
        "text": "Thumbs up. Yeah. Yeah.\n\nOkay, good. Sorry about that. Okay.\n\nSo we are on. I'm still in chapter one. And the root text must start from verse one.\n\nThrough verse 14, I prostrate to the enlightened Buddhas and dad with the truth body and to the bodhisattvas and all other objects of prostration. I will explain briefly in accordance with the scriptures and others, how to engage in the condensed practices of the bodhisattva. There is nothing written here that has not been explained before.\n\nAnd I have no special skills in composition. My reason for writing this is to benefit others and to keep my mind acquainted. Thus, the strength of my faith and my virtuous realizations might for a while be increased by this.\n\nAnd perhaps others who are as fortunate as I might also find this meaningful to behold. This precious human life so hard to find offers the ultimate goal for living beings. If we do not strive to accomplish this goal now, how will such a precious opportunity arise again?\n\nJust as on a dark and cloudy night, a flash of lightning for a moment illuminates all. So for the worldly through the power of Buddha's blessings, a virtuous intention occasionally and briefly occurs. Thus, while our virtues are mostly weak, our non-virtues are extremely strong and fearsome.\n\nOther than bodhicitta, a compassionate mind wishing for enlightenment, what virtue can overcome the heaviest evils? The able ones, the Buddhas who have considered this for many eons, have all seen bodhicitta to be the most beneficial. Because through it, countless masses of living beings can easily attain the supreme bliss of enlightenment.\n\nThose who wish to destroy their own suffering, those who wish to dispel the suffering of others, and those who wish to experience much happiness should never forsake the practice of bodhicitta. The moment bodhicitta is generated, even in pitiful beings bound within the prison of samsara, they become bodhisattvas, a son or daughter of Buddha, and are worthy of veneration by humans and worldly gods. Just like the supreme elixir that transmutes into gold, bodhicitta can transform this impure body we have taken into the priceless jewel of a Buddha's form, therefore firmly maintain bodhicitta.\n\nSince the limitless wisdom of Buddha, the sole navigator of living beings, upon thorough investigation has seen its preciousness, those who wish to be free from samsara's suffering should firmly maintain this precious mind of bodhicitta. Whereas all other virtues are like plantain trees, in that they are exhausted once they bear fruit, the enduring celestial tree of bodhicitta is not exhausted but increases by bearing fruit. Just as when those who are greatly afraid rely upon a courageous one, whoever relies on fire at the end of the eon, in an instant, it completely consumes all great evil.\n\nIts countless benefits were explained by the wise protector Maitreya to bodhisattva Sudhana. Very good, that was much better than last time we did it, which is dead silent in the room. So that was much more delightful.\n\nSo thank you very much for joining in. This is basically like sutra, so it's like putting it on our lips and into our minds, is incredibly blessed and powerful. One of the opponent forces in purification is reciting holy words, like dharma.\n\nSo it actually just purifies our mind just by reciting it. So when we're down and we're out and we've got nothing in the gas tank, doing something like that is very, very useful, because we can all do that. We can just like recite dharma and put it on our winds.\n\nAnd when we do, it blesses us. And it gives us a little transmission. So it could be the heart sutra, it could be the sutra of the three superior heaps, like in the 35 combustion buddha practice, it could be like Shantideva's words, like this, or just any dharma.\n\nJust like reciting it, it's just so easy and so blessed. So, thank you very much for joining in. Okay.\n\nSo now, last week, we were continuing, or we were kind of starting to emphasize the benefits of bodhicitta. And we looked at three of them, but we also looked at just the idea of starting to mine them more and more. And there was also a little project about putting out some publicity to three places.\n\nOne place that we thought would be comfortable for us to do, one place that we thought would be semi-comfortable for us to do, and one place that we thought would be uncomfortable for us to do. Okay, so I'd be very curious too, if anyone did the project and then has a report on that. Okay, anyone have anything to share?\n\nAnne, yes, thanks."
      },
      {
        "speaker": "Anne",
        "time": "51:15",
        "text": "I did the little project. The place I was uncomfortable with, I know all the places on Brooklyn Heights, so I decided to try Fulton Mall. And I went to Gage and Tolner, the very fancy steakhouse.\n\nAnd I went to the hostess desk, and she was like, no. But she was very apologetic, which was nice. And then I went to a couple of places I wasn't sure about, but I was like, the chain stores will never take our flyers.\n\nSo I went to Burger King, and they were like, sure. And then I went to Foot Locker, and they were like, yeah. And then I went to T-Mobile, and they were like, great.\n\nSo, and then I went to the cheapy pizza place, which I was pretty comfortable with, and they were like, yeah. And then I was out of flyers."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "52:00",
        "text": "Yeah, thank you very much. Yeah, it's like, this is part of the lesson, which is like, our mind creates these ridiculous barriers that have no relation to reality, and we relate to them as if they're true, right? We have no evidence that Burger King is not going to take it, but we're like, Burger King, yeah, right, right?\n\nIt's like, it's so interesting, right? It's just completely made up, right? Yeah, so it's a lovely example.\n\nThank you very much. Yeah. It's so cool you got to connect to all of our little friends in the Fulton Mall, too.\n\nThank you. David, yes?"
      },
      {
        "speaker": "David",
        "time": "52:43",
        "text": "So, continuing with the six sessions, and I started snoozing the little alarm when I realized I couldn't do it, which is actually, it was a good move. So I realized there's like four levels. One at lowest is snooze, and then after that, it's just kind of like, stay at my heart for a little bit.\n\nIf I'm still, there's not much opportunity to do much, and then sort of a practice like cherishing others, you are important, thinking that. And then like the fourth, the best level was doing sort of like the practice from the week, like contemplating the benefits of bodhicitta. And I just really love the line in Guide to the Bodhisattva's Way of Life that just as a strike of lightning occasionally illuminates like dark sky.\n\nSo, occasionally a virtuous intention arises in living beings. And it's really interesting how precious human life comes right before bodhicitta. Like, I feel like in the Lam Rim, those are like very far apart, and I found it very interesting that they're kind of like ones right after another.\n\nAnd this one, and it struck me that like, pardon the pun, that, you know, like our human life already is like a lightning strike. And then within that, it's like generating bodhicitta would be like a second one. And I already know what it's like to have the first one, precious human life.\n\nAnd so I'm thinking, all right, if I were like a gerbil or something trying to imagine what a human life would be, that's probably about similar to trying to imagine what say the attainment of most sublime happiness would be. And just trying to be like really humble about what that, like that I don't even know, like how amazing and incredible, like my little facsimile of it that I'm, you know, inventing isn't really nearly what it is. And just trying to like generate like a real sense of awe about it, that was really helpful.\n\nAnd then my three things were New York Blood Center was kind of like my, what I thought was the least likely. And they were like, okay, you know, so, you know, I left them. So I'll admit- The New York Blood Center.\n\nYes. Yeah, perfect. And then there was like the Hare Krishna, which I didn't realize that's what it was, the cafe.\n\nThat was like a medium, I guess, but they were totally happy. And we had a nice little chitchat, a little comparative religion situation. And then that was fun.\n\nAnd then the most likely, there's like a LGBT thing on, was it Bond Street? I figured they were good. And they were very, very pleased to put out the flyers.\n\nSo that's my report."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "55:20",
        "text": "Yeah, even the vampires need Dharma in the Blood Center. Yeah, no, that's fantastic. Thank you very much, David.\n\nAnd yeah, I'm really glad that you were, you're kind of reflecting the poetry of Shantideva, because this is one of the benefits of studying Shantideva is there's this poetic quality. And sometimes poetic words can access parts of our mind that kind of stricter prose can't get to, or that we have a hard time getting to. And both Chandrakirti and Shantideva, and then the root text in Eight Steps to Happiness are all like quite poetic.\n\nAnd that there's something that is just like very meditative and beautiful to ponder there. So it's nice that you were using that, the verse about lightning. And we can use that throughout the text.\n\nAnd it's kind of like poetic language. Yeah, thank you very much. Others, please?\n\nAnything to report from the field? Marianne, yes?"
      },
      {
        "speaker": "Mary Ann",
        "time": "56:29",
        "text": "I was kind of in a rush. I did it all on my own block. And the breakaway bike place was like maybe, and they were quite into it.\n\nSo bikers can have some dharma, hopefully. And then there was a bodega that they were really mean to me once, because they wouldn't ask about, they had like a famous cat, and they were like, no, he's not here. So he wasn't there.\n\nBut they took it. They were like, sure. I was like, really?\n\nOh, OK, cool. And then the boonie cafe was like a very sort of, you know, trendy hangout. And they were like, sure, sure, sure.\n\nSo I was surprised that all three did. I really was."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "57:17",
        "text": "Yeah, we're going into like 95% of acceptance rate right now. So it's a good reflection for our mind. Thank you very much.\n\nOthers? Anything to report? Could be about your six-session practice.\n\nIt could be at the benefits of bodhicitta. It could be about whatever else you were getting up to. Amy, yes, thanks."
      },
      {
        "speaker": "Mimi",
        "time": "57:45",
        "text": "Hi. So I didn't have a chance to do the posters. I'm sorry.\n\nBut I have been concentrating on my six-session practice. It's better this week. And I really try to hone in on self-cherishing, which came up.\n\nBut what was interesting finding for me was that I'm more acutely aware of self-cherishing how it arises in others instead of me. Because I'm like, oh, look at them. They are being so impatient.\n\nAnd they're just being self-cherishing. And I'm like, Mimi, look at yourself. So that's just the report."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "58:36",
        "text": "Yeah. Yeah, join the club. Generally, whenever we're projecting self-cherishing in someone else, there's a certain someone who is being the embodiment of self-cherishing.\n\nAnd pretty much the same goes for every other delusion. Yeah. Yeah.\n\nThanks, Mimi. Sumit. Oh, sorry, just one last thing about that.\n\nIt's nice that you're just laughing at it, too. And this is just such an important skill with the delusions. I remember a dear teacher of mine, she said, when you laugh at your delusions, it's like poking a bully in the eye.\n\nAnd that's always stuck with me. Like a schoolyard bully. They come up looking so tough.\n\nAnd you just, boom, right in the eyeball. And at that point, they just, they cry and they run away. And they have no power once you just poke them right in the eye.\n\nYou just kind of like drop them to the level that they're actually at, right? Then they're just scared. And they're just, they have no real power, actually, right?\n\nTheir power is in your fear, right? Once you stop being afraid, they have no power. They're just a schoolyard bully, right?\n\nAnd the delusions have no arms and legs and courage or skill. As Shanti Davis says, so how have they made us their slave? It's mostly because we give them power.\n\nAnd we are enslaved to them. Which is a very heavy word, but that's the description. That's exactly what's going on when we give them power over us.\n\nSo when we can laugh at them and go, ha ha ha ha ha, you dumb little self-cherishing. We're not laughing at ourself, right? We're not attacking ourself or something.\n\nWe're making fun of ourself. We're laughing at the delusions. When we do that, they completely get disempowered.\n\nBecause they're just foolish minds. They're just foolish, false minds. So we don't need to be afraid.\n\nSo anyway, I just wanted to point that out. It's a really nice example. And when we catch ourself in a delusion, it's very easy to start to take it super seriously.\n\nWhich often corresponds for a lot of us to our own self-cherishing. Which is another delusion. So now we've got a couple delusions going on.\n\nWe have the initial delusion, like anger or attachment. And now we have the self-cherishing of taking ourself so seriously, thinking how bad we are. And that's just going to tangle us up in a web.\n\nSo if we just kind of get at it right away and laugh at it, and its ridiculousness, then often it kind of like loses its hold over us, its grip over us, like right away. So anyway, yeah, thank you, Mimi. I appreciate that.\n\nOkay, sorry. Sumit, yes."
      },
      {
        "speaker": "Sumit",
        "time": "1:01:33",
        "text": "So there's a quote in Eight Steps to Happiness, which has always befuddled me. I've talked to you about this a million times, Kida, I'm Kyle. And that when we find the suffering of others unbearable, but that does not make us depressed, rather it gives us basically the fuel to accomplish the spiritual path for others.\n\nYou know, accomplish bodhichitta. And experientially, I'm like, no, that makes me feel really depressed and terrible. And I've never had any, not just, I've always struggled with that line.\n\nAnd I guess I had a little bit of like, you know, this very related to bodhichitta and something, I don't know, just a little bit of insight into this, was that, well, maybe it's a wrong insight. And I love your reflection. But just that, you know, I find the sufferings of others unbearable, and that prompts me to basically engage in bodhichitta, the spiritual path.\n\nAnd at that point, I'm sort of like not, like my mind, it's not that I'm disengaged with people, because I'm engaged with people, because whatever the other is going on with them, that's affecting me, right? But then how it turns out for them, I'm not supposed to be engaged with that. I should be engaged into like how I turn out.\n\nSo for example, someone's suffering, I pray for them. Oh, that's good. It prompted me to pray.\n\nDid the prayer work for so-and-so? I don't know. Maybe I'm not supposed to be engaged in that part.\n\nSo, which is, by the way, when I get discouraged, because I'm like, I prayed for you. You're still suffering. I feel terrible, right?\n\nSo my question is like, is that, is my insight kind of wrong there? Or what do you think about that? Because it's sort of like, I, it's like, I get the inputs coming from you, and the output's coming on to me."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:03:14",
        "text": "Yeah, yeah, yeah. And I know what you're talking about. So for example, we pray for someone.\n\nThey don't seem to be better. Potentially, we become discouraged. You're suggesting we just delight in our virtuous action, and we essentially ignore the output that we're observing."
      },
      {
        "speaker": "Sumit",
        "time": "1:03:34",
        "text": "From an emotional state of view."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:03:35",
        "text": "Yeah, yeah, yeah, right."
      },
      {
        "speaker": "Sumit",
        "time": "1:03:36",
        "text": "Maybe intellectual point of view."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:03:37",
        "text": "100%, yeah, 100%. That's exactly what we have to do. I think we talked about this in a teaching skills class a few weeks ago, but I can reiterate the point, because not everyone was there.\n\nSo Geshe-la was teaching about medicine buddha practice. And he said, all the medicine buddhas made all these promises to protect people. They're very amazing promises.\n\nAnd he said, you know, when he makes those prayers, and he tries to make those promises himself, after making those prayers and dedications, and trying to envision as if they've come true, even if the things we normally see don't look like that, he said, I ignore the things I normally see. And I believe that they have come true. Okay, so often, when we're praying for people and trying to do good and trying to help people, we're evaluating the things we normally see as the evidence of whether it's working or not.\n\nBut the things we normally see don't exist. So an impure mind is going to continually perceive an impure world. So we can't evaluate the efficacy of our virtuous minds based on the things we normally see.\n\nAll we can really value them on is where we were coming from, because that's what we can know about for a fact. Yeah, and so what you're describing is that's exactly what we should do. And we really shouldn't buy in to whether we think it's sort of working on the outside or not, because it's a very limited kind of guessing game to play.\n\nOf course, we can make little estimations, but it's some infinitesimal part of the picture that we're seeing, if any of it. So yeah, I think all we can do really is just be clear, did I come from a good place? Did I do the right virtuous action?\n\nAnd then we can even believe that actually our prayer came true. And just that our mind is still hallucinating the things we normally see, but actually the prayer came true. We can hold that beneficial belief.\n\nSo anyway, I'm just saying yes. That's the answer, yeah."
      },
      {
        "speaker": "Mimi",
        "time": "1:06:22",
        "text": "Hi. So I have been doing the Vajrayogini sessions for my six sessions, but I wasn't feeling it. It was rote.\n\nIt was just, okay, another one, check, whatever. So then I had a wonderful conversation with Fran, and she really helped me build the building, to build the building blocks, to make that more meaningful to me, which Fran, do you mind if I share what, okay, thanks. So first was taking the Bodhisattva vow, which was so nice just to, okay, I know this.\n\nYes, you know, okay, good. Then it was to actually write a prayer for me. You know, the things that I really am struggling with, that I really need, that are really important to me, to get that out.\n\nAnd then to do the Vajrayogini, you know, the six, of course, now I'm forgetting the fourth thing. So do you remember the fourth thing, Fran, am I putting? Yeah, it's to generate bodhicitta.\n\nGenerate bodhicitta, yeah, to connect with one of those three that we discussed, and I did. And so now the whole thing just feels richer, more full, realer, that's the word, more real. It just, it's working, now it's working.\n\nSo thank you, Fran, again."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:08:01",
        "text": "Yes, agreed, thanks, Fran. That was beautiful, showing an example of relying on Sangha, yeah, and getting advice from Sangha, and help from Sangha. There's always a blessing comes when we do that.\n\nIt's just such a nice thing to do. And yeah, our spiritual life is our choice. And the way that we approach our spiritual life is our choice, right?\n\nIt's not someone else's choice. And so there's these structures, and suggested methods, and strategies, and so on, right? But each one of us has our own individual karma, and our own makeup, and our own preferences, and our own issues, and our own challenges, and our own strengths.\n\nAnd so we have to use our wisdom, us and our spiritual guide, right? To find something that is going to be supportive of what we need, right? So it's really nice that you did that, right?\n\nYou kind of found a groove that moves your heart, and that's really important. Because our relationship with our spiritual guide is completely personal. It's a completely personal and intimate relationship.\n\nAnd it's dynamic. It's no one else's relationship. It's our relationship.\n\nAnd it goes back many, many lives, and it will go into future lives. Every other relationship in this life basically will disappear when we die. Even our dearest loved ones, they'll just disappear.\n\nAnd we'll never see them again in that form. As Shanti Davis says later, they'll become nothing for us. But our spiritual guide and our relationship with them, that relationship will continue.\n\nSo it's a very special and intimate relationship that is so personal. And it's just nice to let it be personal. That's the point I'm trying to make, right?\n\nAnd let it feel like it's a conversation, right? That we can have, and we don't need it to be in the box. And if something's not working, we have a chat.\n\nWe can have a chat with our sangha friends, but we also have a chat with our spiritual guide. We say, hey, can you help guide me? You know, your job is to guide me.\n\nOkay, what's that next step for me? Let's talk about this. Help me here, please.\n\nAnd it's that personal conversation that allows us to take that next step, which is going to be completely our step. Yeah, for our karma. So it's lovely, thank you, Dale.\n\nThanks for sharing that. Okay, anyone else have anything they'd like to share or declare? Okay, very good.\n\nOh, just a reminder, we have our world famous holiday brunch coming up. Oh, sorry, holiday brunch party, in case you thought it was just a brunch. It's a brunch party.\n\nSo it's even better than a brunch. And on the image, there's only two things repeated twice. Two cups of coffee and two doughnuts.\n\nThere's no other food? Oh, there could be everything. I think, but we really want them to be doughnuts.\n\nLet's be serious. So it's just making the point of how great the brunch party is going to be, which is like double the coffee, double the doughnuts. What else would you want on there?\n\nAnything else actually would ruin the image, right? An apple, you wouldn't come if there was an apple on there. Fruit, other fruit, no.\n\nA MetroCard cake, I wouldn't even know about that. Okay, yeah, okay, that's on you, Marianne, for that. But please do come along.\n\nIt's just a great day, just to spend time together as a sangha. It's 11 to 1, Saturday. Yeah, the brunch party.\n\nOkay, back to the text. I wonder if anyone can name, even if it's not word perfect, but gist perfect, the 10 benefits of bodhichitta for me. Connie Vips, as we know as the acronym.\n\nWe've got five. Okay, that's something. Anyone got 10?\n\nEven just the gist. Okay, all right, okay, yeah, we do need Emily, I guess. Okay, well, next class, we'll try it.\n\nAll right, page 22, verse 9. Bodhichitta carries with it a special name and meaning. Shantideva says that anyone who develops bodhichitta is thereafter referred to as a son of the buddhas, literally a son of the sagathas, a bodhisattva.\n\nSuch a person becomes an object worthy to be venerated and respected by worldly gods, such as Brahman, Indra, and all of humanity, including highborn kings and queens. It does not matter if the person developing bodhichitta is a poor, shabbily dressed beggar. Upon their generating the mind of enlightenment, they too become an object worthy of the highest veneration.\n\nIt's important to remember that we do not need to be a monk or of aristocratic birth or to possess a male body in order to develop bodhichitta. Although Shantideva uses the title son of the buddhas, he's not using it restrictively. When a woman develops the mind of enlightenment, she becomes known as a daughter or princess of the buddhas, and likewise becomes an object to be venerated by all gods and humans.\n\nIt's very nice to be the princess of the buddhas. Yeah, I mean, this is just pretty clear, but because buddhist practice is always moving from culture to culture, from place to place, obviously over time it's been in places that have what we would now call like a sexist norm, right, of some sort. And so it was very easy, right, for people to then sort of project their own cultural norms onto buddhism.\n\nBut there's nothing about buddhism that has any preference for any gender, for example, or any nationality or whatever. There's nothing in buddhism that would ever do that. It makes no sense because we're not our body.\n\nAnd body's empty. It's just imputation, right? And we've been millions of bodies and we've been male and female, all sorts of things, right?\n\nWe've been cockroaches and shrimp, you know, we've been little shrimp floating in the ocean with other little shrimp family. We've been formless gods which have no body at all. They're just minds floating in space.\n\nSo it doesn't make any sense, right, to grasp. And we all know this, right? But obviously it's very easy for cultural things to infiltrate the dharma and people to think that something cultural is something that's part of the dharma, right?\n\nSo hopefully we've overcome this problem now, but it's a reminder, right, for us to think, what other cultural things that are just cultural, right, that we can end up like taking and actually misunderstanding the teachings because of some cultural norm that we prefer, right, or that we've kind of bought into from our upbringing or from the information we consume or whatever else. It doesn't mean that Buddhism's not going to fit in the culture, but we don't want to ever alter the dharma because of some kind of cultural thing that we've taken in personally, right? And so we have to be a little bit careful on that because often we can feel that something that's a cultural norm is the truth.\n\nAnd we don't realize, no, it's just a norm, which is like, it fits for right now, but it's just a norm, it's not the truth. So I'm just sharing this so we can think about it a little bit and we can appreciate Geshe-la, right, for very clearly making, for example, Gangla Dakyong as the head of our Buddhist tradition, where that's not a normal thing, actually, still in a lot of Buddhist traditions, right? And I'm saying this in a critical way of anyone else.\n\nI'm just trying to show the example that Geshe-la set of not having these kind of limited ways of thinking, right? So we can just appreciate him a lot, you know, for not having some rule, right? You need to be a monk instead of a nun or a male practitioner instead of female practitioner, et cetera.\n\nBen, yes."
      },
      {
        "speaker": "David",
        "time": "1:17:47",
        "text": "Hi, how do we distinguish between the deluded wish for high status as opposed to the wish to be something worthy of veneration? And entitled to veneration?"
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:18:07",
        "text": "Yeah, yeah. So how do we discern between the delusion of, it's basically one of the worldly concerns, right, being attached to a good reputation or wanting high status versus this benefit here. So one thing I would ask in turn is, is this benefit saying that we want veneration?\n\nNot exactly. That's not exactly the meaning of this benefit, that we're craving veneration. It's something to think about a little bit.\n\nLet's go through it. And I think if we go through this and unpack it a little bit, maybe we can kind of draw out the kind of intention of this benefit. Briefly though, there is, as we might know, there are, what are they called, the qualities of something, something, and something.\n\nOf like a noble birth, something like this, right? These qualities of like a noble birth. And having some kind of a high status is one of those qualities that you, that can be beneficial to create.\n\nAnd the reason is because it helps you help other people, because people care about status. So you're not craving status out of attachment. You value that status out of the power it gives you to help other people.\n\nRight? So it's the same like beauty is included there too. Obviously, we're not attached to beauty.\n\nIt's ridiculous. But if, and it doesn't even just mean a physical beauty, it means appearing as pleasant, right? But if our appearing as pleasant helps people receive the Dharma, then it's useful as like a tool.\n\nSo anyway, that's just a separate point. But I don't think the point of this benefit is that we're craving veneration. But even if, but there is a place for valuing a good status or a good reputation for the benefit of others.\n\nFor example, there's a bodhisattva vow, a downfall, right, of not avoiding a bad reputation, which is like, it's implying we should care about our reputation as a bodhisattva, but for the benefit of others. It's very different than our ordinary way of thinking about reputation. Okay, but yeah, we'll get into this benefit in a little bit more.\n\nOkay, so why does developing bodhicitta entitle us to so much respect? Because all buddhas, those fully awakened beings from whom supreme happiness derives are born from bodhisattvas who are so called by virtue of their bodhicitta motivation, their intention to win full awakening for the benefit of all. Thus buddhas arise from bodhisattvas, who in turn arise from bodhicitta.\n\nTo stress the supreme value of bodhicitta, Buddha Shakyamuni says that it's even more important to prostrate or pay homage to a bodhisattva, someone who has developed bodhicitta than it is to prostrate to a Buddha. He explains this by using the example of the waxing moon. If someone bows down to the new moon, it's the same as bowing down to every face of the moon between new and full.\n\nWhy? Because by paying respect to a cause, we're implicitly paying respect to each of its succeeding effects. Thus, if we prostrate to a bodhisattva, we're implicitly paying homage to all the future states of his or her development up to and including the attainment of Buddhahood.\n\nFor such reasons then, bodhicitta is very precious. And anyone who develops this mind becomes worthy of veneration. The great Indian pendant, Atisha, had many teachers and received much instruction from them concerning the development of bodhicitta.\n\nBut not being satisfied, he set out on a dangerous journey to present-day Indonesia in order to receive teachings from the famous guru, Sri Lingpa Supharnadipa. The difficult voyage took 13 months, but from this, Guru Atisha was able to receive flawless and complete instructions on the method for developing the mind of enlightenment. Although Atisha had over 150 teachers, he referred to Sri Lingpa as his root guru.\n\nEven many years later, when he was in Tibet, if Atisha even heard the name of his root guru, he would immediately descend from his seat and prostrate to him. What an amazing example, right? Such reverence for his guru, even though he was viewed as the second Buddha.\n\nHe always showed the example of incredible respect for his guru. The Tibetans noticed that he did not do this for any of his other teachers and asked him why. He replied that from the instructions given him by Guru Sri Lingpa, he realized how to develop this precious bodhicitta.\n\nAtisha, the possessor of great learning, had bodhicitta supreme. Consequently, he venerated Sri Lingpa above all his other teachers. Okay, so what's the point of this benefit?\n\nHas anyone thought about it? Got some insight? What can move our heart about this benefit?\n\nMa'am, yes, please."
      },
      {
        "speaker": "Anne",
        "time": "1:24:29",
        "text": "I think it's the word worthy of veneration. Regardless of whether or not others do look up to us and respect and admire us, we're worth it. We ought to be because we have qualities that are incredible.\n\nAnd for those who, if we can be an individual that others venerate, we're definitely inspiring them and helping them a lot. I don't know what I would do without the people in my life that I venerate. I'd be totally lost if I thought I was the best one."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:25:17",
        "text": "Yeah, yeah, it's a really beautiful point, Ann, thank you. I think that's really helping us starting to clarify, right? It's that word worthy, right?\n\nSo, the veneration is the side effect of the worthiness, right? Obviously, in our world, some people become venerated and not particularly worthy in a virtuous way, let's say. Right?\n\nSo, it doesn't always link. If someone is venerated, they sort of have the virtues that we desire. But here, it's kind of implying the veneration is like, yeah, it's the sense of seeing someone or something that's holy and not ordinary, and not of this world, and someone that we would prostrate to or bow down to.\n\nIt's a hard thing for modern people to do, right? To bow down to someone. It offends our sensibilities.\n\nSome people who come to the classes, right? They refuse to even put their hands at their heart when the teacher comes in, even if they've been coming for years. Because it's scary, that idea of having some respect for something holy, right?\n\nThe Dharma is why we prostrate at the beginning of class, right? But that's intimidating to them, or feels threatening to their pride. So, it's hard.\n\nSo, when someone is a bodhisattva, they are 100%. Their qualities are so beautiful, right? That they become someone that is worth it to bow down to, or make an offering to.\n\nBecause their qualities are just so beautiful and pure. And so, we become someone like that, right? Which is amazing.\n\nAnd it's kind of like, again, each benefit has a function, right? And so, it's trying to get at this sense of... We get this idea of nobility.\n\nLike some people have this for royalty. Like the, I don't know, the royal family in England, right? Or whatever.\n\nAnd sometimes it's not even a logical thing. And maybe even people don't like what they do. But there's this sense of like, no, but they're special.\n\nAnd Americans don't have this as much. But English people do, definitely. And there's a sense of like, don't disrespect them.\n\nIt's not cool. Like there's something like noble there. It's like have this higher grade of respect than like an average person.\n\nSo, that's an analog, right? A bodhisattva is much higher than a king or a queen or something like that. But it's just trying to get us at the sense of like, there's something so beautiful about them that we would venerate them, right?\n\nLike nobility, but much higher, much more special than that. Sorry, Dale, you had a hand there. Yeah."
      },
      {
        "speaker": "Mimi",
        "time": "1:28:22",
        "text": "So, for me, the word that comes to mind is intention. The purest of intentions that's shining forth from this person. Just, I mean, I'm getting goosebumps talking about this word.\n\nI mean, to always put that other person first, to always think about that other person and what you can do to help. That's pretty awesome, as they say. Yeah.\n\nSo, the intention is just to be venerated."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:28:53",
        "text": "Yeah, thank you, Dale. That's a really, really nice way to say it. It's like, you know, it's just so hard to trust people.\n\nAnd especially in our world, there's so many challenges with trust. And like, who can we trust? And many people don't trust.\n\nLike it used to be like, you could trust the newspapers, right? Or you could trust the whatever, some stalwart, you know, politician kind of person. Or you could trust this thinker or whatever.\n\nYou could trust the clergy, whatever. And it's like, all that stuff is gone. People don't trust anyone.\n\nThere's like very low trust in our world, right? And that has huge effects on the society to not have trust, because trust is basically what makes society work. Anyway, this is another issue.\n\nBut a bodhisattva, like as you said so nicely, their heart is so pure and so good, we can just completely trust them. And to have someone like that in our life, it's an incredible feeling, right? To just be like, I trust you wholeheartedly.\n\nI could share anything with you. I could tell you anything. I could go to you with my worst, darkest secrets.\n\nAnd I just know you would be there for me. And you'd give me wise advice. And not just you'd care for me, but you'd actually know how to help me go forward.\n\nBecause your intention is completely pure, right? And there's just something there that is not of this world, right? Yeah.\n\nSo thank you very much. It's a really nice way to get at that, right? David, yeah."
      },
      {
        "speaker": "David",
        "time": "1:30:48",
        "text": "For me, another thing that touched my heart about this section is this whole new moon and full moon idea. And just that developing bodhicitta is an incredibly critical link in the chain of becoming a Buddha. It seems to me like once you have bodhicitta, then it's inevitable that you'd eventually become a Buddha.\n\nAnd it seems like we could do that in this life. We couldn't probably become a Buddha. I don't think humans can't be Buddhas, but they can 100% be bodhisattvas, right?\n\nAnd have bodhicitta. And if you do that, then you can tell me if I'm wrong, but it seems like once you have that, then you've sort of set in motion this sequence of events that would lead to enlightenment for yourself and for everyone else. So just from that standpoint, it just seems like just absolutely sort of critical.\n\nIf you don't have it, then who knows what could happen. But if you do have it, then it seems like it will all work out eventually."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:31:49",
        "text": "Yeah, exactly. And I mean, humans can definitely become enlightened in this life, but this link is often a bit more approachable than enlightenment. It's like, okay, I just need the wish to become a Buddha for the benefit of all, spontaneously.\n\nYeah, why not? We can do that. We can all do that in this life.\n\nDefinitely. That's not esoteric, right? That's not out there.\n\nYeah, we could do that. We could develop that thought. So it's kind of accessible.\n\nBut once we have it, as you said, it's like entering into a royal family. You've entered into a noble lineage that you're forever part of. You're in there forever.\n\nI think there's sort of a technical part on the path of accumulation, which isn't the first part of it, but a few steps in that you 100% officially, officially, officially will never, ever turn back again. Ajogesha explains the joy of a path of good fortune in the Five Grounds and Paths section at the end. But for all intents and purposes, we can say, yeah, basically having bodhicitta, spontaneous bodhicitta, which is like tranquil abiding of bodhicitta, you are in that lineage.\n\nYou'll forever move forward. And we can just think like, what a gift to future us to do that. Yeah, so that's that point about the new moon.\n\nYeah, okay. So this is good. We got some ideas about this benefit.\n\nBen, are you satisfied yet? Or do you have anything else on that? Yeah.\n\nOkay, cool. Thanks for asking the question. I appreciate it.\n\nYeah. Transformation of the inferior into the supreme. Alchemists assert that there's a special elixir that has the power to transform base metals into gold.\n\nIf we develop and practice bodhicitta, this impure human body of ours will likewise be transformed in the priceless, peerless jewel of a Buddha's holy body. The way to meditate on this point is as follows. First, we should continually contemplate the impurity of the human body, thinking how undesirable it is to take rebirth constantly in such a gross and impure form.\n\nWe should abandon whatever desire we might have for this ordinary human body and think instead of the preciousness of the transcendent body of a Buddha. We must develop the strong wish to attain this holy form and consider by what causes we may receive it. Upon continued reflection, we will come to recognize that such a form can be achieved solely through the power of bodhicitta.\n\nUnderstanding this, we should then develop a strong determination to attain bodhicitta and mindfully hold this determination. Okay, so as we know in the Buddhist tantric teachings and in the quote I had read from Ear of Dharma editions that I said is my favorite quote, my favorite little bit. The teaching is that the only reason we're in samsara is because we impute our I on an ordinary suffering body and mind.\n\nAnd all we need to do to attain enlightenment is impute our I on an enlightened body and mind. Okay, so that's all we need to do to become Buddha. We just need to take the thought I and move it from a suffering pain magnet of this body to an enlightened body.\n\nAnd think I, that's it. So that's the case, why do we need bodhicitta to do that? If that's all you need to do, boop, why can't you just do that now?\n\nWhy can't we just sit here and go, hmm, Vajrakini's body and mind, I. Ah, okay, that was good. All right, now I'm a Buddha, see you later everyone.\n\nWhy do we need bodhicitta to do that? Sharon, yeah?"
      },
      {
        "speaker": "Mary Ann",
        "time": "1:36:52",
        "text": "I mean, the tantra won't function without the foundation of the sutra teachings. So there wouldn't be any point being Vajrayogini. The whole point of becoming Vajrayogini is to help everybody.\n\nSo I think it's just an empty exercise otherwise."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:37:13",
        "text": "Right, so there'd be kind of like a pointless thing to do, yeah. Marianne, you had a hand there too, yeah?"
      },
      {
        "speaker": "Mary Ann",
        "time": "1:37:20",
        "text": "Well, because Vajrayogini is compassion. She's bodhicitta, that's all of it, mostly, or most of it. Compassion and omniscience."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:37:31",
        "text": "Yeah, yeah, definitely."
      },
      {
        "speaker": "Sumit",
        "time": "1:37:35",
        "text": "Can't have one without the other."
      },
      {
        "speaker": "Sumit",
        "time": "1:37:41",
        "text": "I started my Buddhist career solely interested in emptiness and no interest in the compassion element. This is so long that I might be falsely remembering, but I basically asked, what's the point of this whole compassion thing? All I need is emptiness.\n\nAnd I think the answer was like, yeah, theoretically, you could do this with just emptiness, but from a practical point of view, you just would not accumulate enough merit. And the way I've understood that is basically like, you know, to become, to release, because it's like, I release my grasping of I, and then, and I can't, unless I'm like, so much of my energy is directed at myself, right? And in order to diminish that, part of that process is the cherishing others, taking my energy outward.\n\nSo, you know, that's why it's called method practices, right? So it's like, this is the method to accomplish it. And then ultimately it is covered to cover the wisdom practice.\n\nSo that's how I take it."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:38:39",
        "text": "Yeah, this is fantastic. It's nice. All these points are kind of melding together very nicely.\n\nAdriana, you have a hand there too?"
      },
      {
        "speaker": "Student",
        "time": "1:38:47",
        "text": "Yeah, I was just going to say that you can impute, it would be the equivalent of like saying that I'm a Lamborghini, if I'm a Lamborghini, but then like, there'd be no gas in the car. Like I couldn't drive anywhere or do anything. The bodhichitta is the gas, like is the fuel.\n\nOtherwise it would be, maybe you look really great, but you're not doing anything."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:39:11",
        "text": "Yeah, there is actually a literal quality to that, which is like, this is beyond right now, because it's touched on later in the book. But the question is like, how does a Buddha actually benefit others? They have no conceptual minds.\n\nAnd the reason is because of the bodhichitta that's in their mind. So like the point about the gas, yeah, is like sort of literally true. Without the bodhichitta in your mind, what would be motivating you?\n\nYou'd be a useless Buddha. You know, you wouldn't be able to like help anyone. You wouldn't even want to help anyone.\n\nWhich is kind of going to both Sharon and Marianne's point, which is like, it doesn't even make sense actually, to be a Buddha without bodhichitta. It's like their very nature is benefiting others. So how could you even think, I am Vajragini, without that quality of mind?\n\nWhen we impute I on a Buddha, we're imputing I on their body and mind. Part of their mind is their compassion, and their love for others. Is that solitary peace?\n\nYeah, it would be some kind of like, strange, cut off experience. But we wouldn't be able to help anyone without that bodhichitta. And then to Sumit's point, there's this like, what's the best way to say it?\n\nIt's like the winds, in a sense, they're like magnetized to the self we normally see. It's like a way to think of it. And the minds are like magnetized to the self we normally see.\n\nIt's like, think of the self we normally see as like the earth. And our minds, and our winds, are trying to like, go to the moon. And the moon is like being Vajragini, right?\n\nAnd there's a sense of like, a gravitational pull to the self we normally see. We're trying to like, move. Think about like, humans trying to get to the moon, right?\n\nIt's incredibly complicated. You need to like, go against the gravitational pull of the earth. And it's very hard to go against it.\n\nIt's just, every force is like, dragging us down. It's hard to even get 100 feet up, right? It takes a huge structure to even get that far up.\n\nAnd to get much further than that, right? You're just constantly getting dragged back down. So, when we develop renunciation, this gets us the sense of like, I don't want to identify with the self I normally see.\n\nSo, it starts to break the gravitational pull of the self we normally see. Just thinking about it, and wanting to be it. We just feel like, repulsed by it.\n\nWe don't, it's like the object of our suffering. We don't want to think about it. We don't want to be it anymore.\n\nBodhichitta then does a different thing, which is, it then puts our energy somewhere else. So, it like, takes away that kind of self-cherishing energy. And gives us enough power to sort of get out of orbit.\n\nLike, by putting our mind on others. And caring for others. It's like our mind actually goes out.\n\nThis is sort of part of the research project that we were doing. Three publicity places. Which is like, connecting to the sense of outreach.\n\nGoing out to others. So, when we go out to others with bodhichitta, it breaks the sort of self-cherishing mind. It gets, again, the wind's mind out of the orbit of the self we normally see.\n\nSo then it's actually free to identify as a Buddha's body and mind. Until then, we just keep like, whipping back. Over and over and over.\n\nAnd maybe you've experienced this in your self-generation attempts or practice. You're like, okay, bringing death into the path. Everything dissolves.\n\nYeah, I'm Bhajagini. I'm Haruka. Boom!\n\nBack to us. Oh, my stomach's grumbling. Oh, my problems.\n\nOh, I hate that person. Oh, I really want this. It's really like trying to get off the orbit or the gravitational pull of the earth.\n\nIt just feels like we're literally jumping on the ground. And smashing down to earth again. And it's just because we're so attached to the self we normally see.\n\nSo it's like our bodhichitta, right? It breaks us out of that cycle. Actually going out to others frees us of thinking about ourself, right?\n\nThat's incredibly just peaceful on its own. It just feels great. We start to feel like the self we normally see is the most insignificant, uninteresting thing.\n\nWhich makes all of its problems completely insignificant and uninteresting. So they just don't feel like a big deal anymore. But then it allows us to actually identify as a Buddha.\n\nSo these are just a bunch of reasons, right? About this point. I think we crowdsourced the kind of essence of this example.\n\nOr this benefit. David, did you have a hand, an additional point there? Before we wrap it up."
      },
      {
        "speaker": "David",
        "time": "1:44:53",
        "text": "I don't know if this is right. But I was thinking about the left and right channel and the knots around your central channel. Are those kept in place by self-cherishing?\n\nIs that part of it too, that bodhichitta breaks those apart?"
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:45:06",
        "text": "Yeah, it's a good point. That in the completion stage teachings of higher siddha tantra, we say that the object of abandonment is self-grasping and its corresponding wind. The wind of self-grasping.\n\nThat is basically all tied up with the wind of self-cherishing and all the other impure winds around that. They're like the most impure winds. So you can purify the winds by going into the central channel.\n\nThat's one way to purify the winds in tantra. But you can also purify winds by developing pure minds. The winds and minds match.\n\nSo pure minds, pure winds, pure winds, pure minds. They always match. So all that kind of contamination at the heart are all the impure winds.\n\nThe impure winds of self-cherishing and self-grasping. So as we develop our love, we'll actually start to feel this. This very blissful, peaceful feeling at our heart.\n\nJust the best feeling, right? Pure and clear and cool, like cool winds flowing through our heart chakra. Our heart just starts to feel better and better and better.\n\nThis is so blissful. We don't even want to go anywhere and do anything much except for benefiting others because we just feel so good on the inside. It's like nurturing enough.\n\nAnd as those winds start to become more and more pure, we start to be able to break open those knots and actually enter into the central channel. So we can purify the winds through purifying the minds. And the bodhicitta mind is the supreme mind, right?\n\nIt's like the best mind you can have. So it creates the best, most pure winds. Yeah, so anyway, thanks for that point.\n\nIt's a nice point. Okay, I think that's pretty good for now. We'll continue with the rest of the benefits after the break.\n\nAgain, the conclusion of all this, it's not to get kind of stuck in any of these individual benefits or to overly focus on them. The conclusion is to develop wishing faith in bodhicitta, right? Thinking, I really want bodhicitta.\n\nSo let's not miss the forest for the trees, right? Let's not kind of, we're going through them, we're getting commentary, etc. But we just want to make sure in our own minds, right, that we're using these to do what they're designed to do, which is develop admiring faith in bodhicitta and then wishing faith in bodhicitta.\n\nThat's the point. If one benefit got you there, you only need one benefit then, right? But we're just trying to get a little bit of a picture, and sometimes maybe some will inspire us more than others.\n\nBut the end that we're aiming for, right, is this wishing faith in bodhicitta. I really want to develop it because I admire its benefits. So let's not lose sight of that, okay?\n\nAll right, let's take a break now. So we'll just do a brief dedication and we'll come back at 6.08. We can think to the virtues we've collected, be practicing, meditating, discussing. May all living beings find lasting peace of mind, enlightenment.\n\nWe can make any personal dedications or prayers."
      },
      {
        "speaker": "Student",
        "time": "1:49:53",
        "text": "Okay, thank you. Thanks, everyone."
      },
      {
        "speaker": "Mimi",
        "time": "1:50:26",
        "text": "Yeah, Christmas afternoon."
      },
      {
        "speaker": "Student",
        "time": "1:50:57",
        "text": "I think I need to, like, stop with my own special appearance. You know what I mean?"
      },
      {
        "speaker": "Anne",
        "time": "1:51:04",
        "text": "Yeah, it's a show, but it's something that always, like, has sex."
      },
      {
        "speaker": "Student",
        "time": "1:51:10",
        "text": "And it's helpful for me to be, like, it's what I've done before. It's, like, my best conception of what it would be to, like, go back to bed and sit in that bed and be like, Yeah, yeah. It's the one that I love most about is this.\n\nOh. Oh, that's so funny. That's, like, the same thing.\n\nYeah, yeah, yeah. To me, that's just, like, without meditation, I would never have gotten to be calm and good. We think that, you know, we say, well, I'm the other one, but really, it would be only half that person.\n\nYeah, exactly. Anyway, anything can happen if I don't try. That's what happens.\n\nBut, um, I don't understand why it's not limited to us. I do understand that there's a lot of things that keep happening. Well, yeah, there you go.\n\nThat's what makes me alert. There you go. Okay.\n\nMakes sense. Yeah."
      }
    ],
    "mainTeaching": []
  },
  "session2": {
    "chantedPrayers": {
      "time": "2:22:00",
      "text": "O Blessed One, Shakyamuni Buddha,\nPrecious treasury of compassion,\nBestower of supreme inner peace,\nYou, who love all beings without exception,\nAre the source of happiness and goodness;\nAnd you guide us to the liberating path.\n\nYour body is a wishfulfilling jewel,\nYour speech is supreme, purifying nectar,\nAnd your mind is refuge for all living beings.\n\nWith folded hands I turn to you,\nSupreme unchanging friend,\nI request from the depths of my heart:\n\nPlease give me the light of your wisdom\nTo dispel the darkness of my mind\nAnd to heal my mental continuum.\n\nPlease nourish me with your goodness,\nThat I in turn may nourish all beings\nWith an unceasing banquet of delight.\n\nThrough your compassionate intention,\nYour blessings and virtuous deeds,\nAnd my strong wish to rely upon you,\nMay all suffering quickly cease\nAnd all happiness and joy be fulfilled;\nAnd may holy Dharma flourish for evermore."
    },
    "teaching": [
      {
        "speaker": "Kadam Kyle",
        "time": "2:24:28",
        "text": "Whatever pace feels right for us. Then in our own time, can gradually arise more practice. Did we say the in-person people who were here at the beginning of class?\n\nNo, I don't think we did. I think I just said the online people. Who knows who's here?\n\nPoor online people, you have no idea. It could be anyone. It could be our lovely French neighbors.\n\nIt could be anyone. Sorry about that. Apologies.\n\nSo there's Fran, Anne, Mimi, Byron, Jose, Dale, Simit, Sharon, Marianne, David, and myself. Okay, so now we're all up to speed. All right.\n\nPage 25. We have the value of the precious bodhicitta so difficult to find. Amongst all jewels, the fabled wish-fulfilling jewel is the rarest, most priceless, and of foremost importance because it alleviates the poverty of all.\n\nSimilarly, amongst all kinds of virtue, the rarest and most priceless is bodhicitta because it alone can dispel the poverty of those who are poor in virtue. Those who wish to be freed from the sufferings of samsara should firmly maintain this precious bodhicitta. A skillful oarsman ferries merchants from the mainland to a jeweled island.\n\nSimilarly, Buddha is an oarsman possessing a mind of boundless compassion and skillful means, skillful methods. This mind is the boat of bodhicitta, and in it he ferries all sentient beings across the ocean of suffering to the jeweled island of enlightenment. If we make a thorough examination, we'll see clearly that this boat of bodhicitta is the most sublime and rarest of all methods to achieve happiness.\n\nOh, David here."
      },
      {
        "speaker": "David",
        "time": "2:31:16",
        "text": "I apologize if I'm out of line here, but did I forget that we did the previous one, the transformation of the inferior into the supreme? We did that, yeah."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "2:31:25",
        "text": "That was the bit about how bodhicitta helps us change how we identify ourself. Okay, thank you, sir. Okay, yeah.\n\nSo, how does the boat of bodhicitta ferry all sentient beings across the ocean of suffering? So, for example, Buddha already has bodhicitta, and there's been countless Buddhas with bodhicitta. So, if that is the boat that carries all beings to liberation, what about me?\n\nWhat about you, if you're not a Buddha yet? What about us? How is it ferrying us all to enlightenment, if we're still suffering?\n\nOkay, we'll think about that one. Yeah, please, Fran."
      },
      {
        "speaker": "Mimi",
        "time": "2:32:52",
        "text": "The only thing I can think of is that we have to ask for it, that that ferryman has blessings for us, but if we don't know how to ask for them. So, the Buddhas are available, they're out there just waiting for us to invite them in. So, the what about me is because we haven't made the right effort."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "2:33:17",
        "text": "Yeah, I think that's definitely true. It's a dependent relationship, right? Buddhas are doing everything they can do, including viewing us as a Buddha, perceiving us as completely liberated.\n\nSo, Buddhas have done their job, but we still have to do our job, right? Adriana, you had a hand there?"
      },
      {
        "speaker": "Student",
        "time": "2:33:43",
        "text": "Yes, I was going to say, I feel like I relate to this in two ways. One is that I don't stay in the boat, I keep getting out. Or I'll just put my pinky in the boat, and that's really helpful.\n\nBut yeah, I have to put myself through refuge and practicing Dharma. You stay on the boat. And then I think about in my day-to-day life that at the same time I'm making my own boat.\n\nSo, whenever I meet people, I'm adding them to my mental continuum, and one day I will become the boat."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "2:34:31",
        "text": "Yeah, thanks, Adriana. Yes, a similar kind of point to Fran. Just talking about this idea of this dependent relationship, right?\n\nIt's like Buddha's blessings are like a ring, or sorry, they're like a hook. And our faith is like a ring, right? But we've got to have that ring of faith to the hook of Buddha's blessings, the boat.\n\nWe've got to do our part, right? So if we don't do our part, there's nothing for the hook to latch onto, to whip us to enlightenment in the blink of an eye. And then that bit about getting people on our boat, we'll talk about that actually a little bit in a second.\n\nSameet, yeah?"
      },
      {
        "speaker": "Sumit",
        "time": "2:35:18",
        "text": "I think it's sort of late to that point. Do you want to talk about it first, maybe?"
      },
      {
        "speaker": "Kadam Kyle",
        "time": "2:35:22",
        "text": "No, please, let your little boat ditty rip."
      },
      {
        "speaker": "Sumit",
        "time": "2:35:25",
        "text": "Yeah, I mean, this really ties into what I was asking about last week. I was like, I'm very discouraged, people are not open to this, they don't want to have the ring of faith at all. But I really liked your answer, which was like, well, we're not, you know, Buddhas don't see ordinary beings.\n\nSo it's kind of like, why am I not enlightened? Because I'm relating to my ordinary self, and Buddha's not helping my ordinary self, it doesn't exist. But I guess my non-ordinary self, it's like Buddha's helped it, right?\n\nBut it has, I think, taken into enlightenment. And so, just going back to your original, the first thing about like, why are we there? It's like, who is the I, right?\n\nThe ordinary I is not there, but the true I is there."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "2:36:10",
        "text": "Yeah, exactly. It's like simply our ordinary appearance and conception. That's it.\n\nJust let go of that. Everyone is liberated. Everyone is free.\n\nThat will be our experience. Amazing. Anne, yeah, please."
      },
      {
        "speaker": "Anne",
        "time": "2:36:31",
        "text": "I think an analogy might be like, we all have a friend who's maybe very attractive or very intelligent, and they think that they're ugly or stupid. And from their point of view, they're an ugly, stupid person. It doesn't matter what I think of them."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "2:36:49",
        "text": "Yeah, exactly. We can falsely hallucinate all sorts of things. And that doesn't make them right, but that makes the hallucination very believable from the point of view of the person who is doing the hallucinating.\n\nOkay, this is good. We got kind of at the point. A little bit about Boat here.\n\nSo this is more about this idea of reaching out and outreach, which is like when we become a Buddha, we can help those people that we've built karmic connections with. That's why people are connected to Tara, for example, and they don't even know why, but they love Tara. It's because she's made so many karmic connections.\n\nShe's made so many connections with so many people in this world. Not necessarily everyone, at least in the way that they are aware of, but she is personally, her like mental continuum, that eventually became lightened, made so many connections with so many people. And so when they see her in this life, even if they just hear about her for the first time, they say, Oh yeah!\n\nI like Tara! It's a very beautiful experience. I remember this young woman who came here just for a few months.\n\nShe came to this course on Tara practice. She was just going to GP other than that. And she just said she was doing this work, and going to these interviews and stuff like that all week.\n\nAnd she just felt like Tara was with her, like every step of the way. Just like blessing her, being with her. She just couldn't believe it.\n\nShe's just like, I just came to these classes, I have no idea what's going on. But all of a sudden there's this Buddha in my life, guiding me. And it's like, we can be like that for people.\n\nWhich is like there's a blessing there. We might know that there's a Bodhisattva vow, right, about relying on our holy spiritual guide, not just books. Like a root guru, not just books.\n\nAnd the reason is because the blessings that come from reliance on our spiritual guide are what move us. The book alone can't move us. It's the blessings that really move us.\n\nAnd it's like when we make connections with people, one day we'll be like the Buddha that appears in their life, or the Bodhisattva that appears in their life. And they'll feel blessed when they connect to us. And that's what's going to liberate them.\n\nIt's those blessings in their heart. Wouldn't that be amazing to be that for people? To be someone who's like a locus for the blessings.\n\nLike a link to all the blessings of the Buddhas. And we can be that, but we have to make connections with people. We can't do that in isolation.\n\nWe have to like, it's like to Adriana's point, it's like we're building our boat of bodhicitta, but every person we connect to, they're on that boat. At least karmically they're linked to us. Every person we help, if we do that with the intention to liberate them one day, they're like karmically linked to us forever.\n\nSo it's just like a way of thinking, right? It's like about connecting to people, and to more, and to more, and to more, and to more, and to more people. So we can do this at different levels, right?\n\nWe can do this here at the center, obviously like our TTP Sangha and FP Sangha, but especially like the GP Sangha, these people who are connected to the Dharma. They have this connection, they're coming in the door, which is an incredibly unusual action. That's not an accident.\n\nSometimes people say, oh, maybe you weren't supposed to be here to this event. But there's no accidents, there's no karmic accidents. They're supposed to be here if they show up, right?\n\nEven if it's like they bust in the TTP to the front door right now, like a visitor or something. They're linked to us, it's not an accident. And if they show up to any class, any puja, they're linked, they have a karmic connection.\n\nThere's like 3 million people in Brooklyn, and then a bunch more people around. So the people who come through the door are linked to us. And so when we see those people, we want to be like part of that link.\n\nWe want to nurture that link for them. We don't want to just think, whatever, maybe this isn't your thing, or whatever. Or, I'm too busy, I'm talking to my friend right now.\n\nOr I'm talking to someone more interesting to me, or who I'd rather speak to or connect to. It's like, no, they have this link. I might not know what it is yet, and they might not even know what it is yet, but they definitely do.\n\nThey 100% have a special link to this lineage. So with those people, it's especially wonderful to just make a connection. I'm not saying in a creepy way, right?\n\nLike, hello! Be a Buddhist. That's not the meaning, that's creepy and weird.\n\nBut it's like, one day when I become enlightened, may I support you and lead you to enlightenment. We can think that towards each of those people. Or we can think, at least I'll just be a friendly face to them.\n\nI might not see them again this year, or this life. That's not the point of this. We're not trying to make them into something, but we're making a connection to them out of our love, and our bodhicitta.\n\nThat's the point. We don't want anyone to ever leave here, right? Without someone having made a connection to them.\n\nSo we really want to be attuned to that, right? To think, this person who's entered through the door, they are really linked to this. They might not know how, I might not know how, but they are linked.\n\nAnd let me make this connection as part of my bodhicitta. Maybe in the next life, I'll be a bodhisattva or a Buddha, and they'll appear again, and I can help them then. Who knows?\n\nSo there's that level too. There's like the FP and TTP sangha, it's quite obvious. There's like this GP level people.\n\nAnd then there's just everyone else. Our friends, our family, our community, random strangers. Just making connections.\n\nAnd we can think, like, one day, may I lead you to enlightenment. We can think that towards anyone we meet. Or like, may through this action, you eventually attain enlightenment.\n\nMay I support you doing that. It could just be a friendly person at the checkout, at the grocery store. It could be a stranger asking for money on the street.\n\nIt could be a co-worker or someone you're doing business with. We're always trying to have this connecting heart. There are some practitioners who are very good at this.\n\nAnd I know a couple people here know someone. Two of our people here know someone very well who's very good at this. And she has an ability to connect to people.\n\nAnd when she connects to people, they go for refuge. Because she just wants it for them so badly. Again, it's not a creepy way.\n\nIt's not a pressuring way. But it's just from her good heart. And so we can be like that.\n\nWe can all be like that. Anyway, I don't want to out her against her will. Yeah, I know, she wouldn't mind.\n\nBut it's still better not to. It's a beautiful example, right? It's a beautiful example to have this wish to make connections to people, to make karmic connections to people.\n\nAnd we just never know where they'll lead. Anyway, there's more to say about this, but this is good for now. We want to have this boat, a Bodhicitta, that we can ferry all sentient beings to enlightenment.\n\nAnd in the meantime, we make connections to living beings, so they can do that. Inexhaustible and increasing fruits of Bodhicitta. Fruits other than Bodhicitta are like the banana or plantain tree, the fruits of which are limited and soon exhausted.\n\nFor instance, a person becomes rich because of their practice of giving in a previous life, but the fruits of such virtue are gradually used up. When these riches are finished, no more will come. In contrast, the virtuous fruits from the celestial tree of Bodhicitta are inexhaustible.\n\nThey are like a drop of water that falls into a vast ocean, and is therefore never lost until that great ocean itself becomes no more. Even though our virtues in general may be weak, when motivated by Bodhicitta, their fruits will never be exhausted until we attain complete awakening. Who are the fruits?\n\nWhy are the fruits of such actions limitless? There are two reasons for this. First, since the number of sentient beings benefited by Bodhisattva is countless, the merit arising from actions created for their sake will likewise be limitless.\n\nSecondly, since all such merit is dedicated solely for our attainment of enlightenment, it will not be exhausted until this enlightenment is reached. It's said that giving even a little food to a single beggar, if done with the motivation of Bodhicitta, produces inexhaustible merit. If we lack such a motivation, it does not matter how much gold or silver we give to no matter how many people.\n\nThe fruits of such virtuous actions are limited and will soon be exhausted. When we realize how abundant are the fruits of all actions proceeding from Bodhicitta, we will see that there is nothing more important than striving to attain this precious mind. This is a bit linked to earlier, I think it was David's point about special name and meaning, which is that the mind of Bodhicitta creates like a flywheel effect, or like a self-reinforcing effect.\n\nBasically, it keeps creating more and more and more merit, and that more and more merit creates even more and more merit. It's like an infinite cycle until you become a Buddha. Other virtues kind of like go whoop, and they peter out if they're not properly dedicated.\n\nSo they lead to a good result, and then they just disappear. The Bodhicitta mind creates this infinite, almost like a recursive or repeating cycle, and this just kind of continues on itself until we become enlightened. So part of this is like starting to really learn to trust Bodhicitta, and trust intention, and especially the intention of Bodhicitta, even if it's a fabricated one, which is like doing any action with even a fabricated Bodhicitta.\n\nJust the thought, may this lead to enlightenment for the benefit of others, will have incredibly positive effects. It's like the trusting in it, or believing in its efficacy, that particularly makes it potent. So there's sort of having Bodhicitta, maybe we're not there yet, that obviously is going to be incredibly beneficial.\n\nThere's generating the intention just in a fabricated way, like having the words, I endow the sentient beings, by giving them other perfections, may I become a Buddha for the benefit of all. Okay, that's still helpful, but there's a little spot in between these two, which is what we're talking about here. It isn't just that, it's that plus a trust in its ability to help us, or to create good karma, or limitless karma, or like a faith in it.\n\nSo you're still, it's still a fabricated Bodhicitta, it's still artificial, it's not a real deal, but there's a faith in the karma being created, that's what makes it incredibly powerful. That's a different feeling, than just kind of going through the motions, or like in a rote way. You still don't need to have Bodhicitta, but you're having this sort of faith, in like trying to have it, or like to generating a fabricated version of it.\n\nLike okay, this is creating good karma, through me trying to have this good intention. So for example, if we start living in that space, we're happy to do anything, because anything can just be done with our Bodhicitta mind. So anything that shows up, we just think, fantastic!\n\nI'm going to create this Bodhicitta intention, and I'm going to create so much merit and good fortune, I'm happy to do anything. So of course this involves us looking at our belief in karma, and our faith in karma. Which is often like, with a lot of practices, there's a sense of like hitting a bedrock, of like an obstacle.\n\nSometimes it's our self-grasping, sometimes it's our pride, sometimes it's our distraction, sometimes it's our self-cherishing, but sometimes it's our belief in past and future lives. But our faith in karma is often one of these bedrocks. It's like, okay, I'm doing this practice.\n\nOkay, that's not exactly working. Why is it not working? Well, it's not working because of this.\n\nOkay, but why is that not working? Well, it's not working because of that. And why is that not working?\n\nIt's because I don't believe in karma. Like that. You can just do this exercise with a lot of different things.\n\nLike peel the onion, right? And there's this issue, and then that's based on that issue, and that's based on this issue, and oops, what's underneath that one? It's an issue with karma.\n\nLike an inadequacy of our understanding of karma. So we can look at our own life, and just see to what degree do we believe in karma? There's, again, a huge spectrum.\n\nThere's from virtuous actions come happiness, from non-virtuous actions come suffering. If we believe in this, we believe in karma. That's what Geshe-la says in modern Buddhism.\n\nWe'd probably all agree with that. Virtuous actions come happiness. Non-virtuous actions come suffering.\n\nIf I believe in this, I believe in karma. Yeah, sure, yeah. We believe that love leads to happiness, and anger leads to suffering.\n\nActions that are anger, yeah. We'd all probably agree with that. That's like this end of the spectrum, right?\n\nThis end of the spectrum is Buddha's understanding of karma, which is understanding every single cause and effect relationship between every single experience. So, for example, why this specific crystal is here, right? Each one of us actually created karma at some point in a past life to be here, to be in TTP together, to be seeing this specific crystal.\n\nSo Buddha understands that. None of us, unless you're Buddha, understand that. That's almost impossible to understand for an ordinary mind.\n\nSo there's a whole spectrum, right? So in our practice, we're going to keep running into issues if our understanding of karma isn't being tended to, if our faith in karma isn't being tended to. For example, if we're an over-thinker and we suffer from that, it's just because we don't really believe in karma.\n\nIf we just believe in karma, we'd stop overthinking everything. First of all, we'd just think, yeah, this is my karma. And we'd think, all I can control, basic, is my intention and my good heart.\n\nAnd then that will create good karma. So I don't need to overthink this. It's not thinking it through that gets me the right answer.\n\nIt's having a good heart, mostly. The good heart is the right answer, that is, right? Acting with the good heart is the right answer.\n\nIt's not option A or option B that's the right answer. Anyway, you get the idea, right? So it's like, okay, if I overthink a lot, okay, that's just a karma issue.\n\nIf we have anger problems and non-acceptance problems, they're just all karma issues. The understanding of karma basically single-handedly solves all anger problems, all blame problems. We get rid of all blame.\n\nIf we're maybe discouraged in our actions of benefiting others, like maybe we're teaching dharma, right, and we just don't feel like it's really helping people, or they're not appreciating what we're doing, or it's not going how we want it to go, right, the discouragement is just coming from not understanding karma fully. Anyway, we can go on and on and on. I don't need to belabor the point.\n\nBut I'm just encouraging us all to just look at this for ourselves. These kind of issues are why we do the Lam Rim, why we meditate on Lam Rim, because it forces us repeatedly to come back to karma, at least every 20 days, but you end up coming up to it more often because it's sort of embedded in a lot of the other Lam Rim meditations. Okay, and understanding karma will give us this appreciation for bodhicitta because it creates infinite merit just through basically one action done with bodhicitta.\n\nPower of protection from great fear. A man traveling in an area where there is great danger from robbers and wild animals will be filled with great fear. However, if he entrusts himself to the protection of a courageous guide, he will immediately be relieved of his anxieties.\n\nWe human beings, because we've committed very harmful and evil actions in the past, are likewise exposed to the fearful dangers of birth in one of the three lower states of existence, as a hell being, hungry spirit, or animal. Even as a human being, we fear birth, sickness, loss, violence, old age, death, and the other painful effects of our non-virtuous actions. What is the power to relieve us of this fear?\n\nOnly the precious bodhicitta. Therefore, why do those who are vigilant and wise not devote themselves to the development of this precious mind? We can approach this in different ways.\n\nOne way is if you really have been affected by a lot of anxiety and fear in your life, you can develop almost like a renunciation for fear. Just like, I never want to feel fear again. Deluded fear.\n\nI never want to feel that way again. I hate feeling that way. I hate being afraid.\n\nI hate when I know something is right, but I'm too afraid to stand up for it. And being meek like that. I hate feeling like that.\n\nI hate overthinking something that I can't control and feeling terrified. I hate feeling like that. I never want to feel that way.\n\nI despise just feeling overcome with anxiety and worry. Not being able to sleep at night. I don't want to ever worry about finances and health and being liked and being approved of ever again.\n\nI don't want to worry about any of those things. It's a pain. I can't even enjoy my life when I'm worrying about those things.\n\nSo we can develop this, it's like a wish to overcome fear. I don't want to deal with fear again. Ever again.\n\nAnd if we develop that sense, it's very beautiful. Because then we just develop this wish, I need an answer. I need something that will actually free me from fear.\n\nBut what will do that for us? All fear comes from attachment. And all attachment comes from self-cherishing.\n\nSo we need something that can oppose self-cherishing. Or else we can never overcome all fear. As Geshe-la says later in Meaningful to Behold, all fears, anxieties, and worries are born from the self-cherishing mind.\n\nSo we can think, I want to develop bodhicitta because I never want to feel fear again. I want to be a fearless being. And not just for me, but wouldn't that be amazing in this world of so much fear, of so much anxiety, to be a fearless person.\n\nTo kind of have this impenetrable strength for others. So that when they're afraid, and they come to us saying, this has happened, I just got this diagnosis, or this has happened to my child, and I'm so scared. Or this has happened to me, and I don't know what to do.\n\nOr this is happening in the world, and I'm worried for my family. When those people come to us, of course we can put on a good face and try to support them. But if we can be truly fearless, and to say, have no fear.\n\nI can protect you. I can be a refuge for you. Wouldn't that be amazing if we could be that for people?\n\nAnd they'll feel that if we have overcome our fear. So this is a nice benefit. It has a slightly different flavor.\n\nI mean, you can look at it from a different point of view, which is, it helps us overcome lower rebirth. And that works too. I find this angle useful for me, personally.\n\nJust thinking, I never want to feel that way again. Amazing. There's a state of mind that will protect me forever.\n\nAnd will protect others forever. If I can get that mind. Swift and easy destruction of great evil.\n\nThe world in which we live undergoes great cycles of birth and decay. At the end of the present great eon, our universe will be completely destroyed by fire. So that not even the ashes of it will remain.\n\nThis all-consuming fire will be completely different from the ordinary fires of this world. And thousands of times more intense. If we give birth to the precious bodhicitta, the fire of that mind will be similarly intense, sufficient to consume instantly all the immeasurable evil we have accumulated.\n\nSo the difference between this and conquering great evil, which is earlier, this is more the sense of purifying, purification. That one is more about overcoming non-virtues, delusions, etc. So this is like, we'll purify all of our negativity.\n\nThere's also the feeling here about swift, which obviously is embedded in a lot of the other reasons, but is kind of drawn out explicitly here. Swift and easy. As we know, there's this idea that a bodhisattva goes from joy to joy, as they progress through the grounds and paths.\n\nThey go from joy to joy. Wouldn't that be nice? To feel like our spiritual path is like that.\n\nJoy to joy. It's not like pulling teeth. It's just joy to joy.\n\nSo the bodhisattva's mind is like this. It's suffused with the six perfections. It's suffused with the understanding of emptiness, and patience, and joyful effort, and giving, and moral discipline, and concentration.\n\nJust like swift and easy purification at that point. Scriptural citations of the benefits of bodhicitta. The extensive benefits of bodhicitta were explained to the bodhisattva Sudhana by Buddha Maitreya in Stalks of Arayasutra, Gandavyuha Sutra.\n\nIn the conclusion to this 14th verse, Shantideva advises those who wish to learn about these many advantages to consult that famous Mahayana scripture. Have fun with that. Stalks in Arayasutra.\n\nWe're going to do a little bit... We're not going to do this now. The rest of this bit.\n\nBecause this all is going to fit together in one little flow. I'll just say a couple of other little words, and then we'll take a break. Earlier, I was talking a little bit in the data sharing about this personal relationship with our spiritual guide.\n\nAnd really letting our spiritual guide guide us. Just as if you were climbing a mountain, or going through some deeply wooded area, you might have a guide. Really letting our spiritual guide guide us personally.\n\nIn the practice of the Six Session Guru Yoga, it's called Six Session Guru Yoga. It's not called Six Session Fun Dance, or Six Session Hangout Session. It's called Six Session Guru Yoga.\n\nSo of course, we're customizing it, and making it work for us. That's part of our Guru Yoga practice, right? But part of it is starting to build these six check-ins with our spiritual guide throughout the day.\n\nThey're like six check-ins. And we have to remember that our guru is a Vajrayana yogi. Not like a Sutra yogi, but a Vajrayana spiritual guide who is trying to help us destroy our ordinary appearances and conceptions.\n\nThat's what our guru is helping us do, which is a personal journey. It's actually from offering to the spiritual guide. And then the swirling ocean of the tantras is crossed through the kindness of the navigator, the Vajra holder.\n\nI seek your blessings to cherish more than my life, the vows and commitments, the root of attainments. To the yoga of the first stage that transforms birth, death, and bardo into the three bodies of the conquerors, I seek your blessings to purify all stains of ordinary appearance and conception and to see whatever appears as the form of the deity. As it says here, to practice secret mantra we must first receive the kindness of an empowerment from a qualified Vajrayana spiritual guide.\n\nHe's like a navigator who guides us across the swirling ocean of the tantric scriptures and practices. So, I'm just sharing this because we're trying to emphasize this succession practice. And part of it is like allowing our spiritual guide to guide us.\n\nAnd because their job is a Vajrayana spiritual guide, their job is to help us, as it says here, I seek your blessings to purify all stains of ordinary appearance and conception and to see whatever appears as the form of the deity. So, their job is to help us purify all stains of ordinary appearance and conception, which basically means seeing an ordinary world, a world born of self-grasping. So, their job is to help us break out of our ignorance.\n\nThat's not like a straight linear path, right? The spiritual guide's trying to break us out of our conditioning, our mental conditioning. That's not going to be a straight and linear sort of journey and just a completely straightforward thing.\n\nBecause if it was completely straightforward, it probably would just be very comfortable for our ordinary appearances and conceptions. We'd go, yeah, this is comfy, this is cozy for me, this is exactly what I would like. So, not necessarily opposing our ordinary views.\n\nWe're just thinking samsara is quite nice, actually. This is comfy. So, if we just want things to be easy, the spiritual guide will do that for us.\n\nHe'll give us whatever we want. If we want to just be easy in samsara, he won't take us on this journey to free our mind, if that's what we want. But if we do want that, we can really ask.\n\nWe can say, I don't want some safe, sterile journey that's just comfortable all the time and easy all the time. I want you to liberate me. I want to break through my ordinary appearances and conceptions.\n\nI don't care if it's not comfortable. I don't care if there's suffering that I have to look at or go through. Because I want to be liberated.\n\nI want to free my mind. And so, if we create that relationship with our spiritual guide and request that, we'll get that. We'll get that.\n\nBut then we have to take the call when it comes. Or else he'll say, OK, you didn't really want it. OK, back to comfort land.\n\nWhich is nice, and hopefully we'll get snatched in the Bardo and go to the Pure Land. Because he'll take care of us then if we don't make it happen now. But we can.\n\nWe can break out of the ordinary world in this life. But that involves beseeching the Vajrayana spiritual guide or guru to do that for us. So it's like for me, when I'm doing my six session practice, I can say, Geshe-la, please help me today.\n\nHelp me break out of my ordinary appearances and conceptions. Help me stop seeing things as ordinary. Even if that means absolutely getting sideswiped by something and having my day ruined.\n\nEven if that means things going terribly today. If that's what I need to break out of my ordinary ways of seeing, then let that happen today, please. When we start having that view and that request to our spiritual guide, we can talk personally and request that.\n\nThen we will. We'll meet our Vajrayana spiritual guide who will help us do that. It might not always be easy or comfortable, but it will be what we need.\n\nI'm just sharing this so that we can keep improving our guru reliance and keep this connection open. Just really check, do I have this willingness to really be guided? Or do I just want it to be easy and anesthetized and comfy?\n\nOr do I want to break out of my ordinary appearances and conceptions? What do I really want for my life?"
      },
      {
        "speaker": "Anne",
        "time": "3:14:07",
        "text": "I might be misunderstanding what you're saying, but it seems to me that if you were really willing to be guided, it really would be easy."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "3:14:17",
        "text": "Yeah, totally. If we experience everything that occurs as, this is given to me by my guru as a test, as a gift, as an opportunity, this is a special appearance just for me. If we have that view, it's incredibly easy.\n\nBut sometimes it takes having those things occur and not having that view to train in having that view. Does that make sense? And that's not easy.\n\nRejecting what's appearing to us is not easy. That's incredibly painful. Having this view fully and completely is easy and blissful.\n\nYeah, yeah. But it's a total, like every time we think, like if we really have this request, like, Geshe-la, give me exactly what I need to break out of my ordinary appearances and conceptions. If we make that deal, that handshake, we say, like, I'll do that.\n\nI'll take whatever you give me. Then if something shows up, we have to think, that's exactly for me. We can't then think, no, you didn't get the message.\n\nI wanted it like a little different. Then the deal is broken. We're saying, no, actually, I don't want to be guided.\n\nWhich is fine. We say that. But we have to go with it.\n\nIf we're given that opportunity, we have to embrace it at that point to keep the deal. This is like, it's called our samaya. It's like our guru relationship.\n\nIt's a very holy relationship. It's a very sacred relationship. But we have to take these gifts when they're given.\n\nIf we reject them, we're just saying, I don't want that right now. I don't want to be liberated right now. Which is okay.\n\nIt's our choice. We just do what we need to do then. Anyway, I just wanted to share this a little bit.\n\nOkay. So let's have a little time for discussion. Let's see.\n\nLet's have David and Dale. And let's have Mimi and Byron. And Marianne and Sharon.\n\nAnd Fran and Sumit. And Anne and Jose."
      },
      {
        "speaker": "Student",
        "time": "3:17:29",
        "text": "I think we can keep talking about that."
      },
      {
        "speaker": "Mimi",
        "time": "3:17:42",
        "text": "I mean, you could also say right to and when."
      },
      {
        "speaker": "Student",
        "time": "3:17:49",
        "text": "Yes, I was. Last Sunday, Monday, Tuesday."
      },
      {
        "speaker": "Student",
        "time": "3:17:54",
        "text": "And I went back home. Which is like how my time was."
      },
      {
        "speaker": "Student",
        "time": "3:18:00",
        "text": "Everybody wants to do it that way. But in this case, it's not like it's too long. Yeah."
      },
      {
        "speaker": "Student",
        "time": "3:18:13",
        "text": "I have to say for a start, I really dislike that idea that it's supposed to be hard. You know, that it's going to be hard."
      },
      {
        "speaker": "Student",
        "time": "3:18:22",
        "text": "I don't believe that it's going to be super easy."
      },
      {
        "speaker": "Student",
        "time": "3:18:28",
        "text": "Like I really think if you're struggling or suffering, you're creating a problem."
      },
      {
        "speaker": "Anne",
        "time": "3:18:35",
        "text": "Right? And I think there's this sort of implication sometimes of like, it's going to be hard. It's going to be a struggle."
      },
      {
        "speaker": "Student",
        "time": "3:18:43",
        "text": "If it's not a struggle, then you're going to be in a problem."
      },
      {
        "speaker": "Anne",
        "time": "3:18:46",
        "text": "I just don't like that idea."
      },
      {
        "speaker": "Student",
        "time": "3:18:48",
        "text": "Right, yeah, yeah, yeah."
      },
      {
        "speaker": "Mimi",
        "time": "3:18:50",
        "text": "I know personally, I can say, yes, suddenly what?"
      },
      {
        "speaker": "Student",
        "time": "3:18:59",
        "text": "It's not like that. It's like, you know what?"
      },
      {
        "speaker": "Student",
        "time": "3:19:01",
        "text": "Yeah, yeah. You don't know how to do this."
      },
      {
        "speaker": "Student",
        "time": "3:19:04",
        "text": "You don't know what you're trying to do."
      },
      {
        "speaker": "Student",
        "time": "3:19:47",
        "text": "I get it. Of course, I'm still talking. I understand.\n\nYes. Yes. Yes."
      },
      {
        "speaker": "Anne",
        "time": "3:20:01",
        "text": "Yes. Yes. Yes.\n\nYes. Yes. Yes.\n\nYes. Yes."
      },
      {
        "speaker": "Student",
        "time": "3:20:47",
        "text": "Yes. Say again, like, oh, I'm not really entertaining the audience. So please, like, if I was an artist, like, if I say, like, here's what I'm supposed to do, what I'm supposed to do with myself, I'm making myself some art."
      },
      {
        "speaker": "Student",
        "time": "3:21:01",
        "text": "It's not a situation. I was thinking that. I understand."
      },
      {
        "speaker": "Mimi",
        "time": "3:21:04",
        "text": "I understand what you're thinking."
      },
      {
        "speaker": "Student",
        "time": "3:21:06",
        "text": "But what I'm thinking I get is some material that I feel like is entirely alive and just feels like an art of some kind."
      },
      {
        "speaker": "Student",
        "time": "3:21:15",
        "text": "Yeah, I learned from Charles."
      },
      {
        "speaker": "Student",
        "time": "3:21:17",
        "text": "It's a good question. I don't know if I understand it right."
      },
      {
        "speaker": "Student",
        "time": "3:21:21",
        "text": "It's the first one I missed because of the light. Yeah, I didn't like it."
      },
      {
        "speaker": "Mimi",
        "time": "3:21:26",
        "text": "Why am I moving on to it? Yeah. Why am I moving on to it?\n\nIt is very difficult. It is."
      },
      {
        "speaker": "Student",
        "time": "3:21:31",
        "text": "Like, I do see how the people I am not that interested in that it's just a habit."
      },
      {
        "speaker": "Student",
        "time": "3:21:40",
        "text": "Yeah. I know. Yeah.\n\nI didn't want to see it. I didn't want to see it. At least in the beginning.\n\nYeah. Yeah. It's like a certain outcome.\n\nExactly."
      },
      {
        "speaker": "Student",
        "time": "3:21:52",
        "text": "It's like, hey, everybody, wait a minute while I go."
      },
      {
        "speaker": "Mimi",
        "time": "3:21:55",
        "text": "Right. Hold on. You're telling me now."
      },
      {
        "speaker": "Student",
        "time": "3:22:00",
        "text": "I just think I need to get out of these days. I'm just trying to work through it. It's a habit."
      },
      {
        "speaker": "Student",
        "time": "3:22:09",
        "text": "What do you think? Well, I really like that idea, and I think it's true for every problem."
      },
      {
        "speaker": "Student",
        "time": "3:22:18",
        "text": "Any problem you're experimenting with is experiencing itself."
      },
      {
        "speaker": "Student",
        "time": "3:22:26",
        "text": "I just always want to be able to always be able to trace back and forth. It's always a time to consider. My favorite part was the idea that you don't have to worry about the problem, and you just take action."
      },
      {
        "speaker": "Anne",
        "time": "3:22:41",
        "text": "You have the potential. That's what it was."
      },
      {
        "speaker": "Student",
        "time": "3:22:44",
        "text": "But then you're like, that's the only thing I do that I want."
      },
      {
        "speaker": "Mimi",
        "time": "3:22:48",
        "text": "Yeah. But I forget. I'm just going to say, I understand.\n\nI feel like I forget when I get into a lot of these, because it's like back to saying that I'm a little bit mad about it. No, it isn't mad. It sounds to me more so the way that I hear it.\n\nIt's really not mad. It's like, really?"
      },
      {
        "speaker": "Student",
        "time": "3:23:12",
        "text": "So it's like, no, I'm not really going to do that. So it's such a hard thing for me to say. I don't believe it.\n\nI'm just trying to be able to lie. I'm just saying that once again, it's such a hard thing to say."
      }
    ],
    "conclusion": [
      {
        "speaker": "Kadam Kyle",
        "time": "3:33:18",
        "text": "What would we like to do in the break, please? What would we like to break about? And you have a mic?\n\nIs that on purpose?"
      },
      {
        "speaker": "Anne",
        "time": "3:33:32",
        "text": "Let me try to say this succinctly. We were thinking about the idea that with bodhicitta, we will always have a good intention. If we always have a good intention and we believe in karma, we can relax because we know the results of all of our actions will always be good."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "3:33:50",
        "text": "Set a bodhicitta intention and relax. That last bit is really important in any intention-setting practice because it's a sign that we're actually setting an intention. Because if we do, we would just relax.\n\nIf we really are setting that bodhicitta intention, then we just relax because it's enough. Sometimes you have to go step one, let me generate the intention. Step two, now I relax.\n\nIt's that relaxing part that actually makes the practice really work. It's a lovely mindfulness practice to do in the day. Others?\n\nSharon?"
      },
      {
        "speaker": "Mary Ann",
        "time": "3:34:37",
        "text": "I just thought it was really interesting what you're saying, that we all have these bedrocks. Then just to beseech the spiritual guide, help me break through my particular bedrock. I like that idea a lot."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "3:34:52",
        "text": "Yeah, I love that too. It's like, come on, help me jackhammer through that bedrock or dissolve it or blow it up or whatever our favorite destruction mechanism is. Dissolve it, yeah.\n\nDisappear it, whatever it is. Yeah, I'm with you. It's like, let's find those bedrocks for ourselves and ask our guru to work through it.\n\nFran, that's a hand. That's a nose scratch slash hand."
      },
      {
        "speaker": "Mimi",
        "time": "3:35:26",
        "text": "Just to add to what Anne was saying during the break to look at situations and see how and just evaluate our trust in karma, our faith in karma."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "3:35:40",
        "text": "Yeah, just kind of check in. Definitely."
      },
      {
        "speaker": "Mimi",
        "time": "3:35:45",
        "text": "Okay, that's pretty good."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "3:35:49",
        "text": "Then eat donuts and drink coffee at the holiday brunch party. Come on. I even noticed one is a hot coffee and one is a cool coffee.\n\nIt doesn't have heat at it. So it's for both types of people. So it's a win-win, no matter what kind of person you are.\n\nOkay, I think that's it. Thanks, everyone. Let's do it.\n\nOh, yeah, I don't think I announced this, but to be clear, the 21st we don't have TTP. So next week is our last one, and then we'll take a break for two weeks just because of the way the holiday times line up. So this is a heads up.\n\nOkay, let's finish with the dedication prayers, please. Maybe just the nine-line miksema. It's good."
      }
    ]
  }
}