{
  "classId": "jan11",
  "date": "January 11, 2026",
  "session1": {
    "chantedPrayers": {
      "time": "1:30",
      "text": "LIBERATING PRAYER\n\nO Blessed One, Shakyamuni Buddha,\nPrecious treasury of compassion,\nBestower of supreme inner peace,\nYou, who love all beings without exception,\nAre the source of happiness and goodness;\nAnd you guide us to the liberating path.\n\nYour body is a wishfulfilling jewel,\nYour speech is supreme, purifying nectar,\nAnd your mind is refuge for all living beings.\n\nWith folded hands I turn to you,\nSupreme unchanging friend,\nI request from the depths of my heart:\n\nPlease give me the light of your wisdom\nTo dispel the darkness of my mind\nAnd to heal my mental continuum.\n\nPlease nourish me with your goodness,\nThat I in turn may nourish all beings\nWith an unceasing banquet of delight.\n\nThrough your compassionate intention,\nYour blessings and virtuous deeds,\nAnd my strong wish to rely upon you,\nMay all suffering quickly cease\nAnd all happiness and joy be fulfilled;\nAnd may holy Dharma flourish for evermore.\n\nGOING FOR REFUGE\n\nI and all sentient beings, until we achieve enlightenment,\nGo for refuge to Buddha, Dharma and Sangha. (3x)\n\nGENERATING BODHICHITTA\n\nThrough the virtues I collect by giving and other perfections,\nMay I become a Buddha for the benefit of all. (3x)\n\nGENERATING THE FOUR IMMEASURABLES\n\nMay everyone be happy,\nMay everyone be free from misery,\nMay no one ever be separated from their happiness,\nMay everyone have equanimity, free from hatred and attachment.\n\nVISUALIZING THE FIELD FOR ACCUMULATING MERIT\n\nIn the space before me is the living Buddha Shakyamuni surrounded by all the Buddhas and Bodhisattvas, like the full moon surrounded by stars.\n\nPRAYER OF SEVEN LIMBS\n\nWith my body, speech and mind, humbly I prostrate,\nAnd make offerings both set out and imagined.\nI confess my wrong deeds from all time,\nAnd rejoice in the virtues of all.\nPlease stay until samsara ceases,\nAnd turn the Wheel of Dharma for us.\nI dedicate all virtues to great enlightenment.\n\nOFFERING THE MANDALA\n\nThe ground sprinkled with perfume and spread with flowers,\nThe Great Mountain, four lands, sun and moon,\nSeen as a Buddha Land and offered thus,\nMay all beings enjoy such Pure Lands.\n\nI offer without any sense of loss\nThe objects that give rise to my attachment, hatred and confusion,\nMy friends, enemies and strangers, our bodies and enjoyments;\nPlease accept these and bless me to be released directly from the three poisons.\n\nIDAM GURU RATNA MANDALAKAM NIRYATAYAMI\n\nPRAYER OF THE STAGES OF THE PATH\n\nThe path begins with strong reliance\nOn my kind Teacher, source of all good;\nO Bless me with this understanding\nTo follow him with great devotion.\n\nThis human life with all its freedoms,\nExtremely rare, with so much meaning;\nO Bless me with this understanding\nAll day and night to seize its essence.\n\nMy body, like a water bubble,\nDecays and dies so very quickly;\nAfter death come results of karma,\nJust like the shadow of a body.\n\nWith this firm knowledge and remembrance\nBless me to be extremely cautious,\nAlways avoiding harmful actions\nAnd gathering abundant virtue.\n\nSamsara's pleasures are deceptive,\nGive no contentment, only torment;\nSo please bless me to strive sincerely\nTo gain the bliss of perfect freedom.\n\nO Bless me so that from this pure thought\nCome mindfulness and greatest caution,\nTo keep as my essential practice\nThe doctrine's root, the Pratimoksha.\n\nJust like myself all my kind mothers\nAre drowning in samsara's ocean;\nO So that I may soon release them,\nBless me to train in bodhichitta.\n\nBut I cannot become a Buddha\nBy this alone without three ethics;\nSo bless me with the strength to practice\nThe Bodhisattva's ordination.\n\nBy pacifying my distractions\nAnd analyzing perfect meanings,\nBless me to quickly gain the union\nOf special insight and quiescence.\n\nWhen I become a pure container\nThrough common paths, bless me to enter\nThe essence practice of good fortune,\nThe supreme vehicle, Vajrayana.\n\nThe two attainments both depend on\nMy sacred vows and my commitments;\nBless me to understand this clearly\nAnd keep them at the cost of my life.\n\nBy constant practice in four sessions,\nThe way explained by holy Teachers,\nO Bless me to gain both the stages,\nWhich are the essence of the Tantras.\n\nMay those who guide me on the good path,\nAnd my companions all have long lives;\nBless me to pacify completely\nAll obstacles, outer and inner.\n\nMay I always find perfect Teachers,\nAnd take delight in holy Dharma,\nAccomplish all grounds and paths swiftly,\nAnd gain the state of Vajradhara.\n\nRECEIVING BLESSINGS AND PURIFYING\n\nFrom the hearts of all the holy beings, streams of light and nectar flow down, granting blessings and purifying."
    },
    "guidedMeditation": [
      {
        "speaker": "Kadam Kyle",
        "time": "14:13",
        "text": "Meditation on equanimity. We can begin by thinking of three people. One person we feel unhappy towards.\n\nOne person we're attached to. One person we feel indifferent towards. Begin by just exploring what is it inwardly that makes us put them in these categories.\n\nUpon reflection we want to see that being attached to some, averse to others and indifferent towards the rest is completely pointless and ultimately harmful. Just reflect on the unbalanced effect these views have on us and make a strong determination. I want to abandon completely these unbalanced minds.\n\nThe basis of this determination can try to put all three people into one new group. The object of a warm, friendly, affectionate love. Just imagine or explore what that feels like.\n\nAnd if you're having trouble, you can use some logic and reasoning from the text to dislodge these stuck, deluded views. And in our own time, we can gradually arise from our practice."
      }
    ],
    "classIntro": [
      {
        "speaker": "Kadam Kyle",
        "time": "29:30",
        "text": "Okay, welcome.\n\nOh, I forgot my guide to the bodhisattva's way of life. Oopsie. Oh, yeah?\n\nWhat? Oh, there's one there. Okay.\n\nThere's definitely one in the basement. Here, no, take yours back, Adriana. There we go, a little switcheroo.\n\nOkay, so we'll be reading from the text. Can you hear okay back there? No, can you hear okay?\n\nBecause it seems like it's not that. No, no. Okay, yeah, because it seems like it's low.\n\nThat's why I'm asking. Yeah, yeah, okay. Yeah, Sumit, could you turn it up more?\n\nThanks. Yeah, yeah, we can just end it. Yeah.\n\nThere you go. Is it better now, Dale, the sound? Do you want a little bit more?\n\nYeah. Yeah, Sumit, could you? Yeah.\n\nThank you, yeah. Good. I'm glad, thank you.\n\nYeah, I think when the person sits by the speaker, it always sounds louder because the sound is kind of funky in this room, this side. It's always much, much quieter. Okay, cool.\n\nLet's see. Read from the text, the condensed meaning. Anyone want to be the honorary reader?\n\nOnline, in person, et cetera? David, fantastic. Okay, so go from verse 15 to 25, and then we'll join in with you."
      }
    ],
    "shantidevaReading": [
      {
        "speaker": "David",
        "time": "30:53",
        "text": "(15) In brief, you should know\nThat bodhichitta has two types:\nThe mind that observes enlightenment and aspires,\nAnd the mind that observes enlightenment and engages.\n\n(16) Just as the distinction between wishing to go\nAnd actually going is understood,\nSo, respectively, the wise should understand\nThe difference between these two bodhichittas.\n\n(17) From the mind that aspires to enlightenment,\nGreat effects arise while in samsara;\nBut an uninterrupted flow of good fortune does not ensue\nAs it does from the engaging mind.\n\n(18) For whoever takes up the engaging mind of bodhichitta\nWith the intention never to turn back\nFrom completely liberating\nThe infinite living beings throughout all realms,\n\n(19) From that time forth, for him there will arise —\nEven if he is asleep or apparently unconcerned —\nVast and powerful merit, equal to space,\nThat flows without interruption.\n\n(20) For the sake of those with lesser inclinations,\nThese benefits were explained with logical reasons\nBy the Tathagata himself\nIn Sutra Requested by Subahu.\n\n(21) If even the thought to relieve\nThe headaches of others\nIs a beneficial intention\nThat results in infinite merit,\n\n(22) What can be said of the wish\nTo dispel the immeasurable misery\nOf each and every living being\nAnd lead them all to countless good qualities?\n\n(23) Does our father or mother\nHave such a beneficial intention as this?\nDo the gods or the sages?\nDoes even Brahma himself?\n\n(24) If, before generating bodhichitta, these living beings\nDo not even dream of such a mind\nFor their own sakes,\nHow will they develop it for the sake of others?\n\n(25) This mind to benefit living beings,\nWhich does not arise in others even for their own sakes,\nIs an extraordinary jewel of a mind,\nWhose birth is an unprecedented wonder."
      }
    ],
    "postReading": [
      {
        "speaker": "Kadam Kyle",
        "time": "33:36",
        "text": "I would love to hear any glorious practice data, even if it was an epic failure of magnificent proportions. We love that. That's fantastic.\n\nWhatever you have is great."
      }
    ],
    "teaching": [
      {
        "speaker": "Kadam Kyle",
        "time": "33:36",
        "text": "I would love to hear any glorious practice data, even if it was an epic failure of magnificent proportions. We love that. That's fantastic.\n\nWhatever you have is great."
      },
      {
        "speaker": "Anne",
        "time": "33:58",
        "text": "It's weird. I've never done this meditation before. It was so fun.\n\nI kind of already feel friendly toward everyone. I have some bad qualities. That's a good quality I have.\n\nBut what I did was, so I'm going around Brooklyn. I'm like, who did I pass by and would I like to have coffee with? And the answer was everyone.\n\nSo then I'm like, who would I want to have dinner with? It would be like three hours. And like, nobody.\n\nAnd then like maybe once a day there was some person, I'm like, that person, right? And I'm like, what do these people all have in common? Because they were different races and ages, and some people looked like funky, and some people looked like professionals.\n\nAnd I realized they all looked like they were very successful, which surprised me because I think of myself as being very egalitarian. And I'm like, it's not that I admire successful people so much, but I just imagine that if you're successful, you must be very smart and very interesting and really fun to have dinner with. So that was one finding that surprised me.\n\nI also, I don't really have a lot of enemies, but I don't have, yeah. So it was hard for me to be like, oh, these are like my foes. But in like the seated meditation, I tried to pick different people in my life in general and just think about how their relationship to me has changed during my lifetime, you know, from like friend to stranger or whatever.\n\nAnd then I thought about how like past lives, like they've been the horse and I've been the rider, or they've been the spider and I've been the fly, or they've been a teacher, I've been the student. And it just struck me how I take my relationship so seriously. And I put so much weight.\n\nThese are my great friends, you know. But this is just a moment in time. There's nothing to it at all, you know.\n\nAnd I felt like I started to like think about the people in my life with a little more lightness. And it doesn't mean I'm going to like not care about them, but it just, it felt really good. It was a very interesting thing to do, and I'm going to keep doing it because it was really informative in a way I didn't expect."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "36:27",
        "text": "Yeah, thanks so much, and it's fantastic. It's like just kind of demonstrating some of the benefits that come from this. So noticing like where the biases in our mind come from, oh, it's because viewing certain people as more successful, whatever that means, and somehow they're more interesting or smart or whatever that got them there, which you should hang out with more successful people.\n\nIt's just karma. It's just like, it's just karma. Anyway, that's another story.\n\nBut yeah, it's so helpful to see like, oh, that's like the thing that triggers it for me. And other people are different, right? It's something else.\n\nBut it's so helpful to see like why we all have our own little biases. And then, yeah, it's nice just to kind of explore these different relationships and see how they're just completely kind of one life dependent right now. And we've had, as you said, incredibly intimate and incredibly harrowing relationships with basically everyone.\n\nSo we can kind of hold on to our friendships and connections and family relationships in this life just in a lighter way. Yeah, which is nice. It's just like for me that feeling that you're describing, which is like just treating a bit lighter, it's always basically going towards dependent relationship more.\n\nWe're going into emptiness more when we feel lighter. And it's from the point of view of ignorance, we use conventional truths. And these conventional truths, they lead us into emptiness.\n\nThese method practices lead us into emptiness. But mostly through reducing the self-cherishing mind. And basically start to feel more like interconnected and this sort of strict walls around everything start to break and everything just seems a bit more permeable and malleable and flexible.\n\nAnd there's something very light that comes. So like taking a person in our life who we have a very serious relationship with and thinking how they were the fly and we were the spider and they were the horse and we were the rider and they were some universal monarch and we were just some peon who got snubbed by them at some point. And everywhere in between, it just really starts to expand a conception of that person.\n\nAnd as we do that, we start to break apart the kind of self-grasping that we have towards them, self-grasping towards others, which is usually related to this one singular inherent person in this life. We might still be grasping at them, but we're grasping a bit less at them. Not as this kind of two-dimensional person just stuck in this one body.\n\nBecause the more we think about that, the more we see who's the real person there? Countless bodies, countless minds, countless experiences. Where's the real person in there?\n\nAnd we just start to see it's just a narrative person. It's just a narrative that we kind of string together with our mind. Anyway, it's great.\n\nThank you so much. Thanks for illustrating some of the ways you can use this. Okay, other equanimity data points and or non-equanimity data points?\n\nDavid, yes."
      },
      {
        "speaker": "David",
        "time": "40:09",
        "text": "I enjoyed what you said last week about how, at least I remembered it with regards to anger, that it's like you're not really angry with the person. You're just angry with your sort of version of them, like the avatar that you've created in your mind. I found it really interesting to contemplate this.\n\nI don't consider myself someone who's overly sort of like politics involved, but I found myself getting annoyed this week. I was like, oh, it's almost like I'm the author of the story, and I've cast somebody as a villain, and then I get annoyed with them when they do villainous things. And I was like, oh, wow, like maybe I have more control over this than I realize.\n\nAnd it's like almost like getting angry or attached to just like a dream character. It's like if you knew it was a dream, you wouldn't really get so caught up in it. And I wasn't able to immediately like recast them in the role of like friend or mother or something like that, but at least sort of it lessened and made much lighter kind of like the way I was thinking about them.\n\nSame with some people at work and stuff like that."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "41:23",
        "text": "Yeah, thanks, David. Yeah, exactly. That's exactly what's going on.\n\nSo we cast the characters, and then we get mad at the characters we cast. It's basically exactly what's happening. And it's incredibly freeing to really see that, especially interpersonal relationships, connections of people.\n\nIt's like my mind created them like this, specifically through paying attention to certain things and ignoring other things. Then it created this image of this unpleasant person, and now I'm marching around yelling in my head at this person that's been created. It's kind of hilarious and sad that we do this.\n\nIt's like samsara can either make us laugh or cry. Those are the two responses. Laughing at the absurdity of it, or crying at the horror of it.\n\nAnd these kind of situations are both like we can laugh at the absurdity of it, and we can also cry at the pain that it brings, because the pain feels so real, right? And it's so overwhelming when we get stuck in these mental places. We feel so lost or full of despair.\n\nAnd so it's so freeing to see like, yeah, my mind's casting the character, and then it's getting angry at the character it cast. I need to start reverse engineering some of these parts that I've cast. Yeah, thank you.\n\nOthers, please? Anyone online? Mimi, yes, thanks."
      },
      {
        "speaker": "Mimi",
        "time": "43:10",
        "text": "Hello, everybody. Hi, Kadam. So this week what I did was concentrate on the subtle body and mind of others.\n\nAnd the moment that this really came alive for me was, so this week my mother was taken into the hospital, and they found these blood clots in her lungs. And I was really, really worried about it, you know? I'm worried about my mom.\n\nIt was on her birthday. And then on Tuesday night, you know, I was like, well, I had to go to branch class, and, you know, David always comes and picks me up, and we were talking about this. And he's, you know, I've been telling him that I was like, you know, thinking about the subtle body and mind, and he said, well, your mom's subtle body and mind is completely healthy, you know, and perfect and beautiful.\n\nAnd I was like, yeah. And it was so relieving and just relaxing and just so nice to think about that, you know, that even though she was in the hospital, that everything was going to be okay in that sense, you know. And, yeah, luckily she came home, and she's well.\n\nBut, yeah, that's what happened this week."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "44:47",
        "text": "Thanks, Mimi, a.k.a. Juliana Guerrero."
      },
      {
        "speaker": "Mimi",
        "time": "44:52",
        "text": "Is that what it says?"
      },
      {
        "speaker": "Kadam Kyle",
        "time": "44:54",
        "text": "Yeah, yeah. That's a good person to be. It's fantastic.\n\nThank you. Yeah, this like shifting our mind, our focus to the very subtle wind and mind of anyone is just so healing and helpful. Others, please.\n\nAdriana, yes, and then Jose after that."
      },
      {
        "speaker": "Adriana",
        "time": "45:20",
        "text": "Hi. So Monday morning I took this project very seriously, like before I started my job. I was like, I'm going to make this spreadsheet of all my enemies.\n\nAnd there were 13. And then by the end of the day, there were 30. And I realized I could just keep going.\n\nAnd for me, I was defining enemy as anybody I have any kind of uncomfortable feeling about anything. So it could be like a little grudge or like, but not that person, you know. So in the first 10 or so, in my spreadsheet, I articulated why I feared or loathed them, because I think it's that kind of thing.\n\nAnd then like something, a good quality about them, something, a kind act. And then I realized that they're all the same. So basically, I don't want people to harm me anymore.\n\nI'm afraid of like, harm and humiliation. I never want it to happen again, whatever they did to me, in quotes. And then any kindness or any good quality is just about like them just doing their best.\n\nLike, oh, this person drives their wife to work. Or this person wears a nice shirt. Like whatever, sometimes I really couldn't think of anything that the person had ever done that was nice.\n\nBut it doesn't matter. So it's like they drink water. Okay.\n\nBut I felt it and I meant it. So I felt like pretty relieved. And I felt like, wow, this is like practicing dharma.\n\nLike actually applying the teachings is really cool. And it's not that hard. That was I was surprised about.\n\nI was like, that spreadsheet took me like 30 minutes maybe. It felt like a decade of spiritual work in the Google spreadsheet, which is really cool."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "47:30",
        "text": "Thank you, Adriana. Yeah, showing the power of really putting these teachings into practice. Not just treating them as like intellectual stuff, right?\n\nBut really using them and looking at our mind quite critically and clearly. It's really like kind of using Geshe Ben Gungyal's practice, right? With the stones.\n\nThat's basically what you did, right? But with the enemy people. Yeah, and what you pointed out, like this category of enemy.\n\nIt's like anyone that we have any kind of aversion towards. So it doesn't need to be over raging anger. But there's definitely people that we all feel a little bit of aversion towards.\n\nLike an avoidance mind, right? Like, ooh, I don't know about that person. Darn, I'm seeing them now, and I don't want to see them right this second.\n\nThat's on the continuum of hatred, right? That's just the kind of germinal seed of hatred. But it's definitely on the continuum.\n\nAnd it's something that we want to break down. Any kind of aversion of any sort. Yeah, so it's nice to include those people.\n\nBecause we want to work on that as we work on our bodhisattva attitude. Thanks so much, Adriano. That's great."
      },
      {
        "speaker": "Jose",
        "time": "48:57",
        "text": "Jose, yes? So I did practice equanimity through the week. At the beginning, I had kind of a hard time because I don't feel that I have too much enemies or people that I can consider my enemies.\n\nSo I wasn't really connecting with that part of the meditation. But then I did exactly what Anne mentioned earlier today, which is just take someone in my life that I've seen pass through the three stages, basically. People that at some point I became very attached to.\n\nAnd then people, that same person then became my object of anger. And that would be very wild for some periods. And some of those people I haven't really seen or talked with in the last 10 years.\n\nSo today, they're pretty much like strangers to me. And seeing how that relationship could change, I think that really helped. Because in the end, it's like, yeah, anyone that I have hatred or attachment to right now can definitely be moved to something else.\n\nIt's not something that's inherently existent. And something that, yeah, it's pretty much in my mind and completely made up. So that really helped.\n\nHowever, I did have one struggle, and it's a question that I have. It's not completely clear to me what's the difference between the mind of equanimity and the mind of affectionate love. And looking at these stages that we are going to do it forward, it looks like affectionate love goes a little bit further ahead.\n\nSo it's probably not good to jump ahead. But it's not clear to me what's the difference between those two. If you could share some light on that, that would be very helpful."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "50:30",
        "text": "Yeah, yeah, thanks, Jose. Yeah, so that exercise of just seeing how people switch categories. Yeah, this is like one of the most essential ways that we break down our sense of inheritance, right?\n\nNot just with people, but with things, right? How a thing has switched categories from good to bad to neutral to good, whatever. It could be an addiction or something we don't like.\n\nIt could be some experience that we're having, how it's gone from good to bad to neutral. Or it could just be the fact that some people see it as good, and we see it as bad, and someone else sees it as neutral. So this is like, it's something that we learn in GP kind of early on to try to help us understand emptiness.\n\nAnd because it's somewhat self-evident, it is a very useful tool. But what we need to do is use it and try to draw the implication of it, that that's unusual. The implication's unusual, which is that things are empty, right?\n\nThe idea, everyone kind of knows it. You walk down the street in Brooklyn, you say, yeah, look at that car. You like it, and I don't like it, and so it kind of depends on the mind.\n\nPeople are like, yeah, agreed. It's perspective. But that's not exactly the answer.\n\nThe answer is, and therefore it's empty. That's the insight, right? And that's very unusual.\n\nPeople don't get that part of it, right? People get, oh, yeah, it's perspective. So, yeah, it's what you're kind of demonstrating, I think, yeah, and Ann pointed this out too, is like, it's that little exercise that actually, if we use it to infer correctly, it can be like a huge, like, like impact on our mind.\n\nBut we just have to kind of use it and then infer what it means. So with people, this is fantastic, yeah. If they can appear as an enemy, a friend, and a stranger to me, they're completely empty, right?\n\nThey're completely empty. Because if they were inherently any of those things, they couldn't appear as any of the other things. And we take that insight and think, okay, well, then I might as well discriminate them in a more useful way, like as my mother or as a Buddha or whatever else.\n\nYeah, thanks. And then your point about equanimity versus affectionate love. Yeah, so there's three types of love, affectionate love, cherishing love, wishing love.\n\nWishing love, wishing people to attain enlightenment. Cherishing love is two levels. It's either equalizing or exchanging self with others, but there's many permutations within that.\n\nBasically, either valuing people as important as ourself or even more important as ourself. Those are the two marks of cherishing love. Affectionate love has many, many permutations, also many levels.\n\nUltimately, it's just a category for a warm, close feeling towards people. But that warm, close feeling has many different levels. It's not just a monolithic thing.\n\nNothing is monolithic, right? It's just a category, like a name for a bunch of experiences. So affectionate love grows as we kind of, yeah, basically go deeper and deeper into our practice.\n\nAnd you could say, like, as you grow your cherishing love, for example, you have a more intense affectionate love, too. If I start to view you as even more important than myself and even as a self, I have the most warm, tender feeling towards you. Because I just see, oh, you're just like me, you know?\n\nAnd we feel so intimate with that person that we're viewing as I or self. So it's not like it stops kind of increasing in its intensity. So the affectionate love that comes from kind of basic equanimity, yeah, it's just like, we could say it's like the lowest grade affectionate love.\n\nAnd then as we view people as mother, that's like a little bit of a higher grade affectionate love. And then it can kind of even go further, like viewing all living beings as supreme. It starts to lead us to a feeling of cherishing love, but it often is like a deeper affectionate love, even.\n\nBecause we start to view people as necessary for our spiritual development, and that makes us feel really warm and friendly towards them. And we're kind of gushing towards them, because we're like, I need you for my spiritual life. Wow, you're not just my mother, you're like the key to my spiritual life, because you serve as the object of my love, my compassion, my patience, and so on.\n\nYeah, so anyway, hopefully that's helpful. It's just like a gradient, it's like a spectrum of warm, close, friendly feelings, which can become mind-bargainly warm, close, and friendly, and just mildly warm, close, and friendly. Yeah, thank you.\n\nKristen, yes?"
      },
      {
        "speaker": "Kristin",
        "time": "56:18",
        "text": "I really appreciate this, and all the instructions from last week, things about being people as a mind trainer versus someone that is an enemy. I think that's a helpful change of label. And similar to what Adriana had done, I feel like I had been thinking about this over the holiday break, actually, kind of people that I feel angry toward, and it's sort of clear how that's really all in my own mind, and kind of I'm reflecting things that are actually things that I feel less than about myself, that I'm sort of then feeling inadequate, but it's like all coming from my own mind, really. But to kind of just admire their good qualities and wish to develop them without feeling guilty about not being there yet myself, I think is helpful in those specific instances.\n\nBut then when working on equanimity, I sometimes worry on like a day-to-day level about a watering down of connection or like a genuine love for people. I think this is probably just tied to lack of faith in my own Buddha potential, but sometimes it just feels like there's limitless beings, and how can I possibly care about all of these limitless beings, some of whom I don't even know, I mean, most of whom I don't even know. And on a day-to-day level, aside from meditation, if I'm engaging with real people on a day-to-day, I'm trying to make a connection, make them feel like they're taking something away from it.\n\nI don't know if this makes sense. Even if you took an example of people coming to a meditation class, it's like, I want to try to connect with everyone, but I can't meaningfully connect with everyone. So I suppose we sort of try to balance it out and make sure that I'm not just hanging out with people that I'm most comfortable with, or that I kind of do this little rotation of...\n\nIt's just hard on a day-to-day level. So I'm curious what people think. And maybe it's just like I approach each individual interaction and sort of then try to think, may all living beings experience this kind of attention and love that I'm doing right now with this one person.\n\nI don't know, just curious."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "59:19",
        "text": "Yeah, thanks, Kristin. Yeah, I think that prayer that you just mentioned is a really good way to do that. May everyone, through this interaction and me cherishing this one person, may everyone feel cherished everywhere.\n\nMay everyone find the love that they're looking for. I think that's a wonderful way to do it. But just alternatively, it's just remembering too that our love is a mental practice.\n\nIt's not a physical thing. It's a mental state. So being with one person doesn't mean that we're not loving all living beings.\n\nSo like when you're with the kiddos, you're spending a lot of time with them, like one-on-one, or one-on-two. And it's important to think like, in my mind, right, I can be holding all living beings as supreme and valuable, and loving all of them. And it's just manifesting with this one or two people, one person or two people who are right in front of me.\n\nAnd so, like when we come to the Dharma Center and we're trying to cherish people who come in, our love can be held towards all the people in the room. But of course, right now, since we only have one body, we're only able to connect to maybe one person at a time. But actually, the main way that we're helping them is through our mind, through our love, and through our prayers.\n\nAnd we can do that towards everyone in the room, and everyone everywhere, even while physically talking to one person. So sometimes what I'll do is, because I find this happening a lot, and it is a struggle, it's like, I so badly want to meet everyone who comes to the class and talk to them and see how they're doing. There's people who've shared struggles with me, so I want to check in with them.\n\nAnd it's physically impossible, and I run to the door and guard the door, try to block people so I can talk to as many people as possible, especially newer people or people I need to check in with. But it's impossible, right? You can't actually physically talk to everyone, right?\n\nAnd the intention's there, but then what I'll often try to do is hold everyone in my mind and imagine Avalokiteshvara at their crown, blessing everyone. And I can kind of do that in my mind, passively, right? And then talk to someone and just feel everyone's being blessed in the room.\n\nAnd just like we have an awareness of everyone in the room, so why not have an awareness of everyone with Avalokiteshvara at their crown, blessing them while we talk to someone. It's not much more, actually, than just being aware that everyone's in the room. It's just a matter of mindfulness.\n\nSo we can do these little things to expand the scope. And then finally, this experience can be really useful, like this sense of, but I can't be there for everyone or help everyone externally. And we do want to use that to funnel into our bodhicitta.\n\nBecause that does make us want to become a Buddha, so that we can actually be there for everyone. Thanks, Kristen. Marianne, where did the dog go?\n\nSorry, you're cool too, but we want to..."
      },
      {
        "speaker": "Mary Ann",
        "time": "1:02:59",
        "text": "She wanted more supper, so she had to go."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:03:05",
        "text": "Fine, we'll accept."
      },
      {
        "speaker": "Mary Ann",
        "time": "1:03:07",
        "text": "The hamburger. I just wanted to quickly say that I really, really saw the value of Sangha this week so much. Thank you, everyone, so much for getting into that super dark place I was talking about last week regarding the march towards the anniversary of my parents' death, which I haven't had that for a long time, and it was pretty gruesome.\n\nSo I really appreciate you guys. Thank you so much. It's much, much, much, much, much better.\n\nIt's almost like all the way gone. So that was a beautiful thing. I really understand Sangha a lot stronger now.\n\nThank you. And I took your advice about just doing... Anyway, thank you guys so much.\n\nA short tantra succession, and it worked really well. Yeah, and then it just deepened, even though it seemed just rote and just like spouting words, it deepened as I kept doing it quicker. Yeah, so it really worked.\n\nIt was a great week. Thank you guys so much."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:04:16",
        "text": "Thanks so much, Marianne. Yeah, and thank you. Last week, I forgot to thank you for sharing what's going on for you in the wintertime and so on, and it's really nice that you could just trust us, you know, to share that with us, and we got your back, and yeah, you're right.\n\nThat's why we need Sanghas. When our mind goes into those difficult or funny places, we do need our Sangha to hold us up, and they've got our back, and that's just so important to know that our Sangha is there for us if we need. Sometimes we do have to overtly ask.\n\nWe might not be able to assume that they're going to mind read and reach out, but if we do ask, they'll be there for sure. Yeah, and I'm really glad too, Marianne, that the kind of simpler way of approaching it made it groove, right, just doing the succession guru yoga, but with like no rules. Just, yeah, kind of approaching it in that untethered way makes it very free and comfortable.\n\nThe second we kind of put a bunch of rules on some things, because for some people it gets a little bit heavy or just feels like there's these huge stakes, and that kind of takes away the joy, so it's really nice that just kind of untethering it like this made it work a bit more. Yeah, thank you. Okay, let's take a look at the text."
      }
    ],
    "mainTeaching": [
      {
        "speaker": "Kadam Kyle",
        "time": "1:06:30",
        "text": "Thanks, everyone. Lovely data, as always. Now, the big question is, are we at the paragraph that says, if we exert enough, or are we at the one, at this point, a doubt may arise.\n\nYeah, that's what I was hoping. Okay, good, thanks. Thanks, Dale.\n\nAt this point, a doubt may arise with respect to the meditation just described. It's been stated that the purpose of developing equanimity is to prepare us to recognize all beings as our mother. We may therefore wonder, if it is correct for me to regard all beings as my mother, because they've supposedly been my mother in the past, then isn't it likewise correct for me to regard everyone as my enemy for the same reason?\n\nYeah, now I can hate everyone and be miserable. Yum, yum. To recognize the fallacy of this conclusion, we must understand that whenever we have called anyone our enemy, we've done so for basically unsound reasons, and as a result of a mistaken view on our part.\n\nThe habit of blaming our troubles and suffering on others, on the so-called enemy, is a deluded way of thinking, one that fails to recognize that it's our own state of mind, and not any external circumstance that is ultimately responsible for whatever misery we experience. At the root of our decision to regard someone as our enemy is a false projection of our mind, a mistaken conception of events. Forgetting such things as the kindness and parental nurturing this person has given us, and unaware of our own culpability for our suffering, we take the harm we receive from another as a valid justification for calling him or her our enemy, and treating him with hostility.\n\nAlthough this is something we do all the time, it's in fact completely deluded, and ultimately indefensible. Nice. On the other hand, as we'll have explained in the following section, there's nothing false or deluded about regarding all beings as our mother.\n\nThis is true and verifiable, and not only opens the gateway for continued spiritual growth, but provides us with an immediate experience of happiness and well-being. The goal of equanimity meditation is to remove all biased attitudes of mind, and thereby to view all beings without discrimination as our mother. This in turn will motivate us to consider how we can repay their infinite kindness.\n\nIf as a result of this meditation we're able to regard even our most hated enemy as our kind mother, we're ready to gain a realization of the first stage of the seven causes and effects leading to the development of bodhicitta. This is just reminding us about the importance of beneficial believing. Ultimately everything is just empty.\n\nBut things have a relative degree of validity. This is what we call conventional truth. Relative degree of validity.\n\nAnd to figure out what to do or not to do in an empty world, we mostly figure it out based on the effect it has on our mind. So when something has a positive effect, like a liberating effect, we do those things. If it has a negative effect, like it's increasing our delusions and ignorance and so on, then we avoid those things.\n\nSo sometimes we might move into relativism, which leads to nihilism. But Buddhism is not relativist, nihilist, in a sort of philosophical sense. Relativism is sort of like, we're all right.\n\nWe're all right, we just have different points of view. This can come though, which naturally leads into nihilism very quickly. Because then there's no sort of values that we live by.\n\nAnd then as we abandon our values, we just become sort of, we just stop caring, basically. And then we start living within the law of cause and effect. And mostly we just end up becoming depressed or hedonistic.\n\nThese are the effects of nihilism we can see in the world. And it is an effect of relativist thinking, overly relativist thinking. So the reason that Buddhism is not like a relativist is because we would say there's correct ways of thinking and there's wrong ways of thinking.\n\nThere's just correct ways of thinking and there's wrong ways of thinking. And it has to do with the effect of the action, the function of a way of thinking. So even though everything is empty, and our conventional truths that we use to navigate through an empty world are falsities, there are useful ones and not so useful ones.\n\nSo this is one of the genius qualities of Buddha, and then especially of Naikajuna and Jaishankapa. They taught this idea, the doctrine of the two truths. Some people would reify conventional truths and abandon emptiness, which the effect isn't that bad.\n\nYou become really nice and you do lots of good things. It's just a bit uptight. But at least you're moral, which is good.\n\nThat's nice. It's just you lose a vision for liberation, enlightenment, and so on. But at least you have karma and moral discipline.\n\nBut it's missing something, right? It's missing the emptiness part. Other people disregard karma and the conventional truths and loving others.\n\nAnd those people, absolutely, out to lunch. They're gone. They're goners.\n\nBecause they don't live within moral discipline. So generally speaking, they just go to hell, which is terrible. And they don't love people, they don't do good.\n\nSo Jaishankapa, in his exposition on the two truths, which is something that is so close to Venerable Geshe-la, this is one of the reasons he's trying to protect this tradition and do everything he can to keep Jaishankapa's tradition alive. He clarified, in the Middle Way, that it allows people to hold both of these two, which is very difficult to do properly. So anyway, we don't need to get into this right now.\n\nBut I'm just trying to share this simple heuristic, right? It's the simple way of approaching any Dharma teaching. We just say, like, how is this useful for me?\n\nHow is this leading to less delusions and more happiness? And if it is, we can say, okay, this is useful for me. I want to go towards this.\n\nThis is correct. This is right, you could say, right? Okay, if something is leading to more delusions and more suffering, okay, that's wrong, that's incorrect.\n\nI want to move away from that. We're not doing it in a grasping way, but we're understanding we have to have some guideposts to navigate samsara. We're stuck in complete ignorance.\n\nHow can we navigate that? The answer is definitely not abandoning all of our thoughts and conceptions. That just makes us a mindless jellyfish, a barnacle.\n\nAnd we're just stuck, going nowhere. And then we become nihilist. Okay, so anyway, I'm just trying to help us remember these kind of points.\n\nThen, a little bit more, and then we'll get into mothers. Actually, maybe we'll do mothers after the break. So, with working meditations, like equanimity, we have to often play around with the verbiage we use.\n\nAdriana and I were talking about this a little bit before the class, and so it's a bit related too. The creativity that we want to bring in our practice is about getting us to the meditation object. And that meditation object sometimes can feel a bit elusive.\n\nAnd so, if something isn't working, we need to figure out how can I mind this meditation to make it work for me, so I can get the benefits of it. And often it's just about playing around with it a little bit, like trying different, even like mental phrasing. Like we all know being at a class or something, and a teacher says something that you've heard a million times, but just in a slightly different way.\n\nAnd sometimes it's just that slightly different way that makes it click for us. Part of it is coming from that teacher's practice, and they're kind of mining the meditation themselves, and maybe got a blessing. But part of that is a teaching for us too.\n\nLike we respond to language. You know, we're stimulated by language and words. And so, yeah, we have lots of different words and bits of language that are in the text that we can probe and use.\n\nBut then we can also just explore on our own to make these meditations work for us. This is one of the benefits of teaching a Dharma class, of course, because if you're like, I'm coming up dry with this meditation, you're like, well, I've got to make it work somehow, so I have something to transmit here. And then you start digging into it, right, and tinkering with it.\n\nSo, yeah, there's all sorts of ways, like with equanimity, to do this. And it will start blading into mothers a little bit. But like, I don't know, one thing that I've done is just thinking towards whenever I see people, yes!\n\nLike that, in my mind. And it's so funny, like, just walk down the street, and everyone you go, inwardly, yes! You know, it's like seeing your best friend.\n\nImagine your best friend, and you're out in the middle of nowhere, and you're having a bad day, and all of a sudden, they turn the corner, and you weren't expecting them. It would just be like, yeah! Woo!\n\nSo sometimes I'll just think that first, and all of a sudden, I feel equanimity. I just feel warm, close, and friendly towards a person. And there's something about that, just even like that verbiage, that tricks my mind into going, ooh, I like them!"
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:19:46",
        "text": "I think I was just doing that, walking around Brooklyn, before the class, and it was just very fun. And I gave this gigantic smile to one lady, who got real freaked out. And I thought, okay, I've got to control the outward manifestation of it.\n\nIt was like, yeah! Woo! This is interesting, just that simple phrasing.\n\nSo that's not in the book, right? But it's just a way to get to the object. And it's just like playing around with it, to move the heart.\n\nSo that's just an example of trying to bring in some kind of our own wisdom and creativity, us and our guru, working on these meditations together. Another example would be, with equanimity, is just seeing that everyone we see is either a huge success story, or a horrible fall from grace. And I'm definitely moved by both of those.\n\nIf I see someone who's fallen from grace, or if I see some celebrity who's fallen and become nothing, and despised or something, for me that just really moves my heart, because I know how they're just utterly pained. I've met people who've fallen from grace, and the shame they feel, and it's usually because they did something wrong, right? They just feel so shamed, and they don't want to go anywhere, and they don't want to meet new people, and they feel like they have to hide something inside them.\n\nSo to have this deep care for them, but then also people who are success stories, who came from nothing, and had a horrible situation, and they've risen out of it. And so when we start thinking about people's past lives, we can see that everyone we meet, at some point they were like a Chakravartin king, like a ruler of the whole universe. They were like the peak, they were Indra, they were Brahma, they were even very spiritual people.\n\nThey were tranquil abiding, everyone has had it at some point, just not on virtuous object. So it's like everyone we meet, we can just think, wow, they had everything, and they've fallen down to this form, and the pain of that, and the disappointment of that. But then we can also think the other way around.\n\nLike, I don't know, they were like a little shelter animal, that got killed, you know, like in some kill shelter. I don't know what they did, they gassed them or something, right? Wow, they were just like a little rejected street dog, right?\n\nLike, life wasn't looking up for them, and they got gassed, you know, in the pound or whatever. And like, maybe someone said a prayer for them. Maybe there's like a Buddhist there, right?\n\nWho said some mantras before this happened, or whatever. Or just by some karmic luck, they've come out as a human. It's like, wow, what a success story.\n\nLike, that dog that was wandering in the streets, with like nothing, in this terrifying pound, like, wow, look at them now, they're like, they're a human with all this potential. So anyway, it's just like, again, that's not explicitly in the text, right? But you can infer all these points from thinking about these things.\n\nAnd we can see, wow, everyone I meet is this like incredible success story. Or everyone I meet has had this like horrible fall from grace. And like, wow, we're all just actually so equal.\n\nYeah, we're all playing different parts now, that are a bit uneven, but there's actually a quality that's present in everyone. Lastly, there's just a way to kind of deal with dislike of others. That's explained in Joyful Path, and maybe we won't go through all of it, but I guess it says here on page 493, eliminating all the obstacles to developing affectionate love.\n\nThe main obstacle to developing affectionate love is the feeling of dislike towards others, of course. So dislike is again on that spectrum of aversion. We cannot have affectionate love towards all mother beings while we continue to feel glad to meet some and irritated or annoyed at meeting others.\n\nTherefore, whenever we become aware of feelings of dislike, we should meditate. And there's these three ways. And we've already kind of looked at these today.\n\nMaybe I'll just summarize them. But this is a great way to mine the equanimity meditation. If you're having a hard time shifting someone, especially out of the dislike category, you can pretty much apply it to any of the other ones.\n\nThe three ways are, one, through paying inappropriate attention, I put them in this category. So that's related to David's data point earlier, that we kind of create the categories and then get mad at people for being in them. So we're thinking, how did I, through paying attention in a certain way, get them into this category?\n\nAnd what we do is we kind of reverse the tape. Okay, I noticed this, and I noticed that, and then I thought this, and then I thought that, and then I started like this, and then like that, and then I did that one thing, and then I closed the book on them. So we're just seeing, ah, it was from paying inappropriate attention that it was created.\n\nSecond, and we've looked at this too, is other people view them differently. So am I really right? No, I can't be truly right, because then everyone would experience them in the same way.\n\nSo we know that, but it's just about using it. And then the third point is basically thinking, the dislike I have for them is just non-virtuous and painful, so it's completely pointless. So I might as well choose a more useful way to look at them.\n\nAnd we can read more in Joyful Path if we'd like, the actual talisized words, which are quite beautiful. This is like a great GP class to teach. It's fantastic.\n\nThere's three reasons how to stop disliking people. What a useful skill. And they're a little bit progressive, like they kind of build, but they're also like three different angles in, and they all kind of work in the mind in different ways.\n\nOne is like, I sort of created this issue, so it's actually my choice that they've ended up in this way, to some degree. And then they're not inherently bad, and it's more useful to view them other ways. So there's like three different ways in, but they all kind of build to one conclusion of letting go of the dislike.\n\nSo the point there is just, whenever we have these meditations, it's really important, we want to say to ourselves, I want to find the blessing of this meditation. I want to chew on it to such a degree that I get a blessing. I want to find out why this is in the lineage.\n\nAfter these thousands of years, this meditation, like why it's highlighted in the Lam Rim, for example. I want to get the blessing that Atisha got, that made him include that in the Lam Rim. I want to get that blessing, that realization of this.\n\nAnd that involves like, sometimes just going to text, and kind of getting the right technique, that's going to move our mind. Sometimes it's about the verbiage. And then sometimes it's about us and our guru, like trying things out, and just seeing what sticks, and moves the mind.\n\nAnd sometimes it's just like, trying stuff out and seeing, okay, does my mind move now? No. Okay, let me try this.\n\nDoes it move now? No. Okay, what's going to get it to move?\n\nAnd then we ask our guru, help me out here, let's find something. And then we'll get a blessing, and get away. Okay, so we'll get into mothers, in the next session, which is very exciting.\n\nOkay, so we'll dedicate in a moment, just a heads up. We have our... Oh, next Saturday, we have a half-day course with David, on developing love and gratitude towards others, as a way to get us into our heart.\n\nSo, fantastic. And then, the end of January, there's a little course on how to help people where they're at, how to benefit people where they're at. So how to use some creativity in our acts of benefiting others.\n\nAnd then February 7th, we have our one time a year, all day, silent retreat. So, that's on how to take ourselves less seriously. Basically how to relieve the pressure in our mind.\n\nWhich is great, that's all we have to do. Get the pressure out, and then we can relax. So, some really nice stuff coming up fast.\n\nOkay, thanks everyone. Let's just dedicate here, and we'll come back at 6.07. We can think through the virtues we've collected through practicing, meditating, discussing. May all living beings find lasting peace of mind, enlightenment.\n\nWe can make any personal prayers or dedications. Okay, thank you. Thanks everyone.\n\nThank you."
      }
    ]
  },
  "session2": {
    "chantedPrayers": {
      "time": "2:06:15",
      "text": "O Blessed One, Shakyamuni Buddha,\nPrecious treasury of compassion,\nBestower of supreme inner peace,\nYou, who love all beings without exception,\nAre the source of happiness and goodness;\nAnd you guide us to the liberating path.\n\nYour body is a wishfulfilling jewel,\nYour speech is supreme, purifying nectar,\nAnd your mind is refuge for all living beings.\n\nWith folded hands I turn to you,\nSupreme unchanging friend,\nI request from the depths of my heart:\n\nPlease give me the light of your wisdom\nTo dispel the darkness of my mind\nAnd to heal my mental continuum.\n\nPlease nourish me with your goodness,\nThat I in turn may nourish all beings\nWith an unceasing banquet of delight.\n\nThrough your compassionate intention,\nYour blessings and virtuous deeds,\nAnd my strong wish to rely upon you,\nMay all suffering quickly cease\nAnd all happiness and joy be fulfilled;\nAnd may holy Dharma flourish for evermore."
    },
    "teaching": [
      {
        "speaker": "Kadam Kyle",
        "time": "2:08:43",
        "text": "Yeah, it's actually a nice teaching. You know, it's like, when I first started to teach at the meditation centers, because I'd run just so hot, I'd always try to make sure the room felt comfortable for me, and people would be sitting there, you know, shaking in the corner, and, you know, you had to learn, like, okay, I need the room to feel considerably too hot for me, for it to be okay for the average person, right? And, similar to something that a friend of mine, who's a chef, taught me, and he said, because I was saying, like, oh, when I cook up at the temple, you know, a meal each week, and people were telling me, oh, it's too this, it's too that, flavors are too strong, giving you nice feedback, regularly.\n\nIt's easy to get offended. Oh, stop criticizing. He said to me, he said, you know, you have to, like, flavor it with your biases, right?\n\nAnd also, as you sit above the food, your senses get really warped, because you're, like, immersed in garlic, and onions, and spice, and all this, just breathing it in, so actually your taste buds are, like, way dampened. So I like really strong flavors, a lot of heat, a lot of garlic, a lot of salt, a lot of acid, you know, all those things, like, really strong flavors already, and then I'd sit, breathing these things in, right? So then, like, your mind is going, this tastes perfect, right?\n\nAnd you serve it to people, and they can't handle it. It's just too intense, right? Too intense food, right?\n\nAnd so it was really helpful to think, okay, like, when I cook this food, I have to make it, it actually has to taste bland to me. If it doesn't taste bland to me, it's too strong. It's a very hard thing to, like, teach your mind to do, like, right?\n\nBecause we want to go, well, it tastes good to me. So what's wrong with that, right? And that helped me a lot.\n\nSo I know the point is, it's like with these meditations that we're doing, like, mining a meditation, like equanimity or mothers, we have to remember, like, we're doing these meditations with our own biases, right? And we're bringing our own delusions and our own traumas and our own limitations and our own frustrations and our own strengths and weaknesses to the meditations. And so sometimes if you're trying to make a meditation work, it's helpful to ask, like, what are my kind of, like, spiritual biases that might be getting in the way?\n\nOr just, like, my views about the world or whatever that could be getting in the way. And sometimes if we kind of investigate this, we can make a meditation work again. Like, I've shared this before, but that was, like, one of my biggest breakthroughs with the Guru Yoga meditation, Reliance on the Spiritual Guide.\n\nI just saw I had this incredible anti-authoritarian bias, you know, that just wants to burn it all down, you know, and throw a Molotov cocktail, you know, through the government building, you know, that's just so deep in my bones. And just since I was a child, you know, it's just, like, so philosophically and psychologically in there, which is just some karma, right, to just have that, you know, almost anarchic, you know, quality against power or whatever, right? So it was a huge breakthrough, and I was meditating on it originally and finding a hard time.\n\nAnd then going, ah, I have this, like, bias. I hate every authority in my life. I always blame every authority.\n\nEvery authority is doing it wrong. I've never met an authority I like. Oh, I'm the problem.\n\nIt's my delusion, right? It's my bias. It's my own, like, issue that I'm projecting.\n\nNow I'm the guru, Buddha who's trying to help me, right? Oh, okay, right? And then it actually started to shift.\n\nLike, I needed to kind of counterbalance for the bias in the meditation. So anyway, that's just what the heat's reminding me of. I was wondering.\n\nI was feeling so comfy in here. And then I saw poor, sad people with their blankets on and the hats on. Oops.\n\nApologies. But anyway, we can bring this into meditation. That's the point.\n\nWe can, like, know our own biases and how we're, like, counterbalancing the meditations and often kind of shift the other direction almost in an extreme way to, like, deal with our own biases we're bringing. Okay. Anyway, enough of that.\n\nLet's look at the text. Mothers. Yeah, this is the first lamrim meditation that blew my mind into smithereens.\n\nSo I feel very attracted to it from that point of view. Yeah. I just...\n\nAnyway, I was in college at the time, and it just completely blew my mind. So anyway, I'm very happy for us to do this now. Recognizing that all living beings are mothers.\n\nOnce we've developed an unbiased outlook towards all beings, we are ready to view them all equally as having been our mother. This is the firm foundation upon which the supremely altruistic mind of bodhichitta depends. But how is it possible to recognize all beings as our mother?\n\nWhat are the reasons for believing we have shared the intimate mother-child relationship with everyone? So as we know, this is an incredibly intimate relationship. This is going to be talked about a little bit in a few pages about the kindness of living beings, but I'm just saying it now because we're all TTP students.\n\nSo if we want our spiritual life to move forward, we need to at least get the view that our own mother, this life, is supremely kind. Even if we have issues, we need to solve those issues. Because it's actually ultimately our ignorance that has the issues.\n\nWhen people come to a GP class, yes, we say nice things like, it's okay, and yeah, your mother is really hard. But no, we need to put it down now. It's time to put it down.\n\nOur mother could have had an abortion. So then we would be dead and probably go to the lower realms because it's not a good time. So our mother could have had an abortion.\n\nShe didn't. She held us in her body for nine months and dealt with the absolute complication of that. And so, yeah, mothers aren't perfect, but the helplessness of a baby, a baby is useless.\n\nA baby just will die without the mother. Not just keeping them for nine months, but for a long time after that, they'll just die. Utter helplessness.\n\nSo yeah, even if mom was difficult, critical, mean, whatever, we didn't die. We could have. We could have been left.\n\nWe could have been thrown away. Whatever. We didn't die.\n\nSo we have to kind of heal this kind of judgmental mind and solve it for ourself. So I'm just sharing this so that we know, yes, we're very kind and gentle with our GP students and try to say to them, it's okay, choose someone else. Okay, it doesn't have to be your mother.\n\nBut we, as TTP students, need to solve this. It's like an archetypal relationship in our mind. And it's someone who held us in their body for nine months.\n\nIt's like servitude. The mothers of this life know. It's a serious commitment and sacrifice to make.\n\nSo if we don't kind of solve our own mother issue, it's going to be actually very difficult to love all living beings properly. There's something that we're still holding back. And there's something that we're not getting right.\n\nSo I'm just trying to make this clear for us all. I think we understand it to some degree, but I just wanted to make it obvious. To answer these questions, consider the following line of reasoning.\n\nThe woman we presently recognize as a mother is such by virtue of our having been born onto the world from her womb. Yet this is not the first and only time we've taken birth. The continuity of our consciousness stretches back over infinite time.\n\nAnd the births we've taken have been countless. As we've been born countless times, it follows that we've had countless mothers. Thus, there's not a single being we meet who over the incalculable expanse of beginningless time has failed to be our mother.\n\nDespite the altered form and appearance of those we encounter and the failings of our extremely limited memory, once we become convinced of the logic of the above line of reasoning, there will be nothing to prevent us from viewing each being with the same warm recognition. We're working on it. The same warm recognition we effortlessly extend to our present mother.\n\nIt's interesting, it's assumed that we've already solved this problem. If we haven't, let's get a move on. What follows is an explanation of the continuity of consciousness.\n\nIt's very skillful of Geshe-la approaching it in this way. This presentation is unique to this text. It's just contained in this book.\n\nIt's only in here. It's really nice to learn some of these points and understand them and think about them a little bit so that we can become completely confident in the continuity of consciousness. And so that we can teach people in a very matter-of-fact way.\n\nLike, yeah, we've all had countless lives. Therefore, everyone's had countless mothers. Who are the mothers of those lives?\n\nThey're all the people around today. Yeah, of course. It's interesting, sometimes we're nervous about saying these things.\n\nBut what's interesting to me is that there are other things that we're not nervous about saying to people that are even controversial. But we just say them as they're facts because we feel comfortable with them. We can even be a bit of a Cassandra about some things.\n\nThis is happening, and this is the truth, and you've got to watch out, and you've got to do this. And we'll even prosthetize about certain things that feel really important to us if they feel like a certain degree of importance. Like when the pandemic started, maybe we felt very clear about the danger and the very big importance of masks or vaccines or whatever your thing is.\n\nI'm not saying anything about it, but maybe we felt that way, like really clear. People are just telling everyone they know, hey, you need to wear a mask, or you need to get this vaccine, or you need to have this social distancing. Or other people are saying, you don't need to wear a mask, you're an idiot, you don't need a vaccine, whatever.\n\nAnd it's very interesting for me, because everyone became like a Cassandra, like giving this prophetic wisdom to the world as if they completely knew what was true. And all of a sudden, everyone felt comfortable telling everyone what they thought was true, even though no one really knew. No one actually knew.\n\nWe sprayed bleach on food at the temple for like two months, leaving it outside. It's very strange. But you've got to do it.\n\nDon't eat that food if you didn't spray it with bleach. So anyway, it's very interesting. We're actually very willing to tell people what we think about something, if we're confident about it.\n\nEven if it makes no sense, right? So it's interesting, if we're not comfortable to tell people about past and future lives, it's just a sign we're not confident in our understanding. If we were completely and utterly confident, we would just say it like it's a fact.\n\nLike we say, the earth's round. Well, Buddhists would disagree, but anyway. The earth's round.\n\nThis food is good for you. Oh, sugar is bad for you. You should exercise some more.\n\nYou need to hydrate. There's all these things that we say as if they're facts in life. We feel just so comfortable just saying them.\n\nSo the point is, if we're not comfortable with saying, oh yeah, there's countless past lives. Of course. Then it's like, ah, that just means we don't agree totally.\n\nWhich is no problem. That's why we're doing this investigation. To me personally, I do want to find a place where I feel like I want to tell everyone about the Dharma teachings so comfortably.\n\nThat I want to shout them from the rooftop. I want to get to a place with every single teaching that I could do that so comfortably. Because if these things are true, then we want people to know.\n\nWe don't want people to suffer. We want them to know. We want to inform them.\n\nThat's why people around the pandemic and so on, they felt so emotional about these things. Because they felt like this is going to save someone's life. Which is a very good intention, to want to save someone's life.\n\nLike, oh, you're going to die if I don't tell you this. So of course they wanted to say that to people. But if you think about Dharma, if people don't free themselves of their delusions, what's going to happen to them?\n\nIt's horrible. It doesn't mean go around proselytizing. But it means there should be an impulse in us that wants to do that.\n\nThat actually thinks, this is so important, I want to tell everyone. I want to shout it from the rooftops. Okay, I'm not going to do it because it's not skillful.\n\nBut I want to, because it's so important. It's like if there was an even worse disease running around, like some kind of horrible Ebola kind of disease going around. And there was a simple cure.\n\nWe would shout it from the rooftops. We would scream it to everyone. We would post it on Facebook to everyone.\n\nOkay, well, that's only helping people in this life. Dharma is helping people in countless future lives. And it's giving them freedom from suffering.\n\nIt's not just keeping them alive. So anyway, there should be a feeling in our heart that wants to just share that with everyone. And if it's not there, it just means, okay, I have some work to do on my faith, my understanding of the truth of Dharma.\n\nSo then, let's see what we can work on for this class. This question says here, page 36. Although the argument presented above is internally consistent, it is obvious that it will be completely lacking in persuasiveness if we do not come to understand it at least tentatively, tentatively, except the existence of past and future lives.\n\nAs long as we reject this possibility, as long as we cling to the belief that our birth and death of this lifetime mark the outermost boundaries of our existence, it will be utterly impossible for us to recognize all beings as our mother, except metaphorically. Many other important Dharma topics, such as the workings of cause and effect, also depend for their full understanding on a consideration of past and future lives. Therefore, although the topic may present particular difficulties to some people, especially Westerners, it's very important that we try to keep an open mind and examine the issue with as few preconceptions as possible.\n\nThe crux of the matter is our understanding the nature of the mind, for it is through realizing that our mind is a formless continuum and that this continuum is beginningless that we'll be able to understand the existence of previous lives. One way to meditate on this is as follows. We can look at our present stream of thoughts, perceptions, and emotions, all the factors we identify as being mental, and trace it backward in time to the mind stream at the previous moment, minute, and hour.\n\nThen we can trace this mind stream even further backwards to yesterday, last week, and last year. Depending on the sharpness of our memory, we can trace this mind stream back year by year until we approach the time of our birth. Even if we can trace it back to our stay in the womb or the moment of conception, we can never point to a time and say, at this instant my mind came into being.\n\nYeah, I think that's true. In fact, some people who do this backwards tracing meditation are able to go beyond the moment of conception and remember the mind stream existing at the end of a previous lifetime. However, as this experience is not shared by many people and is the object of many others' doubt, we cannot fairly use it as a proof that mind is a beginningless continuum.\n\nRather, it is much more beneficial for us to gain a closer acquaintance with our mind and question our own assumptions as to its nature and origin. Yeah, so when someone maintains tranquil abiding, they do this. They can just go through, they trace their mind all the way back to being in this life, moment of conception, and then they go to the previous life, and they can just go back as far as they'd like, and then they remember all these past things.\n\nTo aid in this investigation, here are a few useful questions and observations to keep in mind. When we search for the source of our present body, we eventually come to the combined sperm and ovum of our parents. Can this also be the source of our mind stream?\n\nIf we answer yes, many difficulties arise. How do we account for the marked differences between our mind and those of our parents and siblings? If our mind is traceable to our parents' germ cells, what's the relation between these cells and our parents' minds?\n\nIs the mind something that can eventually be reduced to a physical cause? Or, being essentially formless, must it not have a non-physical cause of its own quite apart from the source of our physical body? Some people assert that the mind is a relatively blank slate at birth, with but a few prenatal impressions on it.\n\nThey say what we call mind is merely the learned behavior we acquire as we grow and develop. Is such a theory satisfactory? Does it take into account differences in temperament between people?\n\nDifferences that have been noted even in newborn infants of the same family? Does it account for the complexity of mental behavior found in ordinary children, much less the unusual skills and aptitudes of exceptionally gifted youngsters? These are all things we can ponder.\n\nIf we truly want to understand the nature of the mind and discover whether or not it is a beginningless continuum, we must consider these questions carefully. It is a fact that most people, even the educated, and those whose professions deal directly with mental phenomena, possess nothing more than a vague idea of what the mind is. If our own views are similarly indefinite, if we do not have a coherent theory to explain the relationship between material form and non-material mind, then it is not wise to reject out of hand a theory based on logic, observation, experience, and the testimony of enlightened beings.\n\nAgreed. At the very least, we should remain open-minded and look at the issue impartially. This is pretty clear.\n\nPeople who are quote-unquote professionals relating to understanding the mind, whether they are neuroscientists or maybe biologists or psychologists or whatever, if you ask people, what is mind, precisely? What is consciousness, precisely? Most people just don't have a good answer.\n\nYou can ask people, but most people don't have a good answer. Especially people who are very trained in any of these fields usually are humble enough because of their understanding to admit they don't have a good answer. Because they are stuck doing an impossible task if they believe in materialism or physicalism.\n\nPhysicalism, materialism, in the philosophical sense, is just that only physical things exist. If you believe that, then you can never understand mind. Because you are trying to understand something that is non-physical while saying the only things that exist are physical.\n\nIt's impossible, then. You are stuck forever, running in circles. So a lot of people are just completely confused about this.\n\nObviously setting that up, that structure, is absurd, right? Because it's like, some people will say, well, the mind, like consciousness, a formless consciousness can't exist because then it wouldn't be physical. Why is that?\n\nBecause nothing that's not physical could exist. It's like a circular argument. They've set up the parameters.\n\nGranted that only physical things exist, and that thing is not physical, but then it can't be existent. It's absurd, actually. It doesn't make any sense.\n\nPhysicalism is a terrible, terrible thing. It's an anti-spiritual view, and it's completely pervasive. Everywhere.\n\nPeople are taught it, people are shared with it. They're shared this kind of view, even as a child, taught in schools, or by the parents, or through culture, that only matter is what exists. This is like a wrong view.\n\nThis is directly obstructing people's liberation. It's actually a terrible thing to teach someone. Teaching someone something that obstructs liberation, and indoctrinating them into that, is a horrible thing to do.\n\nMaybe some of us have been indoctrinated into that, or maybe we're still weaning ourselves off of those views. That only the physical exists. Only things that you can experience with senses could exist.\n\nSo there's all sorts of philosophical problems, which we can get into as we explore these pages. It's interesting. Buddha, and all of Indian society, completely refuted these points, 2,000 years ago plus, in a philosophical school called Charvaka, which is dismantled in Osho Nectar, and also a little bit here.\n\nThe people in the Indian subcontinent were completely inoculated against this view of materialism. They were laughed out of the marketplace of ideas. People were like, that's the most absurd thing anyone's ever said.\n\nPeople had this understanding in their mental DNA, to never entertain that confusion. But unfortunately it's taken a lot of hold in the West, and has spread back to those places that were previously free, and protected against it. So there are these philosophical issues with it, which of course we can get into.\n\nThere's also moral issues that we can see, that often just result in hedonism, or selfishness, or just believing that this is all that matters, this is all there is. And for me, the reason that I went with trying to go with Buddha, is just that I saw people that espouse these things, and they're miserable. Deeply miserable people.\n\nAnd that was really helpful. Not just always miserable, but not as happy and peaceful, as I would want to be, personally. I remember one of these thinkers, like some big shot intelligentsia in the world, who's a physicalist, he said something like, small children and animals are not conscious yet, so there's no moral, there's nothing morally wrong with letting them go.\n\nBecause they're not conscious yet, there's no consciousness in them yet. And I thought, what a miserable worldview. What a sad, painful worldview.\n\nI'm not criticizing a person, I'm just saying that's not a human worldview, a humane worldview. That's not a worldview that leads to moral life. That's actually a very lost state of mind, and this is a very well-regarded person in the intelligentsia.\n\nVery influential kind of figure. And this is a view, he's just espousing casually. It was very interesting.\n\nHe's like, oh, I don't want to follow that. So if someone's not deeply peaceful, they obviously don't understand their mind. Because if they could understand their mind, the first thing they'd do on the docket would make themselves incredibly peaceful.\n\nBecause that's all we want. So if you could actually work with your mind, if you really knew what the mind is and how to control it, day one, you'd go, press the button for infinite happiness. I'm going to immediately press that.\n\nI'll get into other things after this, but I'm just going to do this day one. I'm going to destroy my vices, my bad habits, and I'd grow all my virtues. Day one.\n\nBoop. Of course you would do that. If someone can't do that, it's like, ah, you don't really know your mind.\n\nThat means you definitely don't know the mind in general. You don't even know your own mind. That's the most important one to know.\n\nThat's how you actually know other people's minds, and the mind in general, is knowing your own. So we need to find people who are deeply peaceful, moral, loving, kind, respectful, compassionate, energetic, and benefiting others. Understand the nature of reality.\n\nThings like this. Those are the people we want to follow. And basically all those people say, the mind is formless.\n\nThat's the view of the people who we want to be like. That was helpful for me. I'm just looking around the world, looking at who I want to be like, and this is the view, the conclusion of the people that I personally want to be like.\n\nThese are just some ramblings. Sorry. According to Buddhist thought, our stream of consciousness was present while we were a fetus.\n\nGoing even further back to the moment of conception, this mind stream entered the embryonic cell formed by the union of our father's sperm and mother's ova. Prior to this entry, the consciousness, or mental continuum, was the consciousness of a previous lifetime. Furthermore, the consciousness of that life arose from the one before that, and so on back into infinity.\n\nEven Buddha Shakyamuni's omniscient mind saw no beginning to this process. Therefore, if the continuity of mind is beginningless, we must have taken countless rebirths, and therefore must have had countless mothers. Consequently, there is not a single sentient being who has not at one time or another been our mother.\n\nIf this is so, why do we not intuitively recognize other beings as having been our mother? Why? The reason is that the traumatic experiences of death and rebirth generally rob us of our memories of past lives.\n\nIn addition, the way beings change form from one life to the next makes it difficult for us to recognize them. For example, if our present mother were to die and be reborn a dog, we would be completely unable to recognize her, even if she eventually became our pet. This is probably what happens a lot of the time.\n\nThey just come back as our pet. Thus, despite appearances, we are presently surrounded by countless beings who have each been our mother. Yes, that makes sense.\n\nWe can't even remember being in the womb. That doesn't deny being in the womb. We're like, yeah, I was cramped in there.\n\nA little crowded, and wow, my mother drank hot tea. That was painful. I was jumping on a trampoline.\n\nThat was scary. We have no memories of that. That doesn't make it not true.\n\nMost of us couldn't even remember the ten benefits of bodhicitta. Literally one week later, after being deeply requested to do so, because it's crucial for our liberation. I'm not sure we want to put our eggs in the basket of memory being the proof that we use.\n\nJust logically, right? There's no connection between something existing and remembering it. Because you can remember false things.\n\nIt doesn't make it more real if you can remember it. That would make things that we forgot less real. So intuitively, we don't notice right away.\n\nBut we do have other intuitive feelings, like a feeling of connection sometimes. Have you had experience of this? You meet someone and you're like, we're going to be best friends.\n\nIt's like meeting an old friend. I definitely have had many of these. They're beautiful feelings.\n\nIt's just a sign. There's this link there. It's like a way to infer a link between us and that person.\n\nWe might not be going, oh, you're my mother. But there's a sense of, I know you. I know you.\n\nI know for me, when I first went to the temple, I was trying to practice Buddhism by myself in college and really struggling with that. I wasn't going anywhere too far. When I went there, I felt like I had gone home for the first time in my whole life.\n\nNot my childhood home, but a real home. That was with my family. I remember asking them, can I help?\n\nCan I chop vegetables? Can I clean dishes? Because that's what you do with your family.\n\nIt was a very odd feeling, because I never felt that way in my whole life. I was just living so selfishly, so myopically, not caring really about others. There's a sense of meeting people who I'm connected to.\n\nThat's the point. It's like remembering them. There's a sense of, these are people I know, somehow, intuitively.\n\nIt's just an anecdotal strategy, but it does help the meditation, when we have these kinds of insights. I feel comfortable with this person. We're going to be good friends.\n\nI don't even know why, but we just are. There's a karmic link here. We'll look at some practical things in a second.\n\nJust one more paragraph. It is important to remember that not all beings lack the ability to recall their previous existence. As a fruit of their meditative practices, in which the gross obscurations of the mind are progressively removed, many yogis gain the ability to see their past lives.\n\nEven some ordinary people, especially young children, have memories of their past lives, owing to especially clear imprints on their mind. The fact that most of us, however, do not have such memories is not so surprising. After all, even the obscurations of this lifetime and the general fogginess of our mind are enough to prevent us from remembering events from our early childhood to infancy and stay in the womb.\n\nThe main thing for now is to just look at some practical bits here. What we want to do is really, really try to move this forward in an experiential way. Not an intellectual way, but an experiential way.\n\nWhat's the experience of having countless past lives? And moving into countless future lives? What's the psychological experience of that awareness?\n\nTo really feel it in the depths of our bones. In the way that we have this sense of, today is one day of countless days of this life, until we die. There's this sense of, we feel it in our bones, to the point where we won't just blow up our life today.\n\nBecause we know tomorrow we're going to have to deal with the blown up life. Some people aren't able to reason like this, but we can reason like this, because we're aware. There's this sense of it's like an incontrovertible truth.\n\nThis is one day of many days of my life. What's the feeling of having that with respect to countless past lives and going into countless future lives? What I want us to really play around with is we can do some things on mothers, but before we jump right into mothers, it'd be nice to work on for the week just this sense, really trying to deepen this spiritual experience of this sense.\n\nSo in Joyful Path of Good Fortune, Geshe uses the phrase I'm a traveler bound for future lives. That's a really nice sense to start to envision it. How can we work on this traveler mindset throughout the day, throughout the week ahead?\n\nWhat does it really feel like to be a traveler bound for future lives? I encourage us all to really bring out some of that creativity we were talking about. You agree intellectually, but there's not this kind of lived, deep, blessed insight into this to work it a little bit.\n\nUse your ingenuity and your reasoning and discussing with your guru about how can I really take this off the page and make it a bit more 3D for me. So it's a real felt experience. So this is one way, just continually trying to be mindful of this phrase.\n\nI'm a traveler bound for future lives. I'm a traveler bound for future lives. It's a great role play as a traveler bound for future lives for the next week.\n\nIt's a little bit like being E.T. Good old E.T. He's very cute and scary. Anyway, a little balance. He's like a traveler coming to this world and we know he's going to leave.\n\nHe's just passing through this world. He's not from here and he's going elsewhere. Like a little alien fellow.\n\nIt's true of all of us. We're just like a traveler. We're just passing through this world.\n\nIt's not our home. So we can feel a little bit like an alien, like a visitor. Which is true, actually.\n\nAnother thing we can do is to just really try to consider our future lives and the things that we do. As we know, one of the experiences of Lam Rim is becoming a special small being. Which means that all of our actions are directed towards the happiness of our future lives.\n\nNot for this life at all. That means you've graduated from the initial scope of the Lam Rim. It's a high realization in some ways.\n\nThere's something about just training our mind to be concerned for the future lives throughout the day that starts to deepen the belief itself. And then the lived experience. For example, whenever we do something, we can think I'm Kyle, so I think, Dear Future Kyle, or in my next life, Future Cockroach, or whatever you are, here's this action for you.\n\nThat's what we're doing. We're paying forward everything we do to our future experience. Like in this life, and also future lives.\n\nIt's like when we eat a donut or something. We're like, Dear Future Me, have fun with this donut. Hope it doesn't get lodged in there somewhere for the next six years.\n\nBut sometimes we make a deal, right? Like letting future us down. Even in this life, when we do something, we pass the buck to them.\n\nSo it's nice just to think with every action, like okay, I'm meditating. We can just think beforehand, Dear Future Me, here's this cause of inner peace. I'm giving this to you.\n\nThen we distract ourselves for a bunch of hours. Before we do it, we think, Dear Future Me, I'm just going to give this habit of distraction to you. Good luck on dealing with it and exercising it from your mind.\n\nHere you go. But the point is, it's a mindfulness practice, right? It's continually attuning to future lives.\n\nIt involves doing it and not feeling it, so that we can do it and feel it. Even when we meditate, we can play around with this. Okay, I'm going to meditate with zero care for this life.\n\nCan I even imagine what that mindset is like? Can I put my mind in that place? I'm meditating with literally zero care for how it affects this life.\n\nWe're just imagining what that feels like and trying to make that groove in our mind. Then, maybe the last thing for now, with respect to our self, just trying to really connect to the truth that whatever we're experiencing is coming from past versions of us. It's nice just to keep that mindfully.\n\nAgain, it's just attuning ourselves to the sense of being a traveler. Like, okay, I'm inheriting something from the past or a past person. We can move away from naive, genetic explanations to more karmic explanations, which are much more robust.\n\nWhatever our naive explanations are. We just start to say, ah, this is like karma created from a past person. I think we all get the point.\n\nLet's just try to keep working on the experience of being a traveler bound for future lives. Let's keep working on that and attuning to the sense that there's these countless future lives coming and we're just passing through. We're just here for a blip.\n\nOur mind is ancient, infinite. Is this going to continue on? We want to start caring for that future self.\n\nWe want to be a steward of this mental continuum for the future. That's it for now. We can have a little time for discussion.\n\nLet's have Adriana and Anne. Let's have David and Dale and Anne P. and Sumit.\n\nThank you."
      }
    ],
    "conclusion": [
      {
        "speaker": "Kadam Kyle",
        "time": "3:16:45",
        "text": "All right, everyone. Thank you."
      },
      {
        "speaker": "Dale",
        "time": "3:16:47",
        "text": "Thank you. All right."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "3:17:03",
        "text": "Thank you."
      },
      {
        "speaker": "Sumit",
        "time": "3:17:25",
        "text": "All right."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "3:17:30",
        "text": "Okay, so what do we want to get up to over the next week, please? Besides things and stuff. Adriana, yeah?"
      },
      {
        "speaker": "Adriana",
        "time": "3:17:49",
        "text": "So I have been thinking about in this class some, like, little game or something along the lines of what Geshe Ben made with, like, the black and white stones. But I have, like, a bunch of meat tokens that I got for Rui, like little steaks, as part of his, like, stocking stuffer."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "3:18:11",
        "text": "Yes, very exciting."
      },
      {
        "speaker": "Adriana",
        "time": "3:18:12",
        "text": "Yeah, yeah, yeah."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "3:18:13",
        "text": "Now we're heating up. Okay."
      },
      {
        "speaker": "Adriana",
        "time": "3:18:15",
        "text": "And then a bunch of these little heart tokens. And I've just been playing around with, like, thinking about a game. So it's like, okay, any time I do something virtuous for a future life, I'll, like, put a little heart in the basket.\n\nAnd if I get carried away with worldly concerns with just my meat body, I'll put a steak in, and then I'll count them at the end of the day. That's my idea."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "3:18:36",
        "text": "Yeah, I like that. It's, like, a little bit not as focused on just, like, the quality of the thought itself, but specifically the aim, the intention behind the thought. Like, is it about future lives or not?\n\nIt would be an interesting thing to, like, keep an eye on that and just to kind of note, yeah, note what's going on throughout the day. That's great. Dale, yes.\n\nThank you. And for $9.99, you can buy Adriana's steak tokens that she has. She brought in a little trench coat that she'll sell to anyone who wants.\n\nYes."
      },
      {
        "speaker": "Dale",
        "time": "3:19:15",
        "text": "I love that we're a traveler bound for future lives, and I think keeping that close to your heart when you're doing your meditation or jewel, whatever it is, it just kind of expands. It just kind of opens the world."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "3:19:32",
        "text": "Yeah. Yeah, I love that. Yeah, I agree.\n\nIt's, like, especially because it's really just exactly a kind of guessless phrase. It's in the death chapter of Joyful Path of Good Fortune, and it's just a beautiful kind of blessed phrase to play around with. I'm like a traveler.\n\nWhat does it feel like to be a traveler passing through? Sumit, yes, please."
      },
      {
        "speaker": "Sumit",
        "time": "3:19:57",
        "text": "I think for my own personal, everyone's got their own way of things or karma, I guess we say, right? And I think for me it's usually, like, I usually don't get that anxious. I usually have a problem with not caring.\n\nThat's my own personal thing. And so when it's, like, oh, like, I guess I was, like, listening to this and being, like, yeah, this is all true, and having a certain struggle of being, like, oh, this is going to make me feel even more like this doesn't matter. But I had a great conversation with Anne, and we were, like, talking about this a little bit, and it was, like, kind of, like, having that idea towards, oh, we're just, like, as Dale was just saying, we're just a traveler.\n\nLet's be chill about this with respect to the effects I'm experiencing, but still being very, like, mindful and, like, driven and, like, not really bring that towards the causes because the causes I'm creating, if we talk a thing about karma, the causes I'm creating, they really matter, right? And that would kind of help me. So having that division of, like, applying this towards effects and not to causes.\n\nYeah."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "3:21:01",
        "text": "Yeah, it makes total sense, exactly. There's a really positive and actually relaxing effect of that, but it also makes us feel the importance and weight of what we do, but specifically the virtuous actions that we do. We have the sense of every action I perform is, like, setting off this huge chain of events.\n\nThere's, like, a huge kind of butterfly effect, you know, every action I perform. It's, like, kind of cascading into many different chain reactions far into the future. And it gives us this sense of, like, what I do actually really matters.\n\nEvery moment really matters. Not in an anxiety, freak out kind of way, because when you're paying it forward like that, there's something very beautiful about it. Like, for me, it feels it's important because of what it will lead to, but because it's, like, paying it forward to those future lives, there's something a little bit more selfless about it for me, personally.\n\nIt's a little bit like, I don't know, let's say there's a really wealthy parent or something, right? And they have a bunch of kids, and the kids have kids, and they're like, I'm going to create a fund to support the family into the future. And I'm going to, like, I'm still going to work, and I'm still going to collect my money, and I'm still going to use it wisely, but I'm, like, making this, you know, like a trust fund, right, that's going to protect the family and their kids and their kids' kids, like, far into the future.\n\nAnd it's like, there's something about, because it's not theirs, it's actually more relaxing. Like, they're not going to reap the benefits, just like we're not going to reap the benefits of future lives. It's going to be a different kind of version of us.\n\nBut it's still important. There's a sense of, like, what I'm doing is important. I'm, like, setting something into motion.\n\nAnyway, it's just sort of rambling now. But anyway, I'm glad, to me, that that sense of, like, it's important what I'm doing came out from that sense of being a traveler. Yeah.\n\nAnything else, you know, on Lion Folk? Anything you'd like to declare or swear? Byron, is that a hotel room?\n\nOh, yeah. Hotel vibes. It's a hotel.\n\nI was wondering, Jose, if you're in a hotel, too. I am. There's a chic that comes through in both places.\n\nI don't even know how to put words to it. My house definitely is not this clean. Oh, that's how we could have known.\n\nYeah, yeah. Okay. Well, I'm glad the hotel bros are here.\n\nThat's very sweet. Oh, sorry, David. You had a hand there?\n\nYeah. And we'll wrap up."
      },
      {
        "speaker": "David",
        "time": "3:24:06",
        "text": "I liked what you said about mining the meditations and thinking how can I find the blessing of this meditation and bringing creativity to it, maybe even sort of outside the text itself, but thinking what are the implications of this or how can I bring my own wisdom to it."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "3:24:23",
        "text": "Yeah, yeah, exactly. It's a really, really important kind of thing to do. It's just like playing around even just with verbiage, just words, like just saying it to ourself in a different way.\n\nSometimes we'll hack something by just phrasing it a little bit differently, and then we'll start to feel moved and blessed. Okay. Okay, I'll just guide us in a little dedication.\n\nThanks, everyone. We can think through the virtues we've collected through practicing, meditating, discussing, may all living beings find lasting peace of mind, enlightenment."
      },
      {
        "speaker": "Sumit",
        "time": "3:25:19",
        "text": "We can make any personal prayers."
      },
      {
        "speaker": "Student",
        "time": "3:25:44",
        "text": "Okay, thank you. Thanks, everyone. Thanks."
      }
    ]
  }
}