[
  {
    "id": "nov02",
    "date": "Nov 2",
    "year": "2025",
    "topic": "Six-Session Foundations",
    "practice": {
      "title": "Set Up Your Six-Session Practice",
      "steps": [
        "Identify your six times — based on your schedule (9-to-5, meal-oriented, every 3 hours, or variable by theme)",
        "Match sessions to pain points — the tough parts of your day (commute, afternoon slump, loneliness at night)",
        "Make a list of people most angry at you and practice being okay with that",
        "Pick one benefit of bodhicitta from MTB to contemplate, to 'tether us to the book'",
        "Plan for disruptions — anticipate schedule changes (vacations, family time) and create alternative anchors",
        "Give your sessions names — it makes them more fun and personal"
      ],
      "quote": "The six sessions are like pillars that hold up the palace of our mindfulness in the day."
    },
    "commentary": [
      {
        "title": "Break the 'One Daily Practice' Myth",
        "content": [
          "There's a wrong conception that meditation is about doing one formal practice and then riding that through the day. That's a made-up concept — nothing to do with Kadampa Buddhism.",
          "As Geshe-la says in Modern Buddhism, Kadampa Buddhism cannot be separated from daily life. We want our whole day to be a sadhana.",
          "The meditation break is more important than the meditation session, because it's longer. The six sessions support a meditation break practice that continues all day."
        ],
        "quote": "We have to break out of the concept of the one daily practice behemoth that we do, check off a box, and then go live our life."
      },
      {
        "title": "Pillars of Mindfulness",
        "content": [
          "It's difficult to have perfect mindfulness all day. So the six sessions become pillars that hold up the palace of our mindfulness.",
          "They're like outposts where we connect to a powerful, positive, virtuous feeling — even if just for 30 seconds or a minute. That feeling then slowly leaks out into the time in between.",
          "If you do this for a month in a way you really like — not rigid or rote — these cognitive structures will just be there. They'll start to function on their own, like an engine that runs itself."
        ],
        "quote": "These six sessions are like pillars that hold up the palace of our mindfulness in the day."
      },
      {
        "title": "Schedule Options",
        "content": [
          "The 9-to-5 version: Wake up, beginning of workday, beginning of afternoon, getting home, bedtime — plus one more.",
          "The meal-oriented version: Wake up, breakfast, lunch, dinner, bedtime, plus a seated practice somewhere.",
          "The every-3-hours version: Great for retirees or unstructured days. Those hours become sacred — you know exactly what you do at 12, at 3, at 6.",
          "The variable version: For those whose days are all different. Batch by themes — match sessions to pain points like commutes or difficult transitions."
        ]
      },
      {
        "title": "Six Mini-Days",
        "content": [
          "Think of each session as a mini-day. Ask: what do I need for my practice in this little three-hour day?",
          "For example, if you get irritable in the afternoon, what practices will oppose that? Maybe wishing love, or guarding speech, or something to make you lighter and less intense.",
          "The end of day is totally different — it's about reflecting on how the day went and getting ready for the yoga of sleep."
        ],
        "quote": "We actually start to see that each day we live many different days. There are lots of different energies in one day."
      },
      {
        "title": "The Middle Sessions Are Most Important",
        "content": [
          "For people with typical working lives, the mid-morning and mid-afternoon sessions are the most important of the whole day.",
          "You can start off strong, but if you don't get those middle two, you just slowly descend all day. Then at the end, you try to pick up from where you got to.",
          "It's a cool feeling to break through the habit of letting everything fall away and get tired and grumpy. This practice can snap us out of that."
        ],
        "quote": "Those middle sessions are like the bridge. They're the most important ones of the whole day."
      },
      {
        "title": "Breaking the Stillness Myth",
        "content": [
          "We'll break down the correlation between meditation and stillness, eyes closed, being physically still. Meditation is a mental action.",
          "The goal is to be in the mandala 24/7 — walking, talking, running, whatever. Our mind is in the Pure Land all the time.",
          "Study the Mahasiddhas — these great yogis were all working people, running around, doing tons of stuff. They are the exemplary practitioners of tantra."
        ],
        "quote": "If our private seated practice feels uniquely more holy than taking out the trash, we've actually created a delusion."
      },
      {
        "title": "The Repeater Analogy",
        "content": [
          "When sending a telecommunications signal across the country, you don't send one huge powerful signal and let it degrade. You send an average one and have it repeated, reinvigorated along the way.",
          "Our six sessions are like repeaters. They maintain where we're at spiritually throughout the day.",
          "One teacher said doing just bodhicitta for one minute, six times a day, was the deepest meditation he'd done in a decade — because he was really bringing it into daily life."
        ],
        "quote": "The successions become like repeaters that maintain where we're at."
      },
      {
        "title": "Give Them Names",
        "content": [
          "You can give your sessions names — it makes them more fun. Sun time, song time, wish time, tea time, wind time, moon time.",
          "One student named hers after aspects of Dorje Shugden: morning is the mongoose (spitting out jewels with coffee), danger zone midday is the dragon warrior guarding speech, subway home as a snow lion.",
          "Now you're like: 'Ooh, I'm in this part of the day. I love this one.'"
        ]
      }
    ],
    "mtb": {
      "title": "Foreword; The Pre-eminent Qualities of the Author",
      "content": [
        "The excellent expounder, the great Spiritual Master Kelsang Gyatso, studied myriad Buddhist scriptures at the famous Je College of the great monastic university of Sera, Tegchen Ling, practised the meaning of the teachings he received, and became a wise, serious and realized Teacher. From the rain of profound and extensive Dharma that he has bestowed upon his fortunate disciples, he has recently given comprehensive instruction on the great Bodhisattvacharyavatara (Guide to the Bodhisattva's Way of Life). This commentary has now been made available in English with the title Meaningful to Behold, known in Tibetan as 'tong pa don den'.",
        "This text is the heart essence of all the Sugatas of the three times and is the unsurpassed practice of the great Sons of the Conquerors. It explains clearly the mind of bodhichitta developed through equalizing and exchanging self with others -- the foundation of the Bodhisattva's way of life. It also explains the benefits of this Mahayana mind, the way we should guard this mind, and how we should practise the great waves of the six perfections once bodhichitta has been cultivated. As a great gathering of the paths of the Mahayana tradition, it is therefore worthy to receive many flowers of praise bestowed with appreciation.",
        "I pray and dedicate that all sentient beings may practise sincerely the meaning of the instructions explained in this text and may thereby accomplish effortlessly the purposes of both themselves and others. May they all swiftly reach the enlightened state of the four bodies [of a Buddha] by accomplishing all the stages of the spiritual grounds and paths.",
        "Vajradhara Trijang Rinpoche",
        "Acknowledgements",
        "The teachings contained in this book were originally delivered as a series of lectures to students at Manjushri Kadampa Meditation Centre in England, by Venerable Geshe Kelsang Gyatso Rinpoche. For more than three months, beginning in late 1977, Venerable Geshe Kelsang gave a verse by verse oral commentary to Shantideva's eighth-century masterpiece, Guide to the Bodhisattva's Way of Life, one of the most famous and important texts studied in Mahayana Buddhism.",
        "From the depths of our hearts, we thank the author for his inconceivable kindness in composing this book. Throughout the presentation and revision of these teachings, Venerable Geshe Kelsang has demonstrated by his compassion, wisdom and inexhaustible patience that the Bodhisattva path to enlightenment is still being followed 1,200 years after Shantideva and 2,500 years after the passing away of Buddha Shakyamuni. There can be no greater proof of the immense value of the Bodhisattva's way of life than the living example of such a realized Master.",
        "We also thank all the dedicated, senior Dharma students who assisted the author with the rendering of the English and who prepared the final manuscript for publication.",
        "Please note that numbers in squared brackets throughout the text refer to verse numbers in Shantideva's root text, Guide to the Bodhisattva's Way of Life, a full translation of which is available separately. See Bibliography.",
        "Roy Tyson,",
        "Administrative Director",
        "Manjushri Kadampa Meditation Centre,",
        "November 1993.",
        "Buddha Shakyamuni",
        "Introduction",
        "This present text is a commentary to Shantideva's Guide to the Bodhisattva's Way of Life (Skt. Bodhisattvacharyavatara) and is divided into three parts:",
        "1\tThe pre-eminent qualities of the author",
        "2\tAn introduction to the text",
        "3\tThe explanation of the actual text",
        "THE PRE-EMINENT QUALITIES OF THE AUTHOR",
        "It is customary at the beginning of commentaries such as this to give a biography of the author, in this case the great Indian Pandit Shantideva (687-763 CE). There now follows a very brief account drawn from traditional sources.",
        "Shantideva was born the crown prince of a royal family in Gujarat, a kingdom in western India. His father was King Kushalavarmana (Armour of Virtue) and his mother was recognized as an emanation of the Tantric Deity Vajrayogini. At his birth the prince received the name Shantivarmana (Armour of Peace).",
        "Even as a very young boy Shantivarmana showed great ability in spiritual matters and by the age of seven was already highly skilled in the inner science of religion. His principal Teacher at that time was a Yogi who had so fully developed penetrating wisdom that it is said he achieved unity with Manjushri, the Buddha embodying the wisdom of all enlightened beings. When Shantivarmana himself engaged in a meditation retreat, he too received a direct vision of Manjushri and many prophetic omens as well.",
        "Shortly afterwards King Kushalavarmana died, leaving Shantivarmana to inherit the throne. The night before his intended coronation, however, Manjushri appeared to him in a dream. He told the prince that he should renounce his kingdom and become a celibate monk. Immediately upon waking, Shantivarmana fled the palace and disappeared into the forest to meditate. Once again he received a vision of Manjushri, who handed him a symbolic wooden sword. Upon taking it Shantivarmana attained eight perfect realizations. He then travelled to the great monastic university of Nalanda where he took ordination from the Abbot Jayadeva (God of Victory) and was given the ordination name of Shantideva (God of Peace).",
        "At Nalanda Shantideva's spiritual development progressed rapidly, especially as the result of his training in the profound and demanding methods of Tantra. However, because he did all his practices secretly at night and rested during the day, it appeared to others that he performed only three activities: eating, sleeping and defecating. For this reason, the other monks sarcastically referred to him as the 'Three Realizations'. Feeling he was a very irresponsible monk and a discredit to their illustrious university, they devised a plan to get rid of him. Incorrectly believing him to be deficient in meditational ability and ignorant of doctrinal theory, they arranged for Shantideva to deliver a discourse before the entire monastery. Their idea was that he would be so humiliated by this exposure of his ignorance that he would be shamed into leaving.",
        "When the day of the scheduled public humiliation arrived, Shantideva mounted the teaching throne and, much to the amazement of those assembled, delivered a discourse which, when written down, became known as Guide to the Bodhisattva's Way of Life, still considered the best set of instructions ever written for becoming a Bodhisattva -- a being bound for full enlightenment. As he was expounding the ninth chapter dealing with the wisdom apprehending the true nature of reality he uttered the words, 'Everything is like space.' At this point he began to rise into the sky, flying higher and higher until he could no longer be seen although his voice could still be clearly heard. It was in this miraculous manner that the remainder of the ninth chapter and the entirety of the tenth were delivered.",
        "Having no desire to return to Nalanda, Shantideva left for South India. Needless to say, the monks he left behind were profoundly impressed and somewhat bewildered by Shantideva's teachings and his display of miracle powers. Shortly thereafter a dispute arose about these teachings. The Kashmiri Pandits claimed that Shantideva taught only nine chapters, while some of the scholars from Magadha, who possessed great powers of memorization, argued that he had in fact taught ten. It was decided that the only way to resolve this disagreement would be to hear the teachings once again, so several monks left Nalanda in search of the one they had once despised and requested him to repeat his discourse. This he did, and he also gave them the text of his Compendium of Trainings (Skt. Shikshasamuchchaya), which also explains the practices of a Bodhisattva. From that time onwards the study and practice of Shantideva's works flourished widely throughout India and other Mahayana Buddhist lands.",
        "As Shantideva's fame spread farther and farther, many non-Buddhists became jealous. One of their greatest teachers, Shankadeva, challenged Shantideva to a debate on the condition that the loser forsake his own doctrine for that of the winner. By the use of miracle powers and impeccable logic, Shantideva emerged victorious, thereby bringing Shankadeva and all of his disciples into the Buddhist fold.",
        "On another occasion, when there was great famine in South India, Shantideva announced that he would perform an act of generosity. The next day many people gathered to see what he would do. Shantideva then proceeded to satisfy the hunger of the entire mass of people with a single bowl of rice! Because of this the local people all developed great faith in Shantideva and adopted the Buddhist way of life as their own.",
        "This has been only a brief biography of the great Bodhisattva Shantideva, who throughout his entire life performed countless deeds for the sake of spreading Buddha's teachings, the Dharma, and helping sentient beings. Even today those who are fortunate enough to read, study and meditate on his outstanding texts can find them a source of great insight and benefit.",
        "AN INTRODUCTION TO THE TEXT"
      ]
    },
    "shantideva": {
      "title": "Not covered this class",
      "content": "This introductory class focused on Six-Session practice rather than Shantideva verses."
    },
    "preview": {
      "title": "An Introduction to the Text",
      "content": [
        "How is Shantideva's Guide put together and what does it contain? It is composed of ten chapters and we should try very hard to understand the meaning contained in each one of them. Otherwise we are like the foolish person who was sent to a shop by members of his household to see what was sold there. When he returned home they asked him what was available, and he had to reply, 'I don't know; I have forgotten.' His journey to the shop was a complete waste of time. Similarly, if upon completion of this text we are unable to recall what is contained within each of its chapters, we should be ashamed of ourself. If our study of this text is to be worthwhile and not a complete waste of time, we should not only read the words but also try hard to learn their meaning.",
        "There now follows a brief description of the contents of each of the ten chapters of the root text.",
        "Chapter One",
        "The ultimate goal of Buddhist spiritual practice is the attainment of the fully awakened state of mind. This completely perfected state -- variously known as enlightenment, Buddhahood or the highest nirvana -- can be achieved by anyone who removes the gross and subtle obstructions clouding his or her mind and develops positive mental qualities to their fullest potential. However, we will not be able to attain this fully awakened state if we do not first develop bodhichitta, the mind of enlightenment. What is bodhichitta? It is the continual and spontaneous state of mind that constantly strives to attain this perfect enlightenment solely for the benefit of all living beings. As will be explained later in this commentary, bodhichitta is developed by training the mind in either of two ways: practising the sevenfold cause and effect meditation (built around the remembrance of motherly love) or exchanging self with others.",
        "In order to generate this precious bodhichitta we must think deeply about its many benefits. A businessman will put a lot of effort into a particular transaction if he understands beforehand that there is much profit to be gained. In the same way, if we see the many benefits of bodhichitta we will strive continuously to develop it. For this reason the first chapter consists of a detailed explanation of these benefits.",
        "Chapter Two",
        "If we are to develop bodhichitta we must destroy all obstacles hindering its growth as well as accumulate the necessary prerequisites for its cultivation. The main obstacle to developing bodhichitta is evil, defined as that which has the potential power to produce suffering. Because we have a large accumulation of such misery-producing tendencies from the non-virtuous actions we have done in the past, we find it extremely difficult to give birth to the precious and virtuous thought of bodhichitta.",
        "Where poisonous plants grow together in profusion it is virtually impossible for a medicinal seed to sprout. Similarly, the virtuous thought of enlightenment will not arise in a mind choked by the weeds of non-virtue. Therefore, in Chapter Two of his Guide Shantideva explains how to prepare the mind for the cultivation of the supremely altruistic attitude by uprooting and weeding out all that is potentially harmful to its growth. This purification of evil is accomplished by exposing our accumulated non-virtue, and then eradicating it by means of the four opponent powers explained in this chapter.",
        "Chapter Three",
        "However, purifying negativity is not, by itself, sufficient for our purposes. We must also accumulate a great deal of merit, or positive potential energy, and this comes from the practice of virtue. In the same way that it would be unsuitable for a beggar to receive a king in shabby, unkempt surroundings, so too it is impossible for a mind bereft of merit to entertain the precious bodhichitta, the king of all thoughts. Those who wish to invite this honoured guest into their minds must first acquire a great wealth of positive mental energy. After this is done it is then possible to seize and maintain this precious mind of enlightenment. Therefore, in Chapter Three Shantideva explains how to acquire and hold on to bodhichitta.",
        "Chapter Four",
        "Once we have taken hold of the precious bodhichitta, we must prevent it from decreasing. This is done by conscientiously attending to the virtuous actions of our body, speech and mind. This conscientiousness is the subject of Shantideva's fourth chapter.",
        "Chapter Five",
        "Having developed and then stabilized bodhichitta by means of conscientiousness, we must strive to bring this mind to its complete fruition: perfect enlightenment. This is done by taking the Bodhisattva vows and practising the six perfections. Generally the first perfection to be explained is giving. In this text, however, Shantideva discusses giving in his tenth and final chapter together with his dedication. His reason for doing so is that giving, or generosity, is part of the general dedication to all living beings of the good and beautiful things in the universe. Therefore Shantideva begins his discussion with what is generally presented as the second of the perfections -- the practice of moral discipline -- in a chapter entitled 'Guarding the Mind with Alertness'.",
        "Chapters Six to Ten",
        "Each remaining chapter is devoted to one of the perfections. Chapters six to eight discuss patience, effort and concentration while chapter nine is devoted to an extensive explanation of wisdom. As stated before, the tenth chapter deals with giving and the dedication of merit.",
        "The development of bodhichitta takes place in three stages. The ten chapters of Shantideva's book cover this threefold development, which is outlined concisely in the following often-recited dedication prayer:",
        "May the precious, supreme bodhichitta",
        "Grow where it has not yet grown;",
        "Where it has grown may it not decrease",
        "But flourish for evermore.",
        "In the first two lines we pray that those sentient beings, including ourself, who have not yet given birth to bodhichitta may do so. Next we pray that those who have already given birth to this altruistic mind may be able to maintain it without letting it decrease. In the final line, we pray that those who have cultivated and stabilized bodhichitta may be able to bring it to its full completion. In the same order, the method of giving birth to bodhichitta is explained in the first three chapters of this text, the way to stabilize it is the subject of the fourth chapter, while chapters five to ten describe the methods whereby the stabilized bodhichitta may be continually increased until full enlightenment is achieved.",
        "If we practise in accordance with the instructions set forth in the ten chapters of Guide to the Bodhisattva's Way of Life, it will not be too difficult to attain the exalted state of mind known as enlightenment, or full and complete Buddhahood. In this state all our human potential will be fully developed and we will be able to benefit others to the greatest possible extent.",
        "THE EXPLANATION OF THE ACTUAL TEXT",
        "This has four parts:",
        "1\tThe meaning of the title",
        "2\tThe homage of the translators",
        "3\tThe explanation of the meaning of the text",
        "4\tThe meaning of the conclusion",
        "THE MEANING OF THE TITLE",
        "The original Sanskrit title of this text is Bodhisattvacharyavatara, the Tibetan translation of which is Jang chub sem pai cho pa la jug pa. In English this can be rendered as Guide to the Bodhisattva's Way of Life.",
        "It is the custom for all works translated from Sanskrit into Tibetan that the original title be presented first. Why is this necessary? There are two reasons for this practice. First of all, Sanskrit is considered the most sublime of all languages, as well as being the one in which Buddha himself taught. Therefore, having the title in Sanskrit helps plant imprints of this holy language on the mind-streams of those reading the text. Secondly, the title is given in the original language to help us recall the great kindness of those who translated the text from Sanskrit into Tibetan. It is only through the compassion and diligent effort of these translators that the Tibetan people, and subsequently the western world, have had the opportunity to study, meditate on and practise the profound methods contained within this holy scripture.",
        "THE HOMAGE OF THE TRANSLATORS",
        "Before starting their work on this text, the original Tibetan translators paid homage and made prostration to all the Buddhas and Bodhisattvas in order to remove hindrances and ensure completion of their work.",
        "Such homage is in accordance with the tradition laid down by the great Dharma kings of Tibet. This tradition stipulated that the translator's homage should indicate to which set or 'basket' (Skt. pitaka) of Buddha's teachings the original Sanskrit text belongs. Thus if a particular text belongs to the set of Vinaya -- dealing mainly with the training in higher moral discipline -- then the homage should be to the Omniscient One. If it belongs to the Sutra Pitaka -- dealing mainly with the training in higher concentration -- then homage should be paid to the Buddhas and Bodhisattvas. Finally if it is contained within the third set, the Abhidharma Pitaka -- dealing mainly with the training in higher wisdom -- then homage is paid to youthful Manjughosha, the embodiment of enlightened wisdom. Thus, by reading the homage we can easily tell into which of the three scriptural categories a particular text falls. In this case homage is made to the Buddhas and Bodhisattvas; thus it is clear that Guide to the Bodhisattva's Way of Life belongs to the Sutra Pitaka, the set of discourses mainly concerned with meditative concentration.",
        "Manjushri",
        "The Benefits of Bodhichitta",
        "THE EXPLANATION OF THE MEANING OF THE TEXT",
        "The main body of this commentary is divided into two parts:",
        "1\tThe preliminary explanation",
        "2\tThe actual explanation of the stages of the path to enlightenment",
        "THE PRELIMINARY EXPLANATION",
        "This has three parts:",
        "1\tThe expression of worship",
        "2\tThe promise of composition",
        "3\tThe reason for composition",
        "THE EXPRESSION OF WORSHIP",
        "[1ab] The actual text begins with Shantideva's homage, or prostration, to the Buddhas (literally, to the Sugatas: those who have gone to bliss), their Noble Sons and Daughters and all other venerable objects of worship. This prostration is in fact Shantideva's way of paying respect to the Three precious and sublime Jewels of Buddhist refuge: Buddha, Dharma and Sangha. A more detailed explanation of these Three Jewels will be given later in this commentary. For now it is sufficient to state that Buddha is a fully awakened being, Dharma is the spiritual teachings such a being gives others to lead them from suffering and dissatisfaction to temporary and ultimate happiness, while the Sangha is the community of those following these enlightening teachings.",
        "Why is it necessary to go for refuge to these three objects? If a sick person is to get well again, he or she must rely upon a skilful physician, effective medicine, and sympathetic and attentive nurses. In the same way, sentient beings caught up in the vicious circle of cyclic existence (Skt. samsara) are all afflicted by the sickness of their delusions, having found nothing in which they can take true refuge. Only by entrusting themselves to Buddha, the perfect physician, the medicine of Dharma and the Sangha nurses will they ever be cured of their ailments. Therefore if there is to be an end to our dissatisfaction and suffering we must discover and entrust ourself to these Three precious and sublime Jewels."
      ]
    },
    "recording": "https://drive.google.com/file/d/1M1zkSADuLYCYyy7fFpWT2LsK2v4tN5Ev/view?usp=share_link"
  },
  {
    "id": "nov09",
    "date": "Nov 9",
    "year": "2025",
    "topic": "Expecting Difficulties",
    "practice": {
      "title": "Expect Things to Go Wrong",
      "steps": [
        "In one of your early sessions, acknowledge: things are definitely going to go wrong today. Expect it.",
        "Look for ways to accumulate merit throughout the day — this gives you strength to fight delusions",
        "Choose ONE delusion to focus on reducing through studying this text (not all of them at once)",
        "Use the six perfections as a diagnostic: giving, moral discipline, patience, effort, concentration, wisdom — which is deficient right now?",
        "Incorporate offerings practice — remember to offer your food and activities"
      ],
      "quote": "My first week when I came here, the center flooded. We had a hole in the ceiling for three months. It was just fantastic — a smack right in the face, day one."
    },
    "commentary": [
      {
        "title": "Don't Waste Your Time",
        "content": [
          "Geshe-la writes: if upon completion of this text we're unable to recall what's in each chapter, 'we should be ashamed of ourselves.' Guns blazing from the start!",
          "If we don't change by the end of the book, it kind of is a waste of time. TTP is three and a half hours a week, plus study and practice.",
          "We want to get to the end and feel: I'm a changed person. I don't even know the person who started that book."
        ],
        "quote": "Let's not make it a complete waste of time."
      },
      {
        "title": "Choose a Specific Delusion",
        "content": [
          "Don't try to work on 'attachment as a whole' — that's too broad. Choose a specific iteration, like discontentment.",
          "When working with delusions, there are many ways they manifest. Being patient with yourself is different from being patient with others, or with sickness.",
          "Choose an area that's very practical and relevant to what YOU need. Then figure out how to make this book work for that."
        ],
        "quote": "It's quite nice to choose an area or nuance that's very practical and relevant to what we need."
      },
      {
        "title": "Reading Practically",
        "content": [
          "Every book can teach us any dharma object. You could extract meanings on generation stage from How to Solve Our Human Problems if you wanted to.",
          "All dharma is connected — it's all linked in a system. We can get any dharma from any other dharma.",
          "The question is: what are the delusions I want to change? How is studying Meaningful to Behold going to help with those specific delusions?"
        ]
      },
      {
        "title": "The Six Perfections as a Daily Diagnostic",
        "content": [
          "When you're in a bad mood, run through the six perfections like a quick diagnostic — giving, moral discipline, patience, effort, concentration, wisdom.",
          "You'll almost always find one that's highly deficient. It's like a doctor checking blood pressure and heartbeat — quick things that give a broad overview.",
          "Maybe you're letting your mind wander to past and future on autopilot — oh, that's why I'm unhappy! Simple fix.",
          "Or maybe you're too intense — you need to live more lightly, feel yourself like an actor in a dream."
        ],
        "quote": "If I'm in a bad mood and I do a six perfection checklist, I will almost always find one that is highly deficient."
      },
      {
        "title": "Make Six Sessions Come Alive",
        "content": [
          "If your six sessions feel dead and uninspired, try making each one about a different perfection: giving hours, moral discipline hours, patience hours...",
          "Or in each session, think through the next three hours: How will I bring giving? Maybe being generous with time for someone difficult. Moral discipline? Opposing self-cherishing in that boring meeting.",
          "Patience when that one person talks in the meeting and you want to scream — welcome it, thinking: that's my karma from all the times I bored people."
        ]
      },
      {
        "title": "Why Shantideva Starts with Benefits",
        "content": [
          "From faith comes aspiration, from aspiration comes effort. This is Buddhist psychology.",
          "So what else would you do in the first chapter of a book about developing bodhicitta? Talk about its benefits! Anything else would be unwise.",
          "We need effort — joyful effort. To get effort, we need a wish. To get a wish, we need to appreciate the benefits. We need faith."
        ],
        "quote": "It would make no sense to do anything other than start with the benefits, if one understood how psychology works."
      },
      {
        "title": "The Brooklyn Welcome",
        "content": [
          "My first week at KMC Brooklyn, the center flooded. Me and Byron cleaned the basement with a mop that broke within one minute.",
          "Water poured through the ceiling like a waterfall during my classes. The hole didn't get fixed until December — squirrels could come in.",
          "I thought Brooklyn was going to be classy. Day one: this is a dump. And it's just gotten better since. Accepting the dump of Brooklyn."
        ],
        "quote": "It's a great early-day practice: expect things to go wrong."
      }
    ],
    "mtb": {
      "title": "An Introduction to the Text; The Explanation of the Actual Text",
      "content": [
        "How is Shantideva's Guide put together and what does it contain? It is composed of ten chapters and we should try very hard to understand the meaning contained in each one of them. Otherwise we are like the foolish person who was sent to a shop by members of his household to see what was sold there. When he returned home they asked him what was available, and he had to reply, 'I don't know; I have forgotten.' His journey to the shop was a complete waste of time. Similarly, if upon completion of this text we are unable to recall what is contained within each of its chapters, we should be ashamed of ourself. If our study of this text is to be worthwhile and not a complete waste of time, we should not only read the words but also try hard to learn their meaning.",
        "There now follows a brief description of the contents of each of the ten chapters of the root text.",
        "Chapter One",
        "The ultimate goal of Buddhist spiritual practice is the attainment of the fully awakened state of mind. This completely perfected state -- variously known as enlightenment, Buddhahood or the highest nirvana -- can be achieved by anyone who removes the gross and subtle obstructions clouding his or her mind and develops positive mental qualities to their fullest potential. However, we will not be able to attain this fully awakened state if we do not first develop bodhichitta, the mind of enlightenment. What is bodhichitta? It is the continual and spontaneous state of mind that constantly strives to attain this perfect enlightenment solely for the benefit of all living beings. As will be explained later in this commentary, bodhichitta is developed by training the mind in either of two ways: practising the sevenfold cause and effect meditation (built around the remembrance of motherly love) or exchanging self with others.",
        "In order to generate this precious bodhichitta we must think deeply about its many benefits. A businessman will put a lot of effort into a particular transaction if he understands beforehand that there is much profit to be gained. In the same way, if we see the many benefits of bodhichitta we will strive continuously to develop it. For this reason the first chapter consists of a detailed explanation of these benefits.",
        "Chapter Two",
        "If we are to develop bodhichitta we must destroy all obstacles hindering its growth as well as accumulate the necessary prerequisites for its cultivation. The main obstacle to developing bodhichitta is evil, defined as that which has the potential power to produce suffering. Because we have a large accumulation of such misery-producing tendencies from the non-virtuous actions we have done in the past, we find it extremely difficult to give birth to the precious and virtuous thought of bodhichitta.",
        "Where poisonous plants grow together in profusion it is virtually impossible for a medicinal seed to sprout. Similarly, the virtuous thought of enlightenment will not arise in a mind choked by the weeds of non-virtue. Therefore, in Chapter Two of his Guide Shantideva explains how to prepare the mind for the cultivation of the supremely altruistic attitude by uprooting and weeding out all that is potentially harmful to its growth. This purification of evil is accomplished by exposing our accumulated non-virtue, and then eradicating it by means of the four opponent powers explained in this chapter.",
        "Chapter Three",
        "However, purifying negativity is not, by itself, sufficient for our purposes. We must also accumulate a great deal of merit, or positive potential energy, and this comes from the practice of virtue. In the same way that it would be unsuitable for a beggar to receive a king in shabby, unkempt surroundings, so too it is impossible for a mind bereft of merit to entertain the precious bodhichitta, the king of all thoughts. Those who wish to invite this honoured guest into their minds must first acquire a great wealth of positive mental energy. After this is done it is then possible to seize and maintain this precious mind of enlightenment. Therefore, in Chapter Three Shantideva explains how to acquire and hold on to bodhichitta.",
        "Chapter Four",
        "Once we have taken hold of the precious bodhichitta, we must prevent it from decreasing. This is done by conscientiously attending to the virtuous actions of our body, speech and mind. This conscientiousness is the subject of Shantideva's fourth chapter.",
        "Chapter Five",
        "Having developed and then stabilized bodhichitta by means of conscientiousness, we must strive to bring this mind to its complete fruition: perfect enlightenment. This is done by taking the Bodhisattva vows and practising the six perfections. Generally the first perfection to be explained is giving. In this text, however, Shantideva discusses giving in his tenth and final chapter together with his dedication. His reason for doing so is that giving, or generosity, is part of the general dedication to all living beings of the good and beautiful things in the universe. Therefore Shantideva begins his discussion with what is generally presented as the second of the perfections -- the practice of moral discipline -- in a chapter entitled 'Guarding the Mind with Alertness'.",
        "Chapters Six to Ten",
        "Each remaining chapter is devoted to one of the perfections. Chapters six to eight discuss patience, effort and concentration while chapter nine is devoted to an extensive explanation of wisdom. As stated before, the tenth chapter deals with giving and the dedication of merit.",
        "The development of bodhichitta takes place in three stages. The ten chapters of Shantideva's book cover this threefold development, which is outlined concisely in the following often-recited dedication prayer:",
        "May the precious, supreme bodhichitta",
        "Grow where it has not yet grown;",
        "Where it has grown may it not decrease",
        "But flourish for evermore.",
        "In the first two lines we pray that those sentient beings, including ourself, who have not yet given birth to bodhichitta may do so. Next we pray that those who have already given birth to this altruistic mind may be able to maintain it without letting it decrease. In the final line, we pray that those who have cultivated and stabilized bodhichitta may be able to bring it to its full completion. In the same order, the method of giving birth to bodhichitta is explained in the first three chapters of this text, the way to stabilize it is the subject of the fourth chapter, while chapters five to ten describe the methods whereby the stabilized bodhichitta may be continually increased until full enlightenment is achieved.",
        "If we practise in accordance with the instructions set forth in the ten chapters of Guide to the Bodhisattva's Way of Life, it will not be too difficult to attain the exalted state of mind known as enlightenment, or full and complete Buddhahood. In this state all our human potential will be fully developed and we will be able to benefit others to the greatest possible extent.",
        "THE EXPLANATION OF THE ACTUAL TEXT",
        "This has four parts:",
        "1\tThe meaning of the title",
        "2\tThe homage of the translators",
        "3\tThe explanation of the meaning of the text",
        "4\tThe meaning of the conclusion",
        "THE MEANING OF THE TITLE",
        "The original Sanskrit title of this text is Bodhisattvacharyavatara, the Tibetan translation of which is Jang chub sem pai cho pa la jug pa. In English this can be rendered as Guide to the Bodhisattva's Way of Life.",
        "It is the custom for all works translated from Sanskrit into Tibetan that the original title be presented first. Why is this necessary? There are two reasons for this practice. First of all, Sanskrit is considered the most sublime of all languages, as well as being the one in which Buddha himself taught. Therefore, having the title in Sanskrit helps plant imprints of this holy language on the mind-streams of those reading the text. Secondly, the title is given in the original language to help us recall the great kindness of those who translated the text from Sanskrit into Tibetan. It is only through the compassion and diligent effort of these translators that the Tibetan people, and subsequently the western world, have had the opportunity to study, meditate on and practise the profound methods contained within this holy scripture.",
        "THE HOMAGE OF THE TRANSLATORS",
        "Before starting their work on this text, the original Tibetan translators paid homage and made prostration to all the Buddhas and Bodhisattvas in order to remove hindrances and ensure completion of their work.",
        "Such homage is in accordance with the tradition laid down by the great Dharma kings of Tibet. This tradition stipulated that the translator's homage should indicate to which set or 'basket' (Skt. pitaka) of Buddha's teachings the original Sanskrit text belongs. Thus if a particular text belongs to the set of Vinaya -- dealing mainly with the training in higher moral discipline -- then the homage should be to the Omniscient One. If it belongs to the Sutra Pitaka -- dealing mainly with the training in higher concentration -- then homage should be paid to the Buddhas and Bodhisattvas. Finally if it is contained within the third set, the Abhidharma Pitaka -- dealing mainly with the training in higher wisdom -- then homage is paid to youthful Manjughosha, the embodiment of enlightened wisdom. Thus, by reading the homage we can easily tell into which of the three scriptural categories a particular text falls. In this case homage is made to the Buddhas and Bodhisattvas; thus it is clear that Guide to the Bodhisattva's Way of Life belongs to the Sutra Pitaka, the set of discourses mainly concerned with meditative concentration.",
        "Manjushri",
        "The Benefits of Bodhichitta",
        "THE EXPLANATION OF THE MEANING OF THE TEXT",
        "The main body of this commentary is divided into two parts:",
        "1\tThe preliminary explanation",
        "2\tThe actual explanation of the stages of the path to enlightenment",
        "THE PRELIMINARY EXPLANATION",
        "This has three parts:",
        "1\tThe expression of worship",
        "2\tThe promise of composition",
        "3\tThe reason for composition",
        "THE EXPRESSION OF WORSHIP",
        "[1ab] The actual text begins with Shantideva's homage, or prostration, to the Buddhas (literally, to the Sugatas: those who have gone to bliss), their Noble Sons and Daughters and all other venerable objects of worship. This prostration is in fact Shantideva's way of paying respect to the Three precious and sublime Jewels of Buddhist refuge: Buddha, Dharma and Sangha. A more detailed explanation of these Three Jewels will be given later in this commentary. For now it is sufficient to state that Buddha is a fully awakened being, Dharma is the spiritual teachings such a being gives others to lead them from suffering and dissatisfaction to temporary and ultimate happiness, while the Sangha is the community of those following these enlightening teachings.",
        "Why is it necessary to go for refuge to these three objects? If a sick person is to get well again, he or she must rely upon a skilful physician, effective medicine, and sympathetic and attentive nurses. In the same way, sentient beings caught up in the vicious circle of cyclic existence (Skt. samsara) are all afflicted by the sickness of their delusions, having found nothing in which they can take true refuge. Only by entrusting themselves to Buddha, the perfect physician, the medicine of Dharma and the Sangha nurses will they ever be cured of their ailments. Therefore if there is to be an end to our dissatisfaction and suffering we must discover and entrust ourself to these Three precious and sublime Jewels."
      ]
    },
    "shantideva": {
      "title": "Not covered this class",
      "content": "This class covered the MTB introduction and overview of all 10 chapters."
    },
    "preview": {
      "title": "The Promise & Reason for Composition; The Precious Human Life",
      "content": [
        "In the first part of verse one Shantideva himself pays homage to the Three Jewels in order to eliminate the obstacles that might arise while composing this text. He prostrates first to the Sugatas, or Buddhas, who are endowed with the Truth Body (Skt. Dharmakaya) of an enlightened being as well as with all Dharma Jewels. He then pays homage to the Sangha by prostrating to the Bodhisattvas, the Buddhas' Noble Sons and Daughters, and lastly he pays homage to the Abbots and Preceptors and all those worthy of veneration. This concludes his expression of worship.",
        "THE PROMISE OF COMPOSITION",
        "[lcd] Next comes the traditional promise of composition. It was customary for authors to include such a promise at the beginning of their work to serve as a brief introduction to their intended subject matter. It is Shantideva's intention in this text to present a synthesis of all the paths leading to the attainment of highest enlightenment, Buddhahood. This is the meaning of Bodhisattvacharyavatara, for it is only by engaging in the Bodhisattva's way of life -- venturing into the activities of the Sons and Daughters of the Sugatas -- that we can attain this highest goal.",
        "There are two benefits of studying this precious text. The temporary benefit is that we gain an understanding of the entire path to enlightenment, and are thereby enabled to practise it. The ultimate benefit is that by depending upon this text we will attain the fully enlightened state of Buddhahood.",
        "The ultimate benefit depends upon the temporary benefit, the temporary benefit relies upon the meaning of the text, which in turn relies upon the text itself. This dependent relationship is known as the relationship of the text. Thus Shantideva's promise of composition in verse one indicates that his text has been composed in accordance with Buddha's scriptures and contains the four qualities of meaning, temporary benefit, ultimate benefit and relationship.",
        "THE REASON FOR COMPOSITION",
        "[2] Next Shantideva explains what his reasons are for composing this text. He admits that it will not contain anything that has not been explained before. Also, since he has no skill in the art of rhetoric or poetry, he has no intention of benefiting others who have already understood the teachings of Buddha. Rather, he wrote this text so that his own virtue would increase, his own understanding of the scriptures would not decline and his own mind would become better acquainted with the meaning of the scriptures.",
        "[3] He goes on to say that through the power of his faith, composition and wisdom he will explain the meaning of all the scriptures and thus his own realizations will increase for some time. He hopes that if others, equal in good fortune to himself, were to behold this text, it would prove meaningful for them as well.",
        "This concludes the preliminary explanation. With verse four Shantideva begins his presentation of the actual path to be followed by those wishing to enter the Bodhisattva's way of life.",
        "THE ACTUAL EXPLANATION OF THE STAGES OF THE PATH TO ENLIGHTENMENT",
        "This has two main parts:",
        "1\tThe exhortation to grasp the significance of this precious human life",
        "2\tThe method for making this precious human life meaningful",
        "THE EXHORTATION TO GRASP THE SIGNIFICANCE OF THIS PRECIOUS HUMAN LIFE",
        "[4] Shantideva begins by reminding us that we now have a most rare and precious possession, a fully endowed human life. In contrast to the overwhelming majority of beings in the universe, including most of our fellow humans, we have the opportunity to do something truly meaningful with our lives. We are free of certain restrictions and in possession of certain abilities and beneficial circumstances that make it possible for us to attain goals far beyond the reach of most beings. But if we do not make use of our present existence in the most worthwhile manner possible, it will be extremely difficult to gain such a beneficially endowed human life again. To appreciate these points more fully we must acquaint ourself with the following detailed analysis.",
        "First of all, why is our present state of existence considered to be so rare and so difficult to attain? The reason is that we were not born human by chance. Every effect has a cause, and our present existence as human beings -- and as specially endowed human beings -- is the result of a number of specific and hard-to-create causes. In general, birth as a human depends upon having previously practised pure moral discipline and giving. Specifically, each aspect of a fully endowed human life (as described below) has its own appropriate cause. Furthermore, in order to have attained this life we must have generated pure thoughts, or prayers, to receive a bodily vehicle with which we would have the leisure and ability to improve our mind through the continued practice of Dharma, or spiritual teachings. To be effective, such prayers have to be unpolluted by attachment to temporal comforts and happiness. As it is rare that we create even one of these necessary causes, it follows that the fruit resulting from a combination of them all must be extremely rare to find.",
        "Our present situation can be understood in terms of the following analogy. If a person comes across a nugget of gold but does not recognize its rarity and worth, he may easily throw it away. At this moment we have attained a precious human life far more valuable than gold, but if we do not recognize its worth we are apt to squander it in meaningless and purposeless pursuits. Thus it is very important, first of all, to recognize the eight freedoms and ten endowments of this rare and precious opportunity.",
        "The eight freedoms, or leisures, are in reference to being free from eight states of bondage -- four encountered even when born as a human being. The four freedoms from the bondage of non-human states of existence are:",
        "(1)\tFreedom from being born as a hell being",
        "(2)\tFreedom from being born as a hungry spirit",
        "(3)\tFreedom from being born as an animal",
        "(4)\tFreedom from being born as an ordinary god",
        "The four freedoms from obstacles found within human existence are:",
        "(5)\tFreedom from being born and remaining in a country where there is no religion",
        "(6)\tFreedom from being born and remaining in a country where there is no Buddhadharma",
        "(7)\tFreedom from being born and remaining with mental or physical disabilities",
        "(8)\tFreedom from holding wrong views denying Dharma, such as disbelief in the karmic law of cause and effect, the continuity of consciousness, and so forth",
        "These eight states are called the 'eight freedoms' because they are free from obstacles that oppose or completely prevent our practice of Dharma.",
        "The ten endowments are of two types: the five personal and the five circumstantial endowments. The five personal endowments are:",
        "(1)\tBeing born human",
        "(2)\tBeing born and remaining in a country where Dharma is flourishing -- a so-called 'central land'",
        "(3)\tBeing born and remaining with complete powers, free from mental and physical disabilities",
        "(4)\tNot having committed any of the five actions of immediate retribution. These are killing one's mother, killing one's father, killing an Arhat, shedding the blood of a Buddha with harmful intention, and causing division within a spiritual community",
        "(5)\tHaving faith in the three sets of Buddha's teachings (Skt. tripitaka) and the Buddhist teachings as a whole",
        "The five circumstantial endowments are:",
        "(6)\tTaking human rebirth in a world where Buddha has appeared",
        "(7)\tTaking human rebirth in a world where Buddha has taught Dharma",
        "(8)\tTaking human rebirth in a world where pure Dharma is still being taught",
        "(9)\tTaking human rebirth in a world where there are people practising pure Dharma",
        "(10)\tTaking human rebirth in a world where there are benefactors and sponsors for Dharma practitioners",
        "These ten states are called 'endowments' because they complete the conditions conducive to the practice of Dharma.",
        "It is because of our accumulated virtuous actions that we have now attained this precious human life endowed with the eighteen above characteristics. Therefore, now is the time to rejoice at our extraordinary good fortune. What is the purpose of this precious human life and why is it so valuable to us? The purpose and value of such an existence lie in the opportunity it affords us to accomplish one of three outstanding aims. The greatest goal now available to us is the attainment of enlightenment, the complete and perfect awakening of a Buddha. The intermediate goal is the attainment of personal liberation from samsara, the vicious cycle of birth and death fraught with suffering and dissatisfaction; while the smallest goal is to win rebirth as a god or as a human being.",
        "In general we remain completely unaware of the value of our present situation. In particular we are blind to the precious opportunity we now have to attain one of these three goals. Instead we waste our time and squander this precious opportunity by running after the temporary pleasures of this life. If we were to recognize fully the value and potential of this precious human life we would certainly take advantage of it by studying Dharma and seeking one of the three goals. As Shantideva says, 'If no meaning is derived from this precious rebirth now, how can we ever hope to come across it again in the future?'",
        "There is a story that illustrates the importance of taking full advantage of our precious human life. In a remote village in Tibet there lived a man who had no legs. One day as he was making his slow, laboured way across the countryside with the aid of crutches he accidentally fell over the edge of a cliff. As luck would have it he landed on the back of a wild horse grazing below. The horse was so startled that it galloped off with the man holding on for dear life. Quite a long time passed and, to the wonderment of the other villagers, the man showed no signs of tiring of his unusual mount. 'Why don't you get off that horse?' they shouted to him as he raced by. 'Not on your life!' he shouted back to them. 'This is the first time in my life I've ever been on horseback. When can a legless man like me ever hope for such an opportunity again? I'm going to take full advantage of it while I can.' And off he went, clutching on to the back of the wild horse. Just as the man in this story took advantage of his unusual luck, so should we take full advantage of our present fully endowed human life by training our mind in the practice of Dharma.",
        "THE METHOD FOR MAKING THIS PRECIOUS HUMAN LIFE MEANINGFUL",
        "This has two parts:",
        "1\tContemplating the benefits of bodhichitta",
        "2\tHow to practise the six perfections once bodhichitta has been developed",
        "CONTEMPLATING THE BENEFITS OF BODHICHITTA",
        "This section has four parts:",
        "1\tAn explanation of the benefits of bodhichitta",
        "2\tRecognizing bodhichitta",
        "3\tThe reasons for the benefits of bodhichitta",
        "4\tPraise to the one who gives birth to bodhichitta"
      ]
    },
    "recording": "https://drive.google.com/file/d/1goPpvis392K-jRAmX3lE-V2qcdRJx6gv/view?usp=sharing"
  },
  {
    "id": "nov16",
    "date": "Nov 16",
    "year": "2025",
    "topic": "Merit & Faith",
    "practice": {
      "title": "Be a Merit Hog",
      "steps": [
        "Imagine all the people you'll help when you're enlightened — bring this into your Six-Session practice",
        "Be a 'merit hog' like Shantideva — do everything for spiritual growth and accumulating merit. No limit on how much merit you're allowed to create!",
        "Observe your faith in karma — notice when you're happy or sad about not seeing results. Remember: karma is planting seeds, not instant results",
        "Repeal expectations before meditation: 'I'm in samsara. I have delusions. My butt is getting kicked. Oh, I'm just normal. Cool.'",
        "Don't turn anger on yourself when you get deluded — be patient with your samsaric mind"
      ],
      "quote": "If that's good enough for Shantideva, it's good enough for me. I need to be like a merit hog for a couple weeks."
    },
    "commentary": [
      {
        "title": "Repeal Expectations Before You Begin",
        "content": [
          "Before any meditation, remember: I'm in samsara, bound by chains of karma, in the pitch black darkness of ignorance, getting chucked down the rivers of birth, aging, sickness and death.",
          "My mind is enmeshed in delusions. Sometimes it's going to be an absolute train wreck mess. That's not a problem if we don't expect it to be otherwise.",
          "If we expect our samsaric minds to be perfect and always good at meditating, we're going to be miserable. Take the pressure off."
        ],
        "quote": "I'm in samsara. My butt's getting kicked by a lot of delusions. Oh, I'm just normal. Cool."
      },
      {
        "title": "Don't Turn the Anger Inward",
        "content": [
          "One student noticed she'd get annoyed at a situation, then get annoyed at herself for getting annoyed. Double delusion!",
          "As long as we're samsaric beings, we're going to keep getting deluded. We can't be in samsara AND not be deluded — those are contradictory states.",
          "We don't want to turn the anger on the self we normally see. Just recognize: as long as I stay ordinary, this cycle continues. Be patient with yourself."
        ]
      },
      {
        "title": "This Is People Doing Their Best",
        "content": [
          "When someone controlled by delusions behaves badly, remember: this is this person doing their best in samsara.",
          "If they could have done better, they would have. They don't know another way. It's not fun for them either.",
          "This person is a spiritual teacher for me, really showing me samsara's face. That's kind — I needed someone to show me eventually, because I keep thinking it's going to work out."
        ],
        "quote": "This is this person doing their best."
      },
      {
        "title": "The Fine China Problem",
        "content": [
          "If we relate to seated practice as 'fine china' — something we wait for the right moment to use, very formal, a bit uncomfortable — it gets weird.",
          "It can become an attachment: 'I need that time. If I don't have that time, what I'm doing isn't okay.' That's an unhealthy cycle.",
          "When you hit your six sessions, think: Fantastic, I did my job for today. One teacher said in less than a minute, you can tap into something very precious."
        ],
        "quote": "If you do the six sessions, just let it be that for the day. You did your job."
      },
      {
        "title": "The Precious Human Life Jackpot",
        "content": [
          "Each condition that makes up a precious human life is like a board in an ocean. We need many boards to make a raft. In most past lives, we got a few boards but not all at once.",
          "Some past version of us did actions specifically with the intention to create a bodily vehicle for spiritual growth — free of the eight worldly concerns. That's incredibly rare.",
          "When we ponder this improbability, we feel: wow, I've hit the jackpot. I've got to make something of this shot."
        ]
      },
      {
        "title": "Yogis in Your Lineage",
        "content": [
          "In your karmic lineage, there are amazing, beautiful spiritual people. You don't know them, but they gave you these conditions.",
          "It's like ancestors who went through immigration hardships or the Depression so you could have this life. There's gratitude for those people.",
          "They were like: 'Maybe in this life I'm not going to make it spiritually, but I really hope future me does. I'm rooting for them.'"
        ],
        "quote": "There are serious practitioners in my mindstream. Or else this wouldn't have appeared the way it did."
      },
      {
        "title": "Enlightenment Is Simple",
        "content": [
          "Enlightenment is just moving the thought 'I' from a body and mind that suffers to a Buddha's body and mind. That's all it is.",
          "We were going around imputing 'I' on a suffering body and mind, trying to make that one happy. That's why it's complicated.",
          "Stop thinking of the ordinary body and mind as us. Start thinking of a Buddha's body and mind as us. When we do that and don't stop — that's enlightenment."
        ],
        "quote": "You're just identifying with a losing team of losers. You can just change what team you identify with."
      }
    ],
    "mtb": {
      "title": "The Promise & Reason for Composition; The Precious Human Life",
      "content": [
        "In the first part of verse one Shantideva himself pays homage to the Three Jewels in order to eliminate the obstacles that might arise while composing this text. He prostrates first to the Sugatas, or Buddhas, who are endowed with the Truth Body (Skt. Dharmakaya) of an enlightened being as well as with all Dharma Jewels. He then pays homage to the Sangha by prostrating to the Bodhisattvas, the Buddhas' Noble Sons and Daughters, and lastly he pays homage to the Abbots and Preceptors and all those worthy of veneration. This concludes his expression of worship.",
        "THE PROMISE OF COMPOSITION",
        "[lcd] Next comes the traditional promise of composition. It was customary for authors to include such a promise at the beginning of their work to serve as a brief introduction to their intended subject matter. It is Shantideva's intention in this text to present a synthesis of all the paths leading to the attainment of highest enlightenment, Buddhahood. This is the meaning of Bodhisattvacharyavatara, for it is only by engaging in the Bodhisattva's way of life -- venturing into the activities of the Sons and Daughters of the Sugatas -- that we can attain this highest goal.",
        "There are two benefits of studying this precious text. The temporary benefit is that we gain an understanding of the entire path to enlightenment, and are thereby enabled to practise it. The ultimate benefit is that by depending upon this text we will attain the fully enlightened state of Buddhahood.",
        "The ultimate benefit depends upon the temporary benefit, the temporary benefit relies upon the meaning of the text, which in turn relies upon the text itself. This dependent relationship is known as the relationship of the text. Thus Shantideva's promise of composition in verse one indicates that his text has been composed in accordance with Buddha's scriptures and contains the four qualities of meaning, temporary benefit, ultimate benefit and relationship.",
        "THE REASON FOR COMPOSITION",
        "[2] Next Shantideva explains what his reasons are for composing this text. He admits that it will not contain anything that has not been explained before. Also, since he has no skill in the art of rhetoric or poetry, he has no intention of benefiting others who have already understood the teachings of Buddha. Rather, he wrote this text so that his own virtue would increase, his own understanding of the scriptures would not decline and his own mind would become better acquainted with the meaning of the scriptures.",
        "[3] He goes on to say that through the power of his faith, composition and wisdom he will explain the meaning of all the scriptures and thus his own realizations will increase for some time. He hopes that if others, equal in good fortune to himself, were to behold this text, it would prove meaningful for them as well.",
        "This concludes the preliminary explanation. With verse four Shantideva begins his presentation of the actual path to be followed by those wishing to enter the Bodhisattva's way of life.",
        "THE ACTUAL EXPLANATION OF THE STAGES OF THE PATH TO ENLIGHTENMENT",
        "This has two main parts:",
        "1\tThe exhortation to grasp the significance of this precious human life",
        "2\tThe method for making this precious human life meaningful",
        "THE EXHORTATION TO GRASP THE SIGNIFICANCE OF THIS PRECIOUS HUMAN LIFE",
        "[4] Shantideva begins by reminding us that we now have a most rare and precious possession, a fully endowed human life. In contrast to the overwhelming majority of beings in the universe, including most of our fellow humans, we have the opportunity to do something truly meaningful with our lives. We are free of certain restrictions and in possession of certain abilities and beneficial circumstances that make it possible for us to attain goals far beyond the reach of most beings. But if we do not make use of our present existence in the most worthwhile manner possible, it will be extremely difficult to gain such a beneficially endowed human life again. To appreciate these points more fully we must acquaint ourself with the following detailed analysis.",
        "First of all, why is our present state of existence considered to be so rare and so difficult to attain? The reason is that we were not born human by chance. Every effect has a cause, and our present existence as human beings -- and as specially endowed human beings -- is the result of a number of specific and hard-to-create causes. In general, birth as a human depends upon having previously practised pure moral discipline and giving. Specifically, each aspect of a fully endowed human life (as described below) has its own appropriate cause. Furthermore, in order to have attained this life we must have generated pure thoughts, or prayers, to receive a bodily vehicle with which we would have the leisure and ability to improve our mind through the continued practice of Dharma, or spiritual teachings. To be effective, such prayers have to be unpolluted by attachment to temporal comforts and happiness. As it is rare that we create even one of these necessary causes, it follows that the fruit resulting from a combination of them all must be extremely rare to find.",
        "Our present situation can be understood in terms of the following analogy. If a person comes across a nugget of gold but does not recognize its rarity and worth, he may easily throw it away. At this moment we have attained a precious human life far more valuable than gold, but if we do not recognize its worth we are apt to squander it in meaningless and purposeless pursuits. Thus it is very important, first of all, to recognize the eight freedoms and ten endowments of this rare and precious opportunity.",
        "The eight freedoms, or leisures, are in reference to being free from eight states of bondage -- four encountered even when born as a human being. The four freedoms from the bondage of non-human states of existence are:",
        "(1)\tFreedom from being born as a hell being",
        "(2)\tFreedom from being born as a hungry spirit",
        "(3)\tFreedom from being born as an animal",
        "(4)\tFreedom from being born as an ordinary god",
        "The four freedoms from obstacles found within human existence are:",
        "(5)\tFreedom from being born and remaining in a country where there is no religion",
        "(6)\tFreedom from being born and remaining in a country where there is no Buddhadharma",
        "(7)\tFreedom from being born and remaining with mental or physical disabilities",
        "(8)\tFreedom from holding wrong views denying Dharma, such as disbelief in the karmic law of cause and effect, the continuity of consciousness, and so forth",
        "These eight states are called the 'eight freedoms' because they are free from obstacles that oppose or completely prevent our practice of Dharma.",
        "The ten endowments are of two types: the five personal and the five circumstantial endowments. The five personal endowments are:",
        "(1)\tBeing born human",
        "(2)\tBeing born and remaining in a country where Dharma is flourishing -- a so-called 'central land'",
        "(3)\tBeing born and remaining with complete powers, free from mental and physical disabilities",
        "(4)\tNot having committed any of the five actions of immediate retribution. These are killing one's mother, killing one's father, killing an Arhat, shedding the blood of a Buddha with harmful intention, and causing division within a spiritual community",
        "(5)\tHaving faith in the three sets of Buddha's teachings (Skt. tripitaka) and the Buddhist teachings as a whole",
        "The five circumstantial endowments are:",
        "(6)\tTaking human rebirth in a world where Buddha has appeared",
        "(7)\tTaking human rebirth in a world where Buddha has taught Dharma",
        "(8)\tTaking human rebirth in a world where pure Dharma is still being taught",
        "(9)\tTaking human rebirth in a world where there are people practising pure Dharma",
        "(10)\tTaking human rebirth in a world where there are benefactors and sponsors for Dharma practitioners",
        "These ten states are called 'endowments' because they complete the conditions conducive to the practice of Dharma.",
        "It is because of our accumulated virtuous actions that we have now attained this precious human life endowed with the eighteen above characteristics. Therefore, now is the time to rejoice at our extraordinary good fortune. What is the purpose of this precious human life and why is it so valuable to us? The purpose and value of such an existence lie in the opportunity it affords us to accomplish one of three outstanding aims. The greatest goal now available to us is the attainment of enlightenment, the complete and perfect awakening of a Buddha. The intermediate goal is the attainment of personal liberation from samsara, the vicious cycle of birth and death fraught with suffering and dissatisfaction; while the smallest goal is to win rebirth as a god or as a human being.",
        "In general we remain completely unaware of the value of our present situation. In particular we are blind to the precious opportunity we now have to attain one of these three goals. Instead we waste our time and squander this precious opportunity by running after the temporary pleasures of this life. If we were to recognize fully the value and potential of this precious human life we would certainly take advantage of it by studying Dharma and seeking one of the three goals. As Shantideva says, 'If no meaning is derived from this precious rebirth now, how can we ever hope to come across it again in the future?'",
        "There is a story that illustrates the importance of taking full advantage of our precious human life. In a remote village in Tibet there lived a man who had no legs. One day as he was making his slow, laboured way across the countryside with the aid of crutches he accidentally fell over the edge of a cliff. As luck would have it he landed on the back of a wild horse grazing below. The horse was so startled that it galloped off with the man holding on for dear life. Quite a long time passed and, to the wonderment of the other villagers, the man showed no signs of tiring of his unusual mount. 'Why don't you get off that horse?' they shouted to him as he raced by. 'Not on your life!' he shouted back to them. 'This is the first time in my life I've ever been on horseback. When can a legless man like me ever hope for such an opportunity again? I'm going to take full advantage of it while I can.' And off he went, clutching on to the back of the wild horse. Just as the man in this story took advantage of his unusual luck, so should we take full advantage of our present fully endowed human life by training our mind in the practice of Dharma.",
        "THE METHOD FOR MAKING THIS PRECIOUS HUMAN LIFE MEANINGFUL",
        "This has two parts:",
        "1\tContemplating the benefits of bodhichitta",
        "2\tHow to practise the six perfections once bodhichitta has been developed",
        "CONTEMPLATING THE BENEFITS OF BODHICHITTA",
        "This section has four parts:",
        "1\tAn explanation of the benefits of bodhichitta",
        "2\tRecognizing bodhichitta",
        "3\tThe reasons for the benefits of bodhichitta",
        "4\tPraise to the one who gives birth to bodhichitta"
      ]
    },
    "shantideva": {
      "title": "Not covered this class",
      "content": "This class focused on precious human life meditation from MTB."
    },
    "preview": {
      "title": "The Ten Benefits of Bodhichitta (1-3)",
      "content": [
        "AN EXPLANATION OF THE BENEFITS OF BODHICHITTA",
        "As indicated before, the supreme method for making this rare and precious human rebirth meaningful is to use it as a vehicle for attaining the most perfect and complete enlightenment. To work for any lesser goal is to throw away this unique opportunity. Since the attainment of enlightenment depends upon first developing the mind of enlightenment, bodhichitta -- the motivation to achieve full enlightenment in order to be most effective in helping others out of their suffering -- Shantideva encourages us to develop bodhichitta, and describes its many advantages. These are divided into the following ten outstanding benefits.",
        "The conquest of all great evils",
        "[5] Just as a sudden, powerful flash of lightning on a pitch-dark night briefly illuminates the landscape, so the powerful blessings of Buddha cause worldly people to develop, at least for a short time, the intention to practise virtue.",
        "[6] Usually the virtues of worldly people are weak, while their instincts for non-virtue are strong. Thus we must constantly strive to overcome the great power this evil of non-virtue exerts upon us, replacing it with a strong practice of virtuous actions. Otherwise, if we do nothing to correct our present situation, the sufferings of samsara will be our sole experience. What is the best method for abandoning evil and creating virtue? We must strive to attain the precious bodhichitta. Only it has the power to overcome evil and abundantly increase our virtue. Other than the boundless mind of bodhichitta what else has the ability to subdue such great evil? By reflecting upon this well it becomes clear that we must definitely develop bodhichitta.",
        "The attainment of the most sublime happiness",
        "[7] In general there are many ways in which we can benefit sentient beings, but the Buddhas who have spent aeons examining the best way to help others say that developing bodhichitta is the supreme method. Why is this? Because with the development of bodhichitta we are not only able to attain the supreme happiness of Buddhahood for ourself, but we are also able to lead countless masses of sentient beings to the incomparable bliss of this supreme state. Recognizing the matchless benefits bodhichitta has for ourself and others, we should strive to attain it.",
        "Wish-fulfilment",
        "[8] A further benefit of developing bodhichitta is that all of our wishes will be fulfilled. If we want to be released from the many miseries of samsara and dispel the unhappiness of others, bodhichitta can fulfil these aims. In addition it fulfils the desire of all beings, including ourself, who long to experience limitless and immeasurable joy. Therefore, since this mind of enlightenment grants all wishes, Shantideva advises us to reflect upon its many benefits and never cease striving to attain it."
      ]
    },
    "recording": "https://drive.google.com/file/d/1WDgZTgtGkNdKNSlJDAI1gs5QeBBbuJtJ/view?usp=share_link"
  },
  {
    "id": "nov30",
    "date": "Nov 30",
    "year": "2025",
    "topic": "Benefits of Bodhicitta",
    "practice": {
      "title": "Contemplate the Ten Benefits",
      "steps": [
        "Learn the ten benefits: CAWN-I-VIP-SS (Conquest, Attainment, Wish-fulfillment, Name & meaning, Inferior transformed, Value, Increasing benefits, Protection, Swift destruction, Scriptural citations)",
        "Do one benefit per day — really milk it until it touches your heart",
        "Or match benefits to your six sessions — one per session",
        "Do the postcard experiment: Go to three places (one comfortable, one neutral, one you think will reject you) and offer a meditation postcard. Notice your mind.",
        "Bring benefits of bodhicitta into your Six-Session practice — let admiring faith grow"
      ],
      "quote": "We're basically always wishing for something. What we're trying to do is raise our wish for bodhicitta to a critical mass greater than our worldly concerns."
    },
    "commentary": [
      {
        "title": "The Ten Benefits — CAWN-I-VIP-SS",
        "content": [
          "Conquest of all great evils. Attainment of most sublime happiness. Wish fulfillment. Special Name and meaning.",
          "Transformation of the Inferior into the supreme. Value of supreme bodhicitta (so hard to find). Increasing and inexhaustible benefits.",
          "Power of Protection from great fear. Swift and easy destruction of great evil. Scriptural citations.",
          "These ten are ten individual meditations. Get a special feeling for all ten — you need to milk them a little bit."
        ]
      },
      {
        "title": "One Benefit Per Day",
        "content": [
          "Try one benefit a day and keep it in mind throughout the day. Bring it into your Six-Session practice.",
          "Sometimes the first few shots, you're not there yet — you're just getting your mind around it. By the third or fourth session, you start to feel what's really being talked about.",
          "For example: 'Bodhicitta carries with it a special name and meaning.' Does that touch your heart at first? Maybe not. But there's this lineage of Buddhahood... I'm in this lineage. Ah, that's why it's so special."
        ],
        "quote": "I've found personally, one a day is a nice way to do it."
      },
      {
        "title": "Faith → Aspiration → Effort",
        "content": [
          "The way to develop any positive state of mind is through the dependent relationship between faith, aspiration, and effort.",
          "Through admiring faith in bodhicitta, we develop wishing faith (aspiration), and then we put in joyful effort.",
          "If we have a strong, powerful wish to develop bodhicitta, we just will — very quickly and easily. Without that wish, we feel like 'I should do it, I'm supposed to' — a moralistic, dead place to live."
        ],
        "quote": "All we have to do is admire it more and more."
      },
      {
        "title": "Raise Your Wish Above Worldly Concerns",
        "content": [
          "We're basically always wishing for something. When our Dharma practice is dominated by wishes for worldly concerns — wealth, reputation, pleasure, avoiding pain — those wishes dominate everything we do.",
          "It's like owning 51% of a company — you have deciding power. We want our wish for bodhicitta to have 51%.",
          "The benefits help us see: my basic wish to be happy is being fulfilled by bodhicitta. Craving worldly things goes AGAINST my basic wishes because it makes me absolutely miserable."
        ]
      },
      {
        "title": "What Is 'Evil'?",
        "content": [
          "Mara in Sanskrit means demon — something that obstructs our liberation. The five contaminated aggregates, uncontrolled death, and especially delusions are Maras.",
          "We want to feel the gravity of it. Sometimes we don't think of delusions that way: 'Oh, it's just a little attachment.' But what does attachment do to us? It's terrifying. The effects are evil — terrible.",
          "Bodhicitta conquers all this. When the container and contents are filled with evil, transform adverse conditions into the path to enlightenment."
        ],
        "quote": "The only thing to hold onto when we feel like we're drowning is compassion for others."
      },
      {
        "title": "The Postcard Experiment",
        "content": [
          "Take three postcards from the center. Go to three places: one where people will be open, one neutral, one where you think they'll reject you.",
          "Just say: 'Hey, I've got a postcard for a meditation class.' Oppose your fear and nervousness. See what happens.",
          "The point is to look at our mind that wants to connect to others — or wants to isolate. Start learning about it."
        ],
        "quote": "I don't think we want to put anyone in a box. Meditation is just about overcoming delusions and increasing virtues. That's for everyone."
      },
      {
        "title": "Don't Isolate Your Practice",
        "content": [
          "We want to explore: what is this tendency towards isolation in our practice and life? Do we conceptualize our practice as something private, alone, isolated?",
          "Bodhicitta is about reaching out, connecting to others, benefiting others. We oppose our fear and nervousness.",
          "Even places you think won't be interested — you might be surprised. One student went to a barbershop with religious garb and they said: 'Meditation? Fantastic! Put it right there!'"
        ]
      }
    ],
    "mtb": {
      "title": "The Ten Benefits of Bodhichitta (1-3)",
      "content": [
        "AN EXPLANATION OF THE BENEFITS OF BODHICHITTA",
        "As indicated before, the supreme method for making this rare and precious human rebirth meaningful is to use it as a vehicle for attaining the most perfect and complete enlightenment. To work for any lesser goal is to throw away this unique opportunity. Since the attainment of enlightenment depends upon first developing the mind of enlightenment, bodhichitta -- the motivation to achieve full enlightenment in order to be most effective in helping others out of their suffering -- Shantideva encourages us to develop bodhichitta, and describes its many advantages. These are divided into the following ten outstanding benefits.",
        "The conquest of all great evils",
        "[5] Just as a sudden, powerful flash of lightning on a pitch-dark night briefly illuminates the landscape, so the powerful blessings of Buddha cause worldly people to develop, at least for a short time, the intention to practise virtue.",
        "[6] Usually the virtues of worldly people are weak, while their instincts for non-virtue are strong. Thus we must constantly strive to overcome the great power this evil of non-virtue exerts upon us, replacing it with a strong practice of virtuous actions. Otherwise, if we do nothing to correct our present situation, the sufferings of samsara will be our sole experience. What is the best method for abandoning evil and creating virtue? We must strive to attain the precious bodhichitta. Only it has the power to overcome evil and abundantly increase our virtue. Other than the boundless mind of bodhichitta what else has the ability to subdue such great evil? By reflecting upon this well it becomes clear that we must definitely develop bodhichitta.",
        "The attainment of the most sublime happiness",
        "[7] In general there are many ways in which we can benefit sentient beings, but the Buddhas who have spent aeons examining the best way to help others say that developing bodhichitta is the supreme method. Why is this? Because with the development of bodhichitta we are not only able to attain the supreme happiness of Buddhahood for ourself, but we are also able to lead countless masses of sentient beings to the incomparable bliss of this supreme state. Recognizing the matchless benefits bodhichitta has for ourself and others, we should strive to attain it.",
        "Wish-fulfilment",
        "[8] A further benefit of developing bodhichitta is that all of our wishes will be fulfilled. If we want to be released from the many miseries of samsara and dispel the unhappiness of others, bodhichitta can fulfil these aims. In addition it fulfils the desire of all beings, including ourself, who long to experience limitless and immeasurable joy. Therefore, since this mind of enlightenment grants all wishes, Shantideva advises us to reflect upon its many benefits and never cease striving to attain it."
      ]
    },
    "shantideva": {
      "chapter": 1,
      "verses": "1-14",
      "title": "The Benefits of Bodhicitta"
    },
    "preview": {
      "title": "The Ten Benefits of Bodhichitta (4-8)",
      "content": [
        "Bodhichitta carries with it a special name and meaning",
        "[9] Shantideva says that anyone who develops bodhichitta is thereafter referred to as a 'Son of the Buddhas' (literally, a Son of the Sugatas), a Bodhisattva. Such a person becomes an object worthy to be venerated and respected by worldly gods, such as Brahma and Indra, and all of humanity, including high-born kings and queens. It does not matter if the person developing bodhichitta is a poor, shabbily dressed beggar. Upon his generating the mind of enlightenment he, too, would become an object worthy of the highest veneration.",
        "It is important to remember that we do not need to be a monk or of aristocratic birth or to possess a male body in order to develop bodhichitta. Although Shantideva uses the title 'Son of the Buddhas', he is not using it restrictively. When a woman develops the mind of enlightenment she becomes known as a 'Daughter or Princess of the Buddhas' and likewise becomes an object to be venerated by all gods and humans.",
        "Why does developing bodhichitta entitle us to so much respect? Because all Buddhas -- those fully awakened beings from whom supreme happiness derives -- are born from Bodhisattvas, who are so-called by virtue of their bodhichitta motivation, their intention to win full awakening for the benefit of all. Thus Buddhas arise from Bodhisattvas who in turn arise from bodhichitta.",
        "To stress the supreme value of bodhichitta, Buddha Shakyamuni says that it is even more important to prostrate, or pay homage, to a Bodhisattva -- someone who has developed bodhichitta -- than it is to prostrate to a Buddha. He explains this by using the example of the waxing moon. If someone bows down to the new moon it is the same as bowing down to every phase of the moon between new and full. Why? Because by paying respect to a cause we are implicitly paying respect to each of its succeeding effects. Thus, if we prostrate to a Bodhisattva we are implicitly paying homage to all the future states of his or her development, up to and including the attainment of Buddhahood. For such reasons then, bodhichitta is very precious and anyone who develops this mind becomes worthy of veneration.",
        "The great Indian Pandit Atisha had many Teachers and received much instruction from them concerning the development of bodhichitta. But not being satisfied he set out on a dangerous journey to present-day Indonesia in order to receive teachings from the famous Guru Serlingpa (Suvarnadipa). The difficult voyage took thirteen months, but from this Guru Atisha was able to receive flawless and complete instructions on the method for developing the mind of enlightenment.",
        "Although Atisha had over one hundred and fifty Teachers, he referred to Serlingpa as his root Guru. Even many years later when he was in Tibet, if Atisha even heard the name of his root Guru he would immediately descend from his seat and prostrate to him. The Tibetans noticed that he did not do this for any of his other Teachers and asked him why. He replied that from the instructions given him by Guru Serlingpa he realized how to develop the precious bodhichitta. Atisha, the possessor of great learning, held bodhichitta supreme; consequently he venerated Serlingpa above all his other Teachers.",
        "Transformation of the inferior into the supreme",
        "[10] Alchemists assert that there is a special elixir that has the power to transform base metals into gold. If we develop and practise bodhichitta, this impure human body of ours will likewise be transformed into the priceless, peerless jewel of a Buddha's holy body.",
        "The way to meditate on this point is as follows. First we should continually contemplate the impurity of the human body, thinking how undesirable it is to take rebirth constantly in such a gross and impure form. We should abandon whatever desire we might have for this ordinary human body and think instead of the preciousness of the transcendent body of a Buddha. We must develop the strong wish to attain this holy form and consider by what causes we may receive it. Upon continued reflection we will come to recognize that such a form can be achieved solely through the power of bodhichitta. Understanding this, we should then develop a strong determination to attain bodhichitta and mindfully hold this determination.",
        "The value of the precious bodhichitta, so difficult to find",
        "[11] Amongst all jewels the fabled wishfulfilling jewel is the rarest, most priceless, and of foremost importance because it alleviates the poverty of all. Similarly, amongst all kinds of virtue the rarest and most priceless is bodhichitta because it alone can dispel the poverty of those who are poor in virtue. Those who wish to be freed from the sufferings of samsara should firmly maintain this precious bodhichitta.",
        "A skilful oarsman ferries merchants from the mainland to a jewel island. Similarly, Buddha is an oarsman possessing a mind of boundless compassion and skilful methods. This mind is the boat of bodhichitta and in it he ferries all sentient beings across the ocean of suffering to the jewel island of enlightenment. If we make a thorough examination we will clearly see that this boat of bodhichitta is the most sublime and rarest of all methods to achieve happiness.",
        "The inexhaustible and increasing fruits of bodhichitta",
        "[12] Virtues other than bodhichitta are like the banana or plantain tree, the fruits of which are limited and soon exhausted. For instance, a person becomes rich because of his practice of giving in a previous life, but the fruits of such virtue are gradually used up, and when these riches are finished no more will come.",
        "In contrast, the virtuous fruits from the celestial tree of bodhichitta are inexhaustible. They are like a drop of water that falls into a vast ocean and is therefore never lost until that great ocean itself becomes no more. Even though our virtues in general may be weak, when motivated by bodhichitta their fruits will never be exhausted until we attain complete awakening. Why are the fruits of such actions limitless? There are two reasons for this. First, since the number of sentient beings benefited by a Bodhisattva is countless, the merit arising from actions created for their sake will likewise be limitless. Secondly, since all such merit is dedicated solely for our attainment of enlightenment it will not be exhausted until this enlightenment is reached.",
        "It is said that giving even a little food to a single beggar, if done with the motivation of bodhichitta, produces inexhaustible merit. If we lack such a motivation it does not matter how much gold or silver we give to no matter how many people; the fruits of such virtuous actions are limited and will soon be exhausted. When we realize how abundant are the fruits of all actions proceeding from bodhichitta, we will see that there is nothing more important than striving to attain this precious mind.",
        "The power of protection from great fear",
        "[13] A man travelling in an area where there is great danger from robbers and wild animals will be filled with great fear. However, if he entrusts himself to the protection of a courageous guide he will immediately be relieved of his anxieties. We human beings, because we have committed very harmful and evil actions in the past, are likewise exposed to the fearful dangers of birth in one of the three lower states of existence -- as a hell being, hungry spirit or animal. Even as a human being we fear birth, sickness, loss, violence, old age, death, and the other painful effects of our non-virtuous actions. What has the power to relieve us of this fear? Only the precious bodhichitta. Therefore why do those who are vigilant and wise not devote themselves to the development of this precious mind?",
        "The swift and easy destruction of great evil",
        "[14ab] The world in which we live undergoes great cycles of birth and decay. At the end of the present great aeon our universe will be completely destroyed by fire so that not even the ashes of it will remain. This all-consuming fire will be completely different from the ordinary fires of this world and thousands of times more intense. If we give birth to the precious bodhichitta, the fire of that mind will be similarly intense, sufficient to consume instantly all the immeasurable evil we have accumulated.",
        "Scriptural citations of the benefits of bodhichitta",
        "[14cd] The extensive benefits of bodhichitta were explained to the Bodhisattva Sudhana by Buddha Maitreya in Stalks in Array Sutra (Skt. Gandavyuhasutra). In the conclusion to this fourteenth verse, Shantideva advises those who wish to learn about these many advantages to consult that famous Mahayana scripture."
      ]
    },
    "recording": "https://drive.google.com/file/d/1avRjDRiqgFxvezWqWpL__N4LV4nBVolz/view?usp=share_link"
  },
  {
    "id": "dec07",
    "date": "Dec 7",
    "year": "2025",
    "topic": "Intention & Karma",
    "practice": {
      "title": "Set Bodhicitta Intention and Relax",
      "steps": [
        "Set a bodhicitta intention, then relax — the relaxing part is what makes the practice really work",
        "Beseech your spiritual guide to help you break through your particular bedrock: 'Help me jackhammer through this!'",
        "Evaluate your trust in karma — look at situations and notice your faith",
        "When you pray for someone, delight in your virtuous action and ignore whether 'the things you normally see' look better. Believe your prayer came true.",
        "Laugh at your delusions — it's like poking a bully in the eye. They lose all power."
      ],
      "quote": "Set a bodhicitta intention and relax. That relaxing part actually makes the practice really work."
    },
    "commentary": [
      {
        "title": "Laugh at Your Delusions",
        "content": [
          "When you laugh at your delusions, it's like poking a schoolyard bully in the eye. They come up looking tough, you poke them right in the eyeball, and they cry and run away.",
          "Their power is in your fear. Once you stop being afraid, they have no power. They have no arms and legs and courage or skill.",
          "We're not laughing at ourselves — we're laughing at the delusions. When we do that, they completely get disempowered."
        ],
        "quote": "Ha ha ha ha ha, you dumb little self-cherishing."
      },
      {
        "title": "Don't Take Delusions Seriously",
        "content": [
          "When we catch ourselves in a delusion, it's very easy to start taking it super seriously. That's often our self-cherishing — another delusion!",
          "Now we have two delusions: the initial one (anger, attachment) plus self-cherishing of taking ourselves so seriously, thinking how bad we are.",
          "If we just get at it right away and laugh at its ridiculousness, it loses its grip over us immediately."
        ]
      },
      {
        "title": "Ignore the Things You Normally See",
        "content": [
          "When praying for people, we often evaluate 'the things we normally see' as evidence of whether it's working. If they still seem to suffer, we get discouraged.",
          "Geshe-la said: when he makes prayers and dedications, trying to envision them as true, even if things don't look that way, 'I ignore the things I normally see. I believe they have come true.'",
          "We can hold the beneficial belief that our prayer came true, and our mind is still just hallucinating the things we normally see."
        ],
        "quote": "I ignore the things I normally see. I believe they have come true."
      },
      {
        "title": "Your Relationship with Your Guru Is Personal",
        "content": [
          "Our relationship with our spiritual guide is completely personal and intimate. It's dynamic. It's no one else's relationship.",
          "It goes back many lives and will continue into future lives. Every other relationship basically disappears when we die.",
          "If something's not working, have a chat. 'Hey, can you help guide me? Your job is to guide me. What's my next step? Help me here, please.'"
        ],
        "quote": "Our spiritual life is our choice. The way we approach it is our choice."
      },
      {
        "title": "Relax After Setting Intention",
        "content": [
          "When setting a bodhicitta intention, the relaxing part is really important — it's a sign that we're actually setting an intention.",
          "If we really are setting that intention, we just relax, because it's enough. Sometimes: step one, generate the intention. Step two, now I relax.",
          "It's a lovely mindfulness practice to do throughout the day."
        ]
      },
      {
        "title": "Princess of the Buddhas",
        "content": [
          "Anyone who develops bodhicitta becomes a son or daughter of the Buddhas — an object worthy to be venerated by worldly gods and all humanity.",
          "It doesn't matter if you're a poor, shabbily dressed beggar. Upon generating the mind of enlightenment, you become worthy of the highest veneration.",
          "There's nothing in Buddhism that has any preference for gender, nationality, etc. We're not our body. We've been millions of bodies — male, female, cockroaches, shrimp, formless gods."
        ],
        "quote": "It's very nice to be the princess of the Buddhas."
      },
      {
        "title": "Beware Cultural Infiltration",
        "content": [
          "It's easy for cultural norms to infiltrate the Dharma. People can think something cultural is actually part of the Dharma.",
          "We have to be careful: often we feel a cultural norm IS the truth, when it's just a norm that fits for right now.",
          "Appreciate Geshe-la for clearly making Gen-la Dekyong the head of our tradition — that's not normal in many Buddhist traditions. He didn't have limited ways of thinking."
        ]
      }
    ],
    "mtb": {
      "title": "The Ten Benefits of Bodhichitta (4-8)",
      "content": [
        "Bodhichitta carries with it a special name and meaning",
        "[9] Shantideva says that anyone who develops bodhichitta is thereafter referred to as a 'Son of the Buddhas' (literally, a Son of the Sugatas), a Bodhisattva. Such a person becomes an object worthy to be venerated and respected by worldly gods, such as Brahma and Indra, and all of humanity, including high-born kings and queens. It does not matter if the person developing bodhichitta is a poor, shabbily dressed beggar. Upon his generating the mind of enlightenment he, too, would become an object worthy of the highest veneration.",
        "It is important to remember that we do not need to be a monk or of aristocratic birth or to possess a male body in order to develop bodhichitta. Although Shantideva uses the title 'Son of the Buddhas', he is not using it restrictively. When a woman develops the mind of enlightenment she becomes known as a 'Daughter or Princess of the Buddhas' and likewise becomes an object to be venerated by all gods and humans.",
        "Why does developing bodhichitta entitle us to so much respect? Because all Buddhas -- those fully awakened beings from whom supreme happiness derives -- are born from Bodhisattvas, who are so-called by virtue of their bodhichitta motivation, their intention to win full awakening for the benefit of all. Thus Buddhas arise from Bodhisattvas who in turn arise from bodhichitta.",
        "To stress the supreme value of bodhichitta, Buddha Shakyamuni says that it is even more important to prostrate, or pay homage, to a Bodhisattva -- someone who has developed bodhichitta -- than it is to prostrate to a Buddha. He explains this by using the example of the waxing moon. If someone bows down to the new moon it is the same as bowing down to every phase of the moon between new and full. Why? Because by paying respect to a cause we are implicitly paying respect to each of its succeeding effects. Thus, if we prostrate to a Bodhisattva we are implicitly paying homage to all the future states of his or her development, up to and including the attainment of Buddhahood. For such reasons then, bodhichitta is very precious and anyone who develops this mind becomes worthy of veneration.",
        "The great Indian Pandit Atisha had many Teachers and received much instruction from them concerning the development of bodhichitta. But not being satisfied he set out on a dangerous journey to present-day Indonesia in order to receive teachings from the famous Guru Serlingpa (Suvarnadipa). The difficult voyage took thirteen months, but from this Guru Atisha was able to receive flawless and complete instructions on the method for developing the mind of enlightenment.",
        "Although Atisha had over one hundred and fifty Teachers, he referred to Serlingpa as his root Guru. Even many years later when he was in Tibet, if Atisha even heard the name of his root Guru he would immediately descend from his seat and prostrate to him. The Tibetans noticed that he did not do this for any of his other Teachers and asked him why. He replied that from the instructions given him by Guru Serlingpa he realized how to develop the precious bodhichitta. Atisha, the possessor of great learning, held bodhichitta supreme; consequently he venerated Serlingpa above all his other Teachers.",
        "Transformation of the inferior into the supreme",
        "[10] Alchemists assert that there is a special elixir that has the power to transform base metals into gold. If we develop and practise bodhichitta, this impure human body of ours will likewise be transformed into the priceless, peerless jewel of a Buddha's holy body.",
        "The way to meditate on this point is as follows. First we should continually contemplate the impurity of the human body, thinking how undesirable it is to take rebirth constantly in such a gross and impure form. We should abandon whatever desire we might have for this ordinary human body and think instead of the preciousness of the transcendent body of a Buddha. We must develop the strong wish to attain this holy form and consider by what causes we may receive it. Upon continued reflection we will come to recognize that such a form can be achieved solely through the power of bodhichitta. Understanding this, we should then develop a strong determination to attain bodhichitta and mindfully hold this determination.",
        "The value of the precious bodhichitta, so difficult to find",
        "[11] Amongst all jewels the fabled wishfulfilling jewel is the rarest, most priceless, and of foremost importance because it alleviates the poverty of all. Similarly, amongst all kinds of virtue the rarest and most priceless is bodhichitta because it alone can dispel the poverty of those who are poor in virtue. Those who wish to be freed from the sufferings of samsara should firmly maintain this precious bodhichitta.",
        "A skilful oarsman ferries merchants from the mainland to a jewel island. Similarly, Buddha is an oarsman possessing a mind of boundless compassion and skilful methods. This mind is the boat of bodhichitta and in it he ferries all sentient beings across the ocean of suffering to the jewel island of enlightenment. If we make a thorough examination we will clearly see that this boat of bodhichitta is the most sublime and rarest of all methods to achieve happiness.",
        "The inexhaustible and increasing fruits of bodhichitta",
        "[12] Virtues other than bodhichitta are like the banana or plantain tree, the fruits of which are limited and soon exhausted. For instance, a person becomes rich because of his practice of giving in a previous life, but the fruits of such virtue are gradually used up, and when these riches are finished no more will come.",
        "In contrast, the virtuous fruits from the celestial tree of bodhichitta are inexhaustible. They are like a drop of water that falls into a vast ocean and is therefore never lost until that great ocean itself becomes no more. Even though our virtues in general may be weak, when motivated by bodhichitta their fruits will never be exhausted until we attain complete awakening. Why are the fruits of such actions limitless? There are two reasons for this. First, since the number of sentient beings benefited by a Bodhisattva is countless, the merit arising from actions created for their sake will likewise be limitless. Secondly, since all such merit is dedicated solely for our attainment of enlightenment it will not be exhausted until this enlightenment is reached.",
        "It is said that giving even a little food to a single beggar, if done with the motivation of bodhichitta, produces inexhaustible merit. If we lack such a motivation it does not matter how much gold or silver we give to no matter how many people; the fruits of such virtuous actions are limited and will soon be exhausted. When we realize how abundant are the fruits of all actions proceeding from bodhichitta, we will see that there is nothing more important than striving to attain this precious mind.",
        "The power of protection from great fear",
        "[13] A man travelling in an area where there is great danger from robbers and wild animals will be filled with great fear. However, if he entrusts himself to the protection of a courageous guide he will immediately be relieved of his anxieties. We human beings, because we have committed very harmful and evil actions in the past, are likewise exposed to the fearful dangers of birth in one of the three lower states of existence -- as a hell being, hungry spirit or animal. Even as a human being we fear birth, sickness, loss, violence, old age, death, and the other painful effects of our non-virtuous actions. What has the power to relieve us of this fear? Only the precious bodhichitta. Therefore why do those who are vigilant and wise not devote themselves to the development of this precious mind?",
        "The swift and easy destruction of great evil",
        "[14ab] The world in which we live undergoes great cycles of birth and decay. At the end of the present great aeon our universe will be completely destroyed by fire so that not even the ashes of it will remain. This all-consuming fire will be completely different from the ordinary fires of this world and thousands of times more intense. If we give birth to the precious bodhichitta, the fire of that mind will be similarly intense, sufficient to consume instantly all the immeasurable evil we have accumulated.",
        "Scriptural citations of the benefits of bodhichitta",
        "[14cd] The extensive benefits of bodhichitta were explained to the Bodhisattva Sudhana by Buddha Maitreya in Stalks in Array Sutra (Skt. Gandavyuhasutra). In the conclusion to this fourteenth verse, Shantideva advises those who wish to learn about these many advantages to consult that famous Mahayana scripture."
      ]
    },
    "shantideva": {
      "title": "Chapter 1, Verses 15-25",
      "content": "(15) In brief, you should know\nThat bodhichitta has two types:\nThe mind that observes enlightenment and aspires,\nAnd the mind that observes enlightenment and engages.\n\n(16) Just as the distinction between wishing to go\nAnd actually going is understood,\nSo, respectively, the wise should understand\nThe difference between these two bodhichittas.\n\n(17) From the mind that aspires to enlightenment,\nGreat effects arise while in samsara;\nBut an uninterrupted flow of good fortune does not ensue\nAs it does from the engaging mind.\n\n(18) For whoever takes up the engaging mind of bodhichitta\nWith the intention never to turn back\nFrom completely liberating\nThe infinite living beings throughout all realms,\n\n(19) From that time forth, for him there will arise --\nEven if he is asleep or apparently unconcerned --\nVast and powerful merit, equal to space,\nThat flows without interruption.\n\n(20) For the sake of those with lesser inclinations,\nThese benefits were explained with logical reasons\nBy the Tathagata himself\nIn Sutra Requested by Subahu.\n\n(21) If even the thought to relieve\nThe headaches of others\nIs a beneficial intention\nThat results in infinite merit,\n\n(22) What can be said of the wish\nTo dispel the immeasurable misery\nOf each and every living being\nAnd lead them all to countless good qualities?\n\n(23) Does our father or mother\nHave such a beneficial intention as this?\nDo the gods or the sages?\nDoes even Brahma himself?\n\n(24) If, before generating bodhichitta, these living beings\nDo not even dream of such a mind\nFor their own sakes,\nHow will they develop it for the sake of others?\n\n(25) This mind to benefit living beings,\nWhich does not arise in others even for their own sakes,\nIs an extraordinary jewel of a mind,\nWhose birth is an unprecedented wonder."
    },
    "preview": {
      "title": "The Ten Benefits of Bodhichitta (9-10); Contemplating the Benefits",
      "content": [
        "If we are to engage in the actual development of bodhichitta we need strong inspiration, and this is only acquired by reflecting on the many benefits of this mind. If we knew of a king who had great wealth, power and knowledge we might easily think, 'How wonderful it would be to become like him!' Such a desire arises only because we have seen the good qualities that king possesses and therefore we wish to emulate him. Similarly, first we must understand the good qualities of bodhichitta and only then will the thought arise, 'How wonderful it would be to give birth to such a precious mind!'",
        "At present, however, if someone were to ask us which we would prefer, to develop bodhichitta or possess a nugget of gold, we would certainly choose the gold. This is because we see the valuable qualities of gold but fail to see the incomparable qualities and benefits of bodhichitta. If we understood these benefits our choice would be different. We would realize that while gold is easily obtained, no amount of money in the world can buy bodhichitta, something not found for sale anywhere. The only way to obtain the precious bodhichitta is to develop it ourself through long meditation.",
        "Until we develop a continuous and spontaneous aspiration to develop bodhichitta we should spend much time contemplating its benefits in general. From Shantideva's list of ten benefits we should select the one that has the strongest positive influence on our mind and meditate reflectively upon it. For such a meditation to be of greatest value it should be continuous and concentrated. Then at the close of the meditation session we should repeat the prayer originally cited in the introduction to this commentary:",
        "May the precious, supreme bodhichitta",
        "Grow where it has not yet grown;",
        "Where it has grown may it not decrease",
        "But flourish for evermore.",
        "By reciting this prayer we are stating our desire to give birth to bodhichitta as quickly as possible. We can recite this prayer after performing any virtuous action.",
        "We should remember that, without bodhichitta, whatever powers we may have and whatever miracles we may be able to perform are of no real benefit. Being able to fly in the sky is of no importance for even birds are able to do this. We have had such miracle powers and clairvoyance many times in our previous lives, but what have they done for us? Now is the time to control our untamed mind with bodhichitta. With bodhichitta the mind is made peaceful; enlightenment and the fulfilment of all our wishes are not very far away.",
        "It is important to remember that we cannot attain enlightenment if we do not first acquaint ourself with and then master the methods for developing bodhichitta. We must practise these methods as diligently as possible, all the while exhorting ourself to generate this precious attitude. Nowadays, with the world in turmoil, there is a particular need for us to cultivate bodhichitta. If we are to make it through these perilous times, true Bodhisattvas must appear everywhere, throughout the world.",
        "To develop bodhichitta we must complete four preparations. It is very important to know these because if we prepare well it is easy to develop bodhichitta. Thus we should (1) acquaint our mind with the benefits of bodhichitta, (2) accumulate a wealth of merit, (3) purify ourself of all non-virtue and (4) understand the method for developing bodhichitta. The last point will be discussed in the next section of this commentary."
      ]
    },
    "recording": "https://drive.google.com/file/d/17Urnv-qko31RpKz8UCMtdIW8snHrYEj8/view?usp=share_link"
  },
  {
    "id": "dec14",
    "date": "Dec 14",
    "year": "2025",
    "topic": "Year-End Reflection",
    "practice": {
      "title": "Diagnose Your Practice Phase",
      "steps": [
        "Use the airplane analogy to diagnose where you are: Reading the handbook? Taking off? Soaring? Losing steam? Free-falling? Crash-landed? Purposefully landing?",
        "Identify YOUR specific obstacles to bodhicitta — go through faith issues, effort issues, distraction issues, renunciation issues",
        "Work on distraction through spiritual guide reliance — when distracted, the only escape seems like more distraction. Break the cycle.",
        "Practice 'boatman-like' bodhicitta — going to enlightenment together with all beings, not shepherd-like (leading them there first)",
        "Practice in low-stakes situations — wholeheartedly accept the red light, the cold, the unshoveled sidewalk. Build a reservoir of peace."
      ],
      "quote": "If we're not doing it, there's an obstacle — or two, or ten. We want to figure out what these are for us."
    },
    "commentary": [
      {
        "title": "Set Intention and Be Peaceful (Not Passive)",
        "content": [
          "When we say 'set bodhicitta intention and relax,' relaxed doesn't mean passive or low-energy. It means deeply peaceful.",
          "You can be totally vigilant AND totally peaceful. You can be totally engaged and energetic AND totally peaceful.",
          "Can you envision a relaxed vigilance? A relaxed activity? Maybe 'peaceful' is a better word than 'relaxed.'"
        ],
        "quote": "That relaxing part is what makes the practice really work."
      },
      {
        "title": "Inputs vs. Outputs",
        "content": [
          "Unpeacefulness about any output is always attachment. We have to label that over and over.",
          "There's a way to do our best, not get a certain output, but feel deeply peaceful. But first we must identify worry as attachment.",
          "When you set your intention and focus on the input (your action), let go of evaluating the output."
        ]
      },
      {
        "title": "Practice in Low-Stakes Situations",
        "content": [
          "We often pull out Dharma tools in the fires of our day, but go on autopilot in the easier moments — walking down the street, shopping, hanging out with friends.",
          "It's often the opposite that works better: practice in times of relative calm. That's where we get a feeling for the tools and build up a reservoir of peace.",
          "Walking to the Dharma Center — were you wholeheartedly accepting the way things are? Or was there 'ugh, it's cold' or 'why is the light red'? Those are moments of non-acceptance."
        ],
        "quote": "If we're not even doing it in the easy moments, that's actually our level of practice right now. And that's not small — it's big."
      },
      {
        "title": "Everything as a Test",
        "content": [
          "See everything that happens as a test from your spiritual guide. 'Maybe this is one of those tests.' All of a sudden, it's no problem at all.",
          "It becomes a little game: how much can I accept this situation? There's a purification that happens when you accept something you wouldn't have previously accepted.",
          "It's like putting out little fires in your mind. It feels really nice."
        ]
      },
      {
        "title": "Obstacles to Bodhicitta: Faith",
        "content": [
          "Start with faith issues: Do I really believe in bodhicitta? Do I admire it the same way I admire other realizations? Is there a powerful desire to cultivate it?",
          "Without believing faith, we think 'Yeah, good idea' but don't really wish for it strongly.",
          "Go through the three types of faith: believing, admiring, wishing. Which is missing?"
        ]
      },
      {
        "title": "Obstacles to Bodhicitta: Effort (The Four Laziness)",
        "content": [
          "Laziness of discouragement: We don't feel we could change, or something is too high for us, or things haven't been going well.",
          "Laziness of procrastination: 'I'll do it later. I've got more important things to do right now. I've got to make cash.'",
          "Laziness of being attached to what's meaningless: 'I just like other stuff more than bodhicitta. I like TV more.'",
          "Laziness of indolence: Being attached to immobility, sleep, inactivity."
        ],
        "quote": "Ugh, I've got to generate bodhicitta. Ugh, it's getting in the way of all the fun things I'm doing as I lock myself into my little prison cell for millions more lives."
      },
      {
        "title": "The Distraction Trap",
        "content": [
          "Distraction makes all Dharma uninteresting. Our mind can't absorb long enough to taste the magic.",
          "In a distracted mindset, our mind becomes so agitated that the only escape seems like MORE distraction. It's self-reinforcing.",
          "We keep upping the dose until catastrophe. There's only one way that goes — down hard."
        ],
        "quote": "Sitting down to meditate is hanging out with a madman — just rapid, deluded thoughts. It's painful. So we escape into more distraction."
      },
      {
        "title": "Gold or Bodhicitta?",
        "content": [
          "If someone looked at the download of your thoughts for the day, would they say you're more interested in gold or bodhicitta?",
          "Tally up: How many thoughts were scheming to grow bodhicitta? How many were scheming to grow one of the eight worldly concerns?",
          "While gold is easily obtained, no amount of money can buy bodhicitta. The only way to obtain it is to develop it yourself through long meditation."
        ]
      }
    ],
    "mtb": {
      "title": "The Ten Benefits of Bodhichitta (9-10); Contemplating the Benefits",
      "content": [
        "If we are to engage in the actual development of bodhichitta we need strong inspiration, and this is only acquired by reflecting on the many benefits of this mind. If we knew of a king who had great wealth, power and knowledge we might easily think, 'How wonderful it would be to become like him!' Such a desire arises only because we have seen the good qualities that king possesses and therefore we wish to emulate him. Similarly, first we must understand the good qualities of bodhichitta and only then will the thought arise, 'How wonderful it would be to give birth to such a precious mind!'",
        "At present, however, if someone were to ask us which we would prefer, to develop bodhichitta or possess a nugget of gold, we would certainly choose the gold. This is because we see the valuable qualities of gold but fail to see the incomparable qualities and benefits of bodhichitta. If we understood these benefits our choice would be different. We would realize that while gold is easily obtained, no amount of money in the world can buy bodhichitta, something not found for sale anywhere. The only way to obtain the precious bodhichitta is to develop it ourself through long meditation.",
        "Until we develop a continuous and spontaneous aspiration to develop bodhichitta we should spend much time contemplating its benefits in general. From Shantideva's list of ten benefits we should select the one that has the strongest positive influence on our mind and meditate reflectively upon it. For such a meditation to be of greatest value it should be continuous and concentrated. Then at the close of the meditation session we should repeat the prayer originally cited in the introduction to this commentary:",
        "May the precious, supreme bodhichitta",
        "Grow where it has not yet grown;",
        "Where it has grown may it not decrease",
        "But flourish for evermore.",
        "By reciting this prayer we are stating our desire to give birth to bodhichitta as quickly as possible. We can recite this prayer after performing any virtuous action.",
        "We should remember that, without bodhichitta, whatever powers we may have and whatever miracles we may be able to perform are of no real benefit. Being able to fly in the sky is of no importance for even birds are able to do this. We have had such miracle powers and clairvoyance many times in our previous lives, but what have they done for us? Now is the time to control our untamed mind with bodhichitta. With bodhichitta the mind is made peaceful; enlightenment and the fulfilment of all our wishes are not very far away.",
        "It is important to remember that we cannot attain enlightenment if we do not first acquaint ourself with and then master the methods for developing bodhichitta. We must practise these methods as diligently as possible, all the while exhorting ourself to generate this precious attitude. Nowadays, with the world in turmoil, there is a particular need for us to cultivate bodhichitta. If we are to make it through these perilous times, true Bodhisattvas must appear everywhere, throughout the world.",
        "To develop bodhichitta we must complete four preparations. It is very important to know these because if we prepare well it is easy to develop bodhichitta. Thus we should (1) acquaint our mind with the benefits of bodhichitta, (2) accumulate a wealth of merit, (3) purify ourself of all non-virtue and (4) understand the method for developing bodhichitta. The last point will be discussed in the next section of this commentary."
      ]
    },
    "shantideva": {
      "title": "Chapter 1, Verses 15-25",
      "content": "(15) In brief, you should know\nThat bodhichitta has two types:\nThe mind that observes enlightenment and aspires,\nAnd the mind that observes enlightenment and engages.\n\n(16) Just as the distinction between wishing to go\nAnd actually going is understood,\nSo, respectively, the wise should understand\nThe difference between these two bodhichittas.\n\n(17) From the mind that aspires to enlightenment,\nGreat effects arise while in samsara;\nBut an uninterrupted flow of good fortune does not ensue\nAs it does from the engaging mind.\n\n(18) For whoever takes up the engaging mind of bodhichitta\nWith the intention never to turn back\nFrom completely liberating\nThe infinite living beings throughout all realms,\n\n(19) From that time forth, for him there will arise --\nEven if he is asleep or apparently unconcerned --\nVast and powerful merit, equal to space,\nThat flows without interruption.\n\n(20) For the sake of those with lesser inclinations,\nThese benefits were explained with logical reasons\nBy the Tathagata himself\nIn Sutra Requested by Subahu.\n\n(21) If even the thought to relieve\nThe headaches of others\nIs a beneficial intention\nThat results in infinite merit,\n\n(22) What can be said of the wish\nTo dispel the immeasurable misery\nOf each and every living being\nAnd lead them all to countless good qualities?\n\n(23) Does our father or mother\nHave such a beneficial intention as this?\nDo the gods or the sages?\nDoes even Brahma himself?\n\n(24) If, before generating bodhichitta, these living beings\nDo not even dream of such a mind\nFor their own sakes,\nHow will they develop it for the sake of others?\n\n(25) This mind to benefit living beings,\nWhich does not arise in others even for their own sakes,\nIs an extraordinary jewel of a mind,\nWhose birth is an unprecedented wonder."
    },
    "preview": {
      "title": "Recognizing Bodhichitta; The Divisions of Bodhichitta; Developing Equanimity",
      "content": [
        "RECOGNIZING BODHICHITTA",
        "This has three parts:",
        "1\tThe divisions of bodhichitta",
        "2\tThe benefits of the aspiring mind of bodhichitta",
        "3\tThe benefits of the engaging mind of bodhichitta",
        "THE DIVISIONS OF BODHICHITTA",
        "If our meditation on bodhichitta is to be successful we need to understand exactly what the essence of this mind is. As already stated, bodhichitta is a spontaneous and continuous state of mind that seeks enlightenment solely for the benefit of all sentient beings. Shantideva says [15] that this mind is of two types: aspiring bodhichitta and engaging bodhichitta. To understand the significance of and the distinctions between these two types of mind it is helpful to be familiar with the traditional methods of cultivating bodhichitta.",
        "Bodhichitta can be developed by following either of two methods: (1) the sevenfold cause and effect instructions, or (2) equalizing and exchanging self with others. The first method was originally taught by Buddha Shakyamuni and subsequently passed through Maitreya and Asanga in an unbroken lineage to such masters as Serlingpa and Atisha. The second method -- equalizing and exchanging self with others -- was designed specifically for those of sharp intelligence. It was also taught by Buddha Shakyamuni and passed through Manjushri in an unbroken lineage of Indian Masters to Shantideva himself. Both lineages have survived to the present day and are currently held by accomplished Teachers of all traditions of Mahayana Buddhism.",
        "Equalizing and exchanging self with others will be explained at length in the eighth chapter. What follows is an explanation of developing bodhichitta by means of meditating on the sevenfold cause and effect instructions. This method flourished widely throughout India and Tibet, and by studying it we will see that bodhichitta is not something that can be attained instantly, but rather is the result of a gradual training and development of the mind.",
        "The sevenfold cause and effect is a method involving the successive development of seven realizations, as follows:",
        "(1)\tRecognizing that all living beings are our mothers",
        "(2)\tRemembering the kindness of all mother beings",
        "(3)\tDeveloping the wish to repay the kindness of all mother beings",
        "(4)\tDeveloping affectionate love",
        "(5)\tDeveloping great compassion",
        "(6)\tDeveloping superior intention",
        "(7)\tDeveloping bodhichitta",
        "This method is called the 'sevenfold cause and effect' because these seven realizations are a chain of cause and effect leading to the final realization of bodhichitta. For example, the realization of affectionate love acts as a cause for developing great compassion.",
        "Before we begin our meditation on the sevenfold cause and effect it is helpful first of all to meditate on equanimity. At present our mind is unsettled and biased; instead of looking at all beings equally with the eye of compassion, we feel very close towards some and very distant from, or even hostile towards, others. In such an unbalanced state it is very difficult to recognize all beings as our mothers -- the first of the seven cause and effect realizations. Therefore, if our meditation is to be successful we must first try to remove our prejudices by cultivating an attitude of equanimity.",
        "Briefly outlined, the way to develop equanimity is as follows. First we should bring to mind three people we presently regard as our enemy, our friend and a stranger. Then we should ask ourself why we have categorized them in this way. Upon inspection we will find that the person we now call our enemy has received this label because of some harm -- great or small, mental or physical, real or imagined -- he or she has given us in the past. If we think back, however, we can often remember occasions when this same person treated us with much kindness. And if we could see into our past lives (as will be discussed later) we would undoubtedly discover instances in which this so-called enemy was our selflessly kind mother, feeding us with her own milk and protecting us from harm and fear. Even without considering any lifetime but the present, we can see how temporary and easily subject to change the status of an enemy really is. If tomorrow we were to receive some unexpected assistance, praise or merely a kind word from this person, would we still regard him or her as our foe?",
        "The same considerations can then be applied to the person we now call our dear friend. Although the sight, or even the mere thought, of him or her now elicits a warm feeling in our heart, this was not always the case. There were times, either earlier in this lifetime or in previous lives, when this dear friend or relative was our chief enemy and, as such, inflicted great suffering upon us. And it can easily happen that because of some slight difference of opinion, hasty word, or thoughtless act we suddenly find ourselves estranged from the same person to whom we are now so attached.",
        "In a similar fashion, the stranger has not always been the object of our indifference, nor will he or she always remain so. There have been times when this person -- so invisible to us now that we may scarcely be aware of his existence -- has been our murderous enemy, and other times when he has been our dearest friend and protector.",
        "By using examples from our own and others' experiences and employing various lines of logical reasoning, we can become convinced that it is extremely short-sighted and ultimately very mistaken to think that anyone is permanently or inherently a friend, enemy or stranger to us. And if this is the case -- if these three positions are so temporary and variable -- then who is the proper object of our attachment or hatred? If we feel justified in generating hatred towards our present enemy, then we should feel obliged to direct this hatred towards everyone, for sometime in the past we considered each person our enemy. And if it is correct to feel attached and biased towards our present friend because of some benefit we have received from him or her recently, then we should feel similarly towards everyone, because at one time or another everyone has been extremely kind to us, even to the point of being our mother.",
        "If we exert enough energy in meditation, acquainting ourself with the above reasons and examples and try to view people in an altered status, we will come to see how narrow-minded it is to be very close to some beings while remaining hostile or indifferent to others. Instead of assenting, as we do now, to a hard and fast classification of friend, enemy and stranger, and therefore being biased in our outlook, we can develop true equanimity -- the basis of the love and compassion necessary if we are to generate the precious bodhichitta and achieve enlightenment. As this is such an extremely worthwhile goal, we should not let our current prejudices go unexamined but expose them in the manner described."
      ]
    },
    "recording": "https://drive.google.com/file/d/1V8ivOuqnPga3Ixs0RfeJXOi8v-VIBPbc/view?usp=sharing"
  },
  {
    "id": "jan04",
    "date": "Jan 4",
    "year": "2026",
    "topic": "Equanimity",
    "practice": {
      "title": "Practice Equanimity",
      "steps": [
        "View people as avatars — behind every person is an infinite history, countless lives, unlimited potential. We have no idea what we're actually looking at.",
        "Make a list of people you view as 'enemies' and write three good things about each one, to grow your love for them.",
        "Play with what it's like to reduce self-interest, or even have zero self-interest — like making a beautiful cozy bed knowing you'll sleep in the street.",
        "Focus on people's very subtle mind (their Buddha nature) rather than their physical appearance — it makes everyone feel more equal.",
        "When grumbling about someone, throw away their body mentally and try to get mad at just their very subtle mind floating about. It's hard to stay angry."
      ],
      "quote": "Let's work on our equanimity in some of these different myriad ways."
    },
    "commentary": [
      {
        "title": "The Avatar Perspective",
        "content": [
          "When we look at someone, we're just seeing their 'avatar' — a tiny projection. Behind every person is an infinite history, countless lives, and unlimited potential. We have no idea what we're actually looking at.",
          "The possibilities are endless — you don't know what's going to come out of that person. Just be open to anything."
        ],
        "quote": "There's so much more, a whole universal, infinite number of beings behind what we're looking at."
      },
      {
        "title": "Our Biases Run Deep",
        "content": [
          "Most people, unless they've trained in perfect equanimity, have biases. We prefer certain kinds of people over others, even based on superficial things we're not proud of.",
          "Even as you walk down the street, notice: who do we like? Who do we not like? Who do we not care about? We're instantaneously preferring people and projecting prejudices onto people we know nothing about.",
          "What are the dividing lines your mind makes? Gender? Ethnicity? Class? Nationality? Religion? Behavior? Hobbies? We want to look at these because we're trying to become a Bodhisattva — a friend of the world."
        ],
        "quote": "It's like looking at the beautiful blue sky. You don't think that part of the blue sky is better than this part. You feel equal towards each. That's what we want to get to."
      },
      {
        "title": "Focus on the Very Subtle Mind",
        "content": [
          "One of the simplest things to help with equanimity: focus on people's very subtle mind — their root mind, their Buddha nature. That's people's real mind.",
          "When we get stuck in physicality, people seem quite different. But if we move past the physical — which is just a sheath, completely ephemeral, actually not related to that person at all — everyone starts to feel more equal.",
          "As Geshe-la says, if all our past bodies were piled together, they'd be greater than Mount Meru. The body has nothing to do with who that person really is."
        ],
        "quote": "Sometimes you can close your eyes, throw the body away, and try to get mad at their very subtle mind. Just a little mind floating about. It's hard to get mad at a mind."
      },
      {
        "title": "The Pointlessness of 'Enemy'",
        "content": [
          "The label 'enemy' only functions to disturb our mind. It's a completely purposeless label. The only enemies are delusions — no people are enemies.",
          "Often we call someone an enemy because we get something out of it — but it's something maladaptive. For example, a distraction from our own pain. It's much easier to blame others than to look at what's going on in our own mind.",
          "That's why people love obsessing over the news and how much they hate this person or that group. It's an incredibly effective way to escape from your own pain."
        ],
        "quote": "What am I getting out of calling someone an enemy? Whatever reason is going on there is completely maladaptive and unhealthy and only functions to harm us."
      },
      {
        "title": "You're Mad at Your Own Image",
        "content": [
          "When we think about someone we don't like, we're engaging with a generic image — a mental projection. The person isn't actually in our mind.",
          "It's like a 2D version, often a complete exaggeration. Maybe it's from 20 years ago — that person is gone. We're sitting there getting mad at our own image of the person.",
          "Since we're just getting mad at an image, why not create a different mental image? This isn't even the person themselves."
        ],
        "quote": "Often it's just propaganda — a completely warped view created in our mind."
      },
      {
        "title": "Condition-Dependent Views",
        "content": [
          "Ask yourself: would a single kind word from this 'enemy' change how I see them? If so, the category of 'enemy' is completely condition-dependent — it's not a stable truth.",
          "We want to develop views that are condition-independent — bedrocks of truth that can withstand any circumstance. Dharma views are designed to be like this.",
          "One of the beautiful things about Dharma: it becomes MORE true the worse things get. It's built on axioms like impermanence, inner peace being the real source of happiness, delusions always leading to suffering."
        ],
        "quote": "A lot of positive thinking falls apart when life falls apart. But the more life falls apart, the more Dharma becomes true."
      },
      {
        "title": "The Grocery Store Thought Experiment",
        "content": [
          "Imagine living the same few hours in a grocery store thousands of times, like Groundhog Day. At some point, you'd start talking to everyone. You'd discover something beautiful about each person.",
          "Inside each person there's a whole incredible never-ending universe. It's very strange that we just walk around in our little siloed universes.",
          "If we lived that grocery store day 5,000 times, we would become best friends with every person there. We'd learn something about them that we would admire."
        ],
        "quote": "Inside each person there's so much to be discovered. These views — 'you're this, you're that' — they're just short-sighted, superficial categories that come from not really knowing someone's heart."
      },
      {
        "title": "Love vs. Attachment: Where Does the Good Feeling Come From?",
        "content": [
          "Both love and attachment can produce a good feeling. You can't tell which is which by how someone 'makes you feel.'",
          "The simplest distinction: Love is 'I want you to be happy.' Attachment is 'I want you to make me happy.'",
          "If the good feeling comes from thinking 'I want you to be happy,' that's love. If it comes from thinking 'you are making me happy,' that's attachment."
        ],
        "quote": "Is the good feeling coming from within or from without? That's often the simplest way to think about it."
      }
    ],
    "mtb": {
      "title": "Recognizing Bodhichitta; The Divisions of Bodhichitta; Developing Equanimity",
      "content": [
        "RECOGNIZING BODHICHITTA",
        "This has three parts:",
        "1\tThe divisions of bodhichitta",
        "2\tThe benefits of the aspiring mind of bodhichitta",
        "3\tThe benefits of the engaging mind of bodhichitta",
        "THE DIVISIONS OF BODHICHITTA",
        "If our meditation on bodhichitta is to be successful we need to understand exactly what the essence of this mind is. As already stated, bodhichitta is a spontaneous and continuous state of mind that seeks enlightenment solely for the benefit of all sentient beings. Shantideva says [15] that this mind is of two types: aspiring bodhichitta and engaging bodhichitta. To understand the significance of and the distinctions between these two types of mind it is helpful to be familiar with the traditional methods of cultivating bodhichitta.",
        "Bodhichitta can be developed by following either of two methods: (1) the sevenfold cause and effect instructions, or (2) equalizing and exchanging self with others. The first method was originally taught by Buddha Shakyamuni and subsequently passed through Maitreya and Asanga in an unbroken lineage to such masters as Serlingpa and Atisha. The second method -- equalizing and exchanging self with others -- was designed specifically for those of sharp intelligence. It was also taught by Buddha Shakyamuni and passed through Manjushri in an unbroken lineage of Indian Masters to Shantideva himself. Both lineages have survived to the present day and are currently held by accomplished Teachers of all traditions of Mahayana Buddhism.",
        "Equalizing and exchanging self with others will be explained at length in the eighth chapter. What follows is an explanation of developing bodhichitta by means of meditating on the sevenfold cause and effect instructions. This method flourished widely throughout India and Tibet, and by studying it we will see that bodhichitta is not something that can be attained instantly, but rather is the result of a gradual training and development of the mind.",
        "The sevenfold cause and effect is a method involving the successive development of seven realizations, as follows:",
        "(1)\tRecognizing that all living beings are our mothers",
        "(2)\tRemembering the kindness of all mother beings",
        "(3)\tDeveloping the wish to repay the kindness of all mother beings",
        "(4)\tDeveloping affectionate love",
        "(5)\tDeveloping great compassion",
        "(6)\tDeveloping superior intention",
        "(7)\tDeveloping bodhichitta",
        "This method is called the 'sevenfold cause and effect' because these seven realizations are a chain of cause and effect leading to the final realization of bodhichitta. For example, the realization of affectionate love acts as a cause for developing great compassion.",
        "Before we begin our meditation on the sevenfold cause and effect it is helpful first of all to meditate on equanimity. At present our mind is unsettled and biased; instead of looking at all beings equally with the eye of compassion, we feel very close towards some and very distant from, or even hostile towards, others. In such an unbalanced state it is very difficult to recognize all beings as our mothers -- the first of the seven cause and effect realizations. Therefore, if our meditation is to be successful we must first try to remove our prejudices by cultivating an attitude of equanimity.",
        "Briefly outlined, the way to develop equanimity is as follows. First we should bring to mind three people we presently regard as our enemy, our friend and a stranger. Then we should ask ourself why we have categorized them in this way. Upon inspection we will find that the person we now call our enemy has received this label because of some harm -- great or small, mental or physical, real or imagined -- he or she has given us in the past. If we think back, however, we can often remember occasions when this same person treated us with much kindness. And if we could see into our past lives (as will be discussed later) we would undoubtedly discover instances in which this so-called enemy was our selflessly kind mother, feeding us with her own milk and protecting us from harm and fear. Even without considering any lifetime but the present, we can see how temporary and easily subject to change the status of an enemy really is. If tomorrow we were to receive some unexpected assistance, praise or merely a kind word from this person, would we still regard him or her as our foe?",
        "The same considerations can then be applied to the person we now call our dear friend. Although the sight, or even the mere thought, of him or her now elicits a warm feeling in our heart, this was not always the case. There were times, either earlier in this lifetime or in previous lives, when this dear friend or relative was our chief enemy and, as such, inflicted great suffering upon us. And it can easily happen that because of some slight difference of opinion, hasty word, or thoughtless act we suddenly find ourselves estranged from the same person to whom we are now so attached.",
        "In a similar fashion, the stranger has not always been the object of our indifference, nor will he or she always remain so. There have been times when this person -- so invisible to us now that we may scarcely be aware of his existence -- has been our murderous enemy, and other times when he has been our dearest friend and protector.",
        "By using examples from our own and others' experiences and employing various lines of logical reasoning, we can become convinced that it is extremely short-sighted and ultimately very mistaken to think that anyone is permanently or inherently a friend, enemy or stranger to us. And if this is the case -- if these three positions are so temporary and variable -- then who is the proper object of our attachment or hatred? If we feel justified in generating hatred towards our present enemy, then we should feel obliged to direct this hatred towards everyone, for sometime in the past we considered each person our enemy. And if it is correct to feel attached and biased towards our present friend because of some benefit we have received from him or her recently, then we should feel similarly towards everyone, because at one time or another everyone has been extremely kind to us, even to the point of being our mother.",
        "If we exert enough energy in meditation, acquainting ourself with the above reasons and examples and try to view people in an altered status, we will come to see how narrow-minded it is to be very close to some beings while remaining hostile or indifferent to others. Instead of assenting, as we do now, to a hard and fast classification of friend, enemy and stranger, and therefore being biased in our outlook, we can develop true equanimity -- the basis of the love and compassion necessary if we are to generate the precious bodhichitta and achieve enlightenment. As this is such an extremely worthwhile goal, we should not let our current prejudices go unexamined but expose them in the manner described."
      ]
    },
    "shantideva": {
      "title": "Chapter 1, Verses 15-25",
      "content": "(15) In brief, you should know\nThat bodhichitta has two types:\nThe mind that observes enlightenment and aspires,\nAnd the mind that observes enlightenment and engages.\n\n(16) Just as the distinction between wishing to go\nAnd actually going is understood,\nSo, respectively, the wise should understand\nThe difference between these two bodhichittas.\n\n(17) From the mind that aspires to enlightenment,\nGreat effects arise while in samsara;\nBut an uninterrupted flow of good fortune does not ensue\nAs it does from the engaging mind.\n\n(18) For whoever takes up the engaging mind of bodhichitta\nWith the intention never to turn back\nFrom completely liberating\nThe infinite living beings throughout all realms,\n\n(19) From that time forth, for him there will arise --\nEven if he is asleep or apparently unconcerned --\nVast and powerful merit, equal to space,\nThat flows without interruption.\n\n(20) For the sake of those with lesser inclinations,\nThese benefits were explained with logical reasons\nBy the Tathagata himself\nIn Sutra Requested by Subahu.\n\n(21) If even the thought to relieve\nThe headaches of others\nIs a beneficial intention\nThat results in infinite merit,\n\n(22) What can be said of the wish\nTo dispel the immeasurable misery\nOf each and every living being\nAnd lead them all to countless good qualities?\n\n(23) Does our father or mother\nHave such a beneficial intention as this?\nDo the gods or the sages?\nDoes even Brahma himself?\n\n(24) If, before generating bodhichitta, these living beings\nDo not even dream of such a mind\nFor their own sakes,\nHow will they develop it for the sake of others?\n\n(25) This mind to benefit living beings,\nWhich does not arise in others even for their own sakes,\nIs an extraordinary jewel of a mind,\nWhose birth is an unprecedented wonder."
    },
    "preview": {
      "title": "Recognizing That All Living Beings Are Our Mothers",
      "content": [
        "At this point a doubt may arise with respect to the meditation just described. It has been stated that the purpose of developing equanimity is to prepare us to recognize all beings as our mother. We may therefore wonder, 'If it is correct for me to regard all beings as my mother because they have supposedly been my mother in the past, then isn't it likewise correct for me to regard everyone as my enemy for the same reason?' To recognize the fallacy of this conclusion we must understand that whenever we have called anyone our enemy we have done so for basically unsound reasons and as the result of a mistaken view on our part. The habit of blaming our troubles and suffering on others -- on the so-called enemy -- is a deluded way of thinking, one that fails to realize that it is our own state of mind and not any external circumstance that is ultimately responsible for whatever misery we experience.",
        "At the root of our decision to regard someone as our enemy is a false projection of our mind, a mistaken conception of events. Forgetting such things as the kindness and parental nurturing this person has given us, and unaware of our own culpability for our suffering, we take the harm we receive from another as a valid justification for calling him or her our enemy and treating him with hostility. Although this is something we do all the time, it is in fact completely deluded and ultimately indefensible. On the other hand, as will be explained in the following section, there is nothing false or deluded about regarding all beings as our mother. This is true and verifiable, and not only opens the gateway for continued spiritual growth but provides us with an immediate experience of happiness and well-being.",
        "The goal of equanimity meditation is to remove all biased attitudes of mind and thereby to view all beings without discrimination as our mother. This in turn will motivate us to consider how we can repay their infinite kindness. If, as a result of this meditation, we are able to regard even our most hated enemy as our kind mother, we are ready to gain a realization of the first stage of the seven causes and effects leading to the development of bodhichitta.",
        "RECOGNIZING THAT ALL LIVING BEINGS ARE OUR MOTHERS",
        "Once we have developed an unbiased outlook towards all beings we are ready to view them all equally as having been our mother. This is the firm foundation upon which the supremely altruistic mind of bodhichitta depends. But how is it possible to recognize all beings as our mother? What are the reasons for believing we have shared the intimate mother-child relationship with everyone?",
        "To answer these questions, consider the following line of reasoning. The woman we presently recognize as our mother is such by virtue of our having been born into the world from her womb. Yet this is not the first and only time we have taken birth. The continuity of our consciousness stretches back over infinite time and the births we have taken have been countless. As we have been born countless times it follows that we have had countless mothers. Thus there is not a single being we meet who, over the incalculable expanse of beginningless time, has failed to be our mother. Despite the altered form and appearance of those we encounter, and the failings of our extremely limited memory, once we become convinced of the logic of the above line of reasoning there will be nothing to prevent us from viewing each being with the same warm recognition we now effortlessly extend to our present mother.",
        "Although the argument presented above is internally consistent, it is obvious that it will be completely lacking in persuasiveness if we do not come to understand and at least tentatively accept the existence of past and future lives. As long as we reject this possibility -- as long as we cling to the belief that our birth and death of this lifetime mark the outermost boundaries of our existence -- it will be utterly impossible for us to recognize all beings as our mother, except metaphorically. Many other important Dharma topics, such as the workings of cause and effect, also depend for their full understanding on a consideration of past and future lives. Therefore, although this topic may present particular difficulties to some people, especially in the modern world, it is very important that we try to keep an open mind and examine the issue with as few preconceptions as possible.",
        "The crux of the matter is our understanding of the nature of the mind, for it is through realizing that our mind is a formless continuum and that this continuum is beginningless that we will be able to understand the existence of previous lives. One way to meditate on this is as follows. We can look at our present stream of thoughts, perceptions and emotions -- all the factors we identify as being mental -- and trace it backwards to the mindstream of the previous moment, minute and hour. Then we can trace this mindstream even further backwards to yesterday, last week and last year. Depending upon the sharpness of our memory, we can trace this mindstream back year by year until we approach the time of our birth. Even if we can trace it back to our stay in the womb or the moment of conception, we can never point to a time and say, 'At this instant my mind came into being.'",
        "In fact, some people who do this backwards tracing meditation are able to go beyond the moment of conception and remember the mindstream existing at the end of a previous lifetime. However, as this experience is not shared by very many people (and is the object of many others' doubt) we cannot fairly use it as a proof that mind is a beginningless continuum. Rather, it is much more beneficial for us to gain a closer acquaintance with our own mind and question our own assumptions as to its nature and origin.",
        "To aid in this investigation, here are a few useful questions and observations to keep in mind. When we search for the source of our present body we eventually come to the combined sperm and ovum of our parents. Can this also be the source of our mindstream? If we answer yes, many difficulties arise. How do we account for the marked differences between our mind and those of our parents and siblings? If our mind is traceable to our parents' germ cells, what is the relation between these cells and our parents' minds? Is the mind something that can eventually be reduced to a physical cause or, being essentially formless, must it not have a non-physical cause of its own quite apart from the source of our physical body?",
        "Some people assert that the mind is a relatively blank slate at birth with but a few pre-natal impressions on it. They say that what we call the mind is merely the learned behaviour we acquire as we grow and develop. Is such a theory satisfactory? Does it take into account differences in temperament between people, differences that have been noted even in newborn infants of the same family? Does it account for the complexity of mental behaviour found in ordinary children, much less the unusual skills and aptitudes of exceptionally gifted youngsters?",
        "If we truly want to understand the nature of the mind and discover whether or not it is a beginningless continuum we must consider these questions carefully. It is a fact that most people, even the educated and those whose professions deal directly with mental phenomena, possess nothing more than a vague idea of what the mind is. If our own views are similarly indefinite -- if we do not have a coherent theory to explain the relationship between material form and non-material mind -- then it is not wise to reject out of hand a theory based on logic, observation, experience and the testimony of enlightened beings. At the very least we should remain open-minded and look at the issue impartially.",
        "According to Buddhist thought our stream of consciousness was present while we were a foetus. Going even further back to the moment of conception, this mindstream entered the embryonic cell formed by the union of our father's sperm and mother's ovum. Prior to this entry, this consciousness or mental continuum was the consciousness of a previous lifetime. Furthermore, the consciousness of that life arose from the one before that, and so on back into infinity. Even Buddha Shakyamuni's omniscient mind saw no beginning to this process. Therefore, if the continuity of mind is beginningless, we must have taken countless rebirths and therefore must have had countless mothers. Consequently there is not a single sentient being who has not at one time or another been our mother.",
        "If this is so why do we not intuitively recognize other beings as having been our mother? The reason is that the traumatic experiences of death and rebirth generally rob us of our memories of past lives. In addition, the way beings change form from one life to the next makes it difficult for us to recognize them. For example, if our present mother were to die and be reborn a dog, we would be completely unable to recognize her even if she eventually became our pet. Thus, despite appearances, we are presently surrounded by countless beings, who have each been our mother.",
        "It is important to remember that not all beings lack the ability to recall their previous existence. As a fruit of their meditative practices, in which the gross obscurations of the mind are progressively removed, many Yogis gain the ability to see their past lives. Even some ordinary people, especially young children, have memories of their past lives owing to especially clear imprints on their mind. The fact that most of us, however, do not have such memories is not so surprising. After all, even the obscurations of this lifetime and the general fogginess of our mind are enough to prevent us from remembering events from our early childhood, infancy and stay in the womb."
      ]
    },
    "recording": "https://drive.google.com/file/d/1tSrG4vHOCdzcOK-pvOwiwy_szGVPzs8T/view?usp=share_link"
  },
  {
    "id": "jan11",
    "date": "Jan 11",
    "year": "2026",
    "topic": "Traveler Practice",
    "practice": {
      "title": "I Am Like a Traveler",
      "steps": [
        "Meditate: 'I am like a traveler bound for future lives' — take a long-term view of your very subtle mind going endlessly into the future",
        "Watch how people switch categories: enemy to friend to stranger. If they can appear as all three, they're completely empty.",
        "Notice that restraint counts: Not gossiping, not snapping back — these are virtuous actions too. Celebrate them!",
        "Student practice: Use an 'enemy spreadsheet' — list people you have aversion toward, write 3 good things about each.",
        "Student practice: Track your mind with tokens — count 'meat' thoughts (this life only) vs 'heart' thoughts (future lives)."
      ],
      "quote": "We cast the characters, and then we get mad at the characters we cast."
    },
    "commentary": [
      {
        "title": "Casting Characters",
        "content": [
          "We cast the characters, and then we get mad at the characters we cast. It's incredibly freeing to see this.",
          "My mind created this image of an unpleasant person by paying attention to certain things and ignoring others. Now I'm marching around yelling at this person I created.",
          "Samsara can make us laugh or cry. Laughing at the absurdity, or crying at the horror. These situations are both."
        ],
        "quote": "I need to start reverse engineering some of these parts that I've cast."
      },
      {
        "title": "Seeing Categories Switch — Therefore Empty",
        "content": [
          "If they can appear as enemy, friend, and stranger to you — they're completely empty. If they were inherently any of those, they couldn't appear as the others.",
          "Everyone knows 'it's perspective.' But 'therefore it's empty' is the unusual insight. That's the breakthrough people don't get.",
          "Since they're empty, we might as well discriminate them in a more useful way — like as our mother, or as a Buddha."
        ]
      },
      {
        "title": "Moral Discipline of Restraint",
        "content": [
          "If you hold back from an action due to a spiritual view, that's a virtuous action. Notice these and rejoice in them!",
          "We didn't need to restrain ourselves. There were times in our life when we didn't. So really celebrate when we do.",
          "It only counts if we restrain due to a spiritual view — not wanting to create negative karma, wanting to cherish this person, etc."
        ],
        "quote": "Stopping negativity is a positive action."
      },
      {
        "title": "Beneficial Believing vs. Relativism",
        "content": [
          "Everything is empty, but things have a relative degree of validity. We figure out what to do based on the effect on our mind.",
          "Buddhism is NOT relativist ('we're all right, just different views') — that leads to nihilism, which leads to depression or hedonism.",
          "There are correct ways of thinking and wrong ways of thinking. It has to do with the function — does it reduce delusions and increase happiness?"
        ],
        "quote": "Regarding everyone as mother is true and verifiable, and provides immediate experience of happiness and well-being."
      },
      {
        "title": "The Levels of Affectionate Love",
        "content": [
          "Affectionate love has many levels — it's not monolithic. It's a category for a warm, close feeling that grows deeper as we go.",
          "Basic equanimity gives the lowest grade affectionate love. Viewing people as mother is higher. Viewing all beings as supreme goes even further.",
          "When we view someone as necessary for our spiritual development, we feel really warm toward them — 'I need you for my spiritual life.'"
        ]
      },
      {
        "title": "Student Share: The Enemy Spreadsheet",
        "content": [
          "One student made a Google spreadsheet listing everyone they had any aversion toward — not just anger, but avoidance mind.",
          "For each person, write 3 good things about them. Sometimes it's hard: 'They drink water.' But feel it and mean it.",
          "It took about 30 minutes but felt like a decade of spiritual work."
        ]
      },
      {
        "title": "Student Share: Steak and Heart Tracking",
        "content": [
          "A student tracked her mind with little steaks (concerned with present meat body) and hearts (working toward future lives).",
          "The samsaric thoughts are like a million little ones. But the thoughts about future lives are usually big and powerful.",
          "Surprising finding: many 'hearts' came from restraint — not saying the gossip, letting the grumpy person go."
        ]
      }
    ],
    "mtb": {
      "title": "Recognizing That All Living Beings Are Our Mothers",
      "content": [
        "At this point a doubt may arise with respect to the meditation just described. It has been stated that the purpose of developing equanimity is to prepare us to recognize all beings as our mother. We may therefore wonder, 'If it is correct for me to regard all beings as my mother because they have supposedly been my mother in the past, then isn't it likewise correct for me to regard everyone as my enemy for the same reason?' To recognize the fallacy of this conclusion we must understand that whenever we have called anyone our enemy we have done so for basically unsound reasons and as the result of a mistaken view on our part. The habit of blaming our troubles and suffering on others -- on the so-called enemy -- is a deluded way of thinking, one that fails to realize that it is our own state of mind and not any external circumstance that is ultimately responsible for whatever misery we experience.",
        "At the root of our decision to regard someone as our enemy is a false projection of our mind, a mistaken conception of events. Forgetting such things as the kindness and parental nurturing this person has given us, and unaware of our own culpability for our suffering, we take the harm we receive from another as a valid justification for calling him or her our enemy and treating him with hostility. Although this is something we do all the time, it is in fact completely deluded and ultimately indefensible. On the other hand, as will be explained in the following section, there is nothing false or deluded about regarding all beings as our mother. This is true and verifiable, and not only opens the gateway for continued spiritual growth but provides us with an immediate experience of happiness and well-being.",
        "The goal of equanimity meditation is to remove all biased attitudes of mind and thereby to view all beings without discrimination as our mother. This in turn will motivate us to consider how we can repay their infinite kindness. If, as a result of this meditation, we are able to regard even our most hated enemy as our kind mother, we are ready to gain a realization of the first stage of the seven causes and effects leading to the development of bodhichitta.",
        "RECOGNIZING THAT ALL LIVING BEINGS ARE OUR MOTHERS",
        "Once we have developed an unbiased outlook towards all beings we are ready to view them all equally as having been our mother. This is the firm foundation upon which the supremely altruistic mind of bodhichitta depends. But how is it possible to recognize all beings as our mother? What are the reasons for believing we have shared the intimate mother-child relationship with everyone?",
        "To answer these questions, consider the following line of reasoning. The woman we presently recognize as our mother is such by virtue of our having been born into the world from her womb. Yet this is not the first and only time we have taken birth. The continuity of our consciousness stretches back over infinite time and the births we have taken have been countless. As we have been born countless times it follows that we have had countless mothers. Thus there is not a single being we meet who, over the incalculable expanse of beginningless time, has failed to be our mother. Despite the altered form and appearance of those we encounter, and the failings of our extremely limited memory, once we become convinced of the logic of the above line of reasoning there will be nothing to prevent us from viewing each being with the same warm recognition we now effortlessly extend to our present mother.",
        "Although the argument presented above is internally consistent, it is obvious that it will be completely lacking in persuasiveness if we do not come to understand and at least tentatively accept the existence of past and future lives. As long as we reject this possibility -- as long as we cling to the belief that our birth and death of this lifetime mark the outermost boundaries of our existence -- it will be utterly impossible for us to recognize all beings as our mother, except metaphorically. Many other important Dharma topics, such as the workings of cause and effect, also depend for their full understanding on a consideration of past and future lives. Therefore, although this topic may present particular difficulties to some people, especially in the modern world, it is very important that we try to keep an open mind and examine the issue with as few preconceptions as possible.",
        "The crux of the matter is our understanding of the nature of the mind, for it is through realizing that our mind is a formless continuum and that this continuum is beginningless that we will be able to understand the existence of previous lives. One way to meditate on this is as follows. We can look at our present stream of thoughts, perceptions and emotions -- all the factors we identify as being mental -- and trace it backwards to the mindstream of the previous moment, minute and hour. Then we can trace this mindstream even further backwards to yesterday, last week and last year. Depending upon the sharpness of our memory, we can trace this mindstream back year by year until we approach the time of our birth. Even if we can trace it back to our stay in the womb or the moment of conception, we can never point to a time and say, 'At this instant my mind came into being.'",
        "In fact, some people who do this backwards tracing meditation are able to go beyond the moment of conception and remember the mindstream existing at the end of a previous lifetime. However, as this experience is not shared by very many people (and is the object of many others' doubt) we cannot fairly use it as a proof that mind is a beginningless continuum. Rather, it is much more beneficial for us to gain a closer acquaintance with our own mind and question our own assumptions as to its nature and origin.",
        "To aid in this investigation, here are a few useful questions and observations to keep in mind. When we search for the source of our present body we eventually come to the combined sperm and ovum of our parents. Can this also be the source of our mindstream? If we answer yes, many difficulties arise. How do we account for the marked differences between our mind and those of our parents and siblings? If our mind is traceable to our parents' germ cells, what is the relation between these cells and our parents' minds? Is the mind something that can eventually be reduced to a physical cause or, being essentially formless, must it not have a non-physical cause of its own quite apart from the source of our physical body?",
        "Some people assert that the mind is a relatively blank slate at birth with but a few pre-natal impressions on it. They say that what we call the mind is merely the learned behaviour we acquire as we grow and develop. Is such a theory satisfactory? Does it take into account differences in temperament between people, differences that have been noted even in newborn infants of the same family? Does it account for the complexity of mental behaviour found in ordinary children, much less the unusual skills and aptitudes of exceptionally gifted youngsters?",
        "If we truly want to understand the nature of the mind and discover whether or not it is a beginningless continuum we must consider these questions carefully. It is a fact that most people, even the educated and those whose professions deal directly with mental phenomena, possess nothing more than a vague idea of what the mind is. If our own views are similarly indefinite -- if we do not have a coherent theory to explain the relationship between material form and non-material mind -- then it is not wise to reject out of hand a theory based on logic, observation, experience and the testimony of enlightened beings. At the very least we should remain open-minded and look at the issue impartially.",
        "According to Buddhist thought our stream of consciousness was present while we were a foetus. Going even further back to the moment of conception, this mindstream entered the embryonic cell formed by the union of our father's sperm and mother's ovum. Prior to this entry, this consciousness or mental continuum was the consciousness of a previous lifetime. Furthermore, the consciousness of that life arose from the one before that, and so on back into infinity. Even Buddha Shakyamuni's omniscient mind saw no beginning to this process. Therefore, if the continuity of mind is beginningless, we must have taken countless rebirths and therefore must have had countless mothers. Consequently there is not a single sentient being who has not at one time or another been our mother.",
        "If this is so why do we not intuitively recognize other beings as having been our mother? The reason is that the traumatic experiences of death and rebirth generally rob us of our memories of past lives. In addition, the way beings change form from one life to the next makes it difficult for us to recognize them. For example, if our present mother were to die and be reborn a dog, we would be completely unable to recognize her even if she eventually became our pet. Thus, despite appearances, we are presently surrounded by countless beings, who have each been our mother.",
        "It is important to remember that not all beings lack the ability to recall their previous existence. As a fruit of their meditative practices, in which the gross obscurations of the mind are progressively removed, many Yogis gain the ability to see their past lives. Even some ordinary people, especially young children, have memories of their past lives owing to especially clear imprints on their mind. The fact that most of us, however, do not have such memories is not so surprising. After all, even the obscurations of this lifetime and the general fogginess of our mind are enough to prevent us from remembering events from our early childhood, infancy and stay in the womb."
      ]
    },
    "shantideva": {
      "title": "Chapter 1, Verses 15-25",
      "content": "(15) In brief, you should know\nThat bodhichitta has two types:\nThe mind that observes enlightenment and aspires,\nAnd the mind that observes enlightenment and engages.\n\n(16) Just as the distinction between wishing to go\nAnd actually going is understood,\nSo, respectively, the wise should understand\nThe difference between these two bodhichittas.\n\n(17) From the mind that aspires to enlightenment,\nGreat effects arise while in samsara;\nBut an uninterrupted flow of good fortune does not ensue\nAs it does from the engaging mind.\n\n(18) For whoever takes up the engaging mind of bodhichitta\nWith the intention never to turn back\nFrom completely liberating\nThe infinite living beings throughout all realms,\n\n(19) From that time forth, for him there will arise --\nEven if he is asleep or apparently unconcerned --\nVast and powerful merit, equal to space,\nThat flows without interruption.\n\n(20) For the sake of those with lesser inclinations,\nThese benefits were explained with logical reasons\nBy the Tathagata himself\nIn Sutra Requested by Subahu.\n\n(21) If even the thought to relieve\nThe headaches of others\nIs a beneficial intention\nThat results in infinite merit,\n\n(22) What can be said of the wish\nTo dispel the immeasurable misery\nOf each and every living being\nAnd lead them all to countless good qualities?\n\n(23) Does our father or mother\nHave such a beneficial intention as this?\nDo the gods or the sages?\nDoes even Brahma himself?\n\n(24) If, before generating bodhichitta, these living beings\nDo not even dream of such a mind\nFor their own sakes,\nHow will they develop it for the sake of others?\n\n(25) This mind to benefit living beings,\nWhich does not arise in others even for their own sakes,\nIs an extraordinary jewel of a mind,\nWhose birth is an unprecedented wonder."
    },
    "preview": {
      "title": "Remembering the Kindness; Developing the Wish to Repay",
      "content": [
        "Considering such lines of reasoning as presented above, and checking carefully to see if they are logical, non-contradictory, reasonable and applicable to our experience, is the process known as 'analytical meditation'. Arising from this process of examination is a conclusion, in this case a strong feeling that all beings have been our mother. The next step is to hold this feeling or conclusion by the power of our mindfulness, and remain upon it single-pointedly. This process is called 'placement meditation'. It is through the continual practice of placement meditation that true realizations dawn in our mind. When we become firm in the recognition that all sentient beings have been our mother, we have attained the realization of the first of the seven stages in the development of bodhichitta.",
        "REMEMBERING THE KINDNESS OF ALL LIVING BEINGS",
        "If all beings have been our mother, then how are we to recollect their kindness? Our present mother carried us in her womb for nine months. Whether sitting, walking, eating or even sleeping she was ever mindful of our presence. Her only thought was of our welfare and she regarded us as a precious gem. Even though our birth may have caused her intense pain she still thought solely of our welfare and happiness.",
        "As an infant we were little more than a helpless caterpillar, not knowing what was beneficial or harmful. Our mother cared for us and fed us her milk. When we were afraid she warmed us with the heat of her body and cuddled and comforted us in loving arms. She even wore soft clothing so as not to harm our sensitive skin.",
        "Wherever she went she took us with her. She washed and bathed us and cleaned the dirt from our nose. While playing with us she would sing sweet sounds and repeat our name with special tenderness. She protected us continually from the dangers of fire and accident; in fact if it were not for her constant care we would not be alive now. All that we have and enjoy is through the kindness of our mother. She rejoiced in our happiness and shared in our sorrow. Worrying about our slightest discomfort, she would have willingly surrendered even her own life in order that we might live. She taught us how to walk and talk, read and write, and underwent many hardships in order to give us a good education and the very best of whatever she possessed.",
        "Looking upon her child with tenderness, a mother cherishes it from conception until death with great devotion and unconditional love. Bringing to mind the limitless kindness of our present mother makes us realize the infinite loving care we have received from time without beginning from all the countless mothers who have nurtured us. How kind these sentient beings have all been!",
        "DEVELOPING THE WISH TO REPAY THE KINDNESS OF ALL MOTHER BEINGS",
        "Merely to remember the kindness of all mother sentient beings is not enough. Only the most callous and ungrateful would fail to see that it is our duty and responsibility to repay this kindness. This we can do by bestowing on others material gifts, pleasures or enjoyments and other temporary benefits. However, the supreme repayment for the infinite kindness we have received is to lead all beings to the unsurpassable happiness of full awakening."
      ]
    },
    "recording": "https://drive.google.com/file/d/13kp6l_jb7QP_wEM2yuDscSXp_byQtuVp/view?usp=share_link"
  },
  {
    "id": "jan18",
    "date": "Jan 18",
    "year": "2026",
    "topic": "Love in Action",
    "practice": {
      "title": "Do Everything with Love",
      "steps": [
        "Make decisions from a mind of love — stop trying to figure things out from self-grasping. Let love make the decision.",
        "Do all actions with love, or don't do them at all (Kadam Morten quote)",
        "Identify your 'target' — overthinking? Laziness? Anxiety-driven motivation? Taking yourself too seriously? Let love solve it.",
        "Look at what contaminated motive originally drew you to Dharma — wanting to feel special? Escapism? Loneliness? Gently examine it.",
        "Radically non-identify with your patterns — they're storms blowing through, not who you are"
      ],
      "quote": "What would it be like to 100% stop trying to figure out what's going on, and instead put all energy into getting a mind of love going — and then let that make the decision?"
    },
    "commentary": [
      {
        "title": "Being Guided by Love",
        "content": [
          "How often do we make a decision with an overt, intense love guiding us? Not just verbally ('may this benefit others') but really letting love compel us to action.",
          "It's like being possessed by something forcing you to act. Like seeing a toddler fall and you just can't help but run to help — something is guiding you, not intellectual, almost compelled.",
          "This is what changing our intention really means. Not verbalizing a good intention, but having something overt and powerful compelling us into action."
        ],
        "quote": "It's almost a sense that you're being possessed by something that's forcing you to do something."
      },
      {
        "title": "Love Solves Your Problems",
        "content": [
          "If you're an overthinker: Love makes the decision, you act wholeheartedly. The only reason we overthink is we're mired in a bog of delusions with awful options.",
          "If you're lazy and can't motivate yourself: Love provides almost limitless energy from a non-contaminated source.",
          "If you're anxiety-motivated (driven but by crippling anxiety): Love gives you drive without the contamination.",
          "If you take yourself too seriously: Love makes you light as a fairy — no egocentric mind weighing you down."
        ]
      },
      {
        "title": "The Arch Enemy Hug",
        "content": [
          "One student had a neighbor who said 'I have enough friends' 30 years ago. She hated her for decades.",
          "Recently, seeing her alone and struggling, she spontaneously hugged her. 'That was Buddha coming out in me.'",
          "Every time this happens, we prove to ourselves: I can shift how I view anyone. This arch enemy became someone I tenderly hugged."
        ],
        "quote": "I felt that was Buddha working through me."
      },
      {
        "title": "What Contaminated Motive Drew You to Dharma?",
        "content": [
          "Our mind is pervaded by delusions, so we don't get into Dharma for completely pure reasons. There are often other motives.",
          "Examples: wanting to feel special, escapism from pain you couldn't accept, loneliness seeking companionship, needing to control anxiety.",
          "Look at your practice: where does this motive show up? How much does it contaminate your practice? Use love to oppose it."
        ],
        "quote": "For me, it took a long time to realize: there's this contaminated motive to want to feel special. I've had it since I was a little kid."
      },
      {
        "title": "Radically Non-Identify with Patterns",
        "content": [
          "Modern psychology might say these drives are your psychological DNA, just who you are. Buddhism says: not true at all. It's just a karmic pattern, a storm blowing through.",
          "If we identify with these patterns, the whole thing feels awful — discovering this wretched, inalienable part of us. That's damaging.",
          "See them like weather patterns: you can be aware of them without identifying with them. Then you can respond and work with them without being afraid."
        ],
        "quote": "You don't identify with the storms in the sky, but you can be aware of a weather pattern."
      },
      {
        "title": "Who's Actually Running the Show?",
        "content": [
          "When we work with our mind, we learn the tools. But who's actually running the show of working with our mind? Often it's self-cherishing.",
          "Example: 'I'll use Dharma to not be hard on myself so I can cherish myself more.' That's self-protection, which is self-cherishing.",
          "When truly guided by love, we won't be hard on ourselves because there's almost no self appearing to even cherish. Love forgets the self."
        ]
      },
      {
        "title": "Student Share: The Traveler Mindset with Bodhicitta",
        "content": [
          "One student reflected on the 'traveler' mindset: Previously she used impermanence to dismiss things — 'don't get upset, you're just passing through.'",
          "But with bodhicitta applied, everything matters. It's not that things don't matter — it's that we need to learn how to use each moment.",
          "Without the mind of bodhicitta, even if we call ourselves Mahayana Buddhists, we're not really on the Mahayana path."
        ]
      }
    ],
    "mtb": {
      "title": "Remembering the Kindness of All Living Beings; Developing the Wish to Repay Their Kindness",
      "content": [
        "Considering such lines of reasoning as presented above, and checking carefully to see if they are logical, non-contradictory, reasonable and applicable to our experience, is the process known as 'analytical meditation'. Arising from this process of examination is a conclusion, in this case a strong feeling that all beings have been our mother. The next step is to hold this feeling or conclusion by the power of our mindfulness, and remain upon it single-pointedly. This process is called 'placement meditation'. It is through the continual practice of placement meditation that true realizations dawn in our mind. When we become firm in the recognition that all sentient beings have been our mother, we have attained the realization of the first of the seven stages in the development of bodhichitta.",
        "REMEMBERING THE KINDNESS OF ALL LIVING BEINGS",
        "If all beings have been our mother, then how are we to recollect their kindness? Our present mother carried us in her womb for nine months. Whether sitting, walking, eating or even sleeping she was ever mindful of our presence. Her only thought was of our welfare and she regarded us as a precious gem. Even though our birth may have caused her intense pain she still thought solely of our welfare and happiness.",
        "As an infant we were little more than a helpless caterpillar, not knowing what was beneficial or harmful. Our mother cared for us and fed us her milk. When we were afraid she warmed us with the heat of her body and cuddled and comforted us in loving arms. She even wore soft clothing so as not to harm our sensitive skin.",
        "Wherever she went she took us with her. She washed and bathed us and cleaned the dirt from our nose. While playing with us she would sing sweet sounds and repeat our name with special tenderness. She protected us continually from the dangers of fire and accident; in fact if it were not for her constant care we would not be alive now. All that we have and enjoy is through the kindness of our mother. She rejoiced in our happiness and shared in our sorrow. Worrying about our slightest discomfort, she would have willingly surrendered even her own life in order that we might live. She taught us how to walk and talk, read and write, and underwent many hardships in order to give us a good education and the very best of whatever she possessed.",
        "Looking upon her child with tenderness, a mother cherishes it from conception until death with great devotion and unconditional love. Bringing to mind the limitless kindness of our present mother makes us realize the infinite loving care we have received from time without beginning from all the countless mothers who have nurtured us. How kind these sentient beings have all been!",
        "DEVELOPING THE WISH TO REPAY THE KINDNESS OF ALL MOTHER BEINGS",
        "Merely to remember the kindness of all mother sentient beings is not enough. Only the most callous and ungrateful would fail to see that it is our duty and responsibility to repay this kindness. This we can do by bestowing on others material gifts, pleasures or enjoyments and other temporary benefits. However, the supreme repayment for the infinite kindness we have received is to lead all beings to the unsurpassable happiness of full awakening."
      ]
    },
    "shantideva": {
      "title": "Chapter 1 (continued)",
      "content": "(15) In brief, you should know\nThat bodhichitta has two types:\nThe mind that observes enlightenment and aspires,\nAnd the mind that observes enlightenment and engages.\n\n(16) Just as the distinction between wishing to go\nAnd actually going is understood,\nSo, respectively, the wise should understand\nThe difference between these two bodhichittas.\n\n(17) From the mind that aspires to enlightenment,\nGreat effects arise while in samsara;\nBut an uninterrupted flow of good fortune does not ensue\nAs it does from the engaging mind.\n\n(18) For whoever takes up the engaging mind of bodhichitta\nWith the intention never to turn back\nFrom completely liberating\nThe infinite living beings throughout all realms,\n\n(19) From that time forth, for him there will arise --\nEven if he is asleep or apparently unconcerned --\nVast and powerful merit, equal to space,\nThat flows without interruption.\n\n(20) For the sake of those with lesser inclinations,\nThese benefits were explained with logical reasons\nBy the Tathagata himself\nIn Sutra Requested by Subahu.\n\n(21) If even the thought to relieve\nThe headaches of others\nIs a beneficial intention\nThat results in infinite merit,\n\n(22) What can be said of the wish\nTo dispel the immeasurable misery\nOf each and every living being\nAnd lead them all to countless good qualities?\n\n(23) Does our father or mother\nHave such a beneficial intention as this?\nDo the gods or the sages?\nDoes even Brahma himself?\n\n(24) If, before generating bodhichitta, these living beings\nDo not even dream of such a mind\nFor their own sakes,\nHow will they develop it for the sake of others?\n\n(25) This mind to benefit living beings,\nWhich does not arise in others even for their own sakes,\nIs an extraordinary jewel of a mind,\nWhose birth is an unprecedented wonder."
    },
    "preview": {
      "title": "Developing Affectionate Love; Developing Great Compassion",
      "content": [
        "DEVELOPING AFFECTIONATE LOVE",
        "The next stage in the development of bodhichitta is to look upon all beings with affectionate love. This state of mind will arise naturally as a result of meditating for a long time on the three previous stages.",
        "In general, whenever we see our child, husband, wife or parents a heart-warming feeling of affection naturally arises within us and we hold them dear. But such affection does not arise when we see other sentient beings, especially those who disturb us. If we are to develop true bodhichitta this warm feeling must be extended to embrace everyone. If as a result of long and continual meditation our mind becomes accustomed to looking upon each being with affection and warmth, we have realized this fourth stage in the development of the mind of enlightenment.",
        "DEVELOPING GREAT COMPASSION",
        "Great compassion is the state of mind that wishes each and every being to be free from all suffering. If we have already developed affectionate, heart-warming love and have extended it towards all living beings, then when we meditate deeply on the suffering that others are now experiencing a feeling of great compassion will arise easily. Thus the primary cause of great compassion is our previous development of affectionate love.",
        "The mind of great compassion embraces all sentient beings without exception. At present we are unable to bear our own suffering because we cherish ourself so deeply. In addition we cannot bear to see the suffering of our parents, family and friends because we cherish them as well. However, when we see our enemies in pain we take delight in the knowledge that they are suffering. Why? Because we do not cherish them at all. It is this prejudiced mind that we must tame and transform. We do this by familiarizing ourself with the first four stages until we spontaneously look upon all beings as we do our kind mother. Then, by remembering their suffering and dissatisfaction, we will easily develop great compassion. The measure of this development is that when confronted by a former enemy the spontaneous wish arises that he or she be free from all misery. As has been said, until we have developed affectionate love for all others, we will be unable to develop this great compassion for them.",
        "There are two traditions regarding the development of affectionate love. That of such Indian Masters as Chandragomin and Chandrakirti states that affectionate love is the result of deepening the realization of the first three stages as explained above. According to the tradition of Shantideva, this heart-warming affection is developed mainly through the method of exchanging ourself with others, as will be explained later.",
        "As already mentioned, if we develop affectionate, heart-warming love for all beings and then focus in meditation on their suffering, we can develop the mind of great compassion, wishing them to be released from their misery. If we focus instead on their lack of pure happiness -- how they are deprived of true pleasures and joys -- then our affectionate love develops into what is known as 'wishing love'. This is the heartfelt wish that no sentient being is ever separated from happiness and its causes.",
        "DEVELOPING SUPERIOR INTENTION",
        "Upon the full realization of great compassion the thought will arise, 'I myself will undertake the task of liberating all beings from suffering; this is solely my duty and responsibility.' Assuming personal responsibility for the release of all sentient beings in this way is called 'superior intention'. This can be explained further by an example. If a child is drowning in a river, the onlookers will have the heartfelt wish that she be rescued. If the child's father sees this danger, however, he will not be satisfied with merely wishing her to be saved. Instead there will arise in him the strong intention to act to save his child. He will think, 'I myself will rescue her.' The mind of the onlookers is like great compassion, while the mind of the father is like superior intention.",
        "Someone who has developed this superior intention, although having the strong desire to act for the liberation of all sentient beings, soon realizes that he or she has no power to accomplish this aim. Like a father who is disabled and therefore cannot respond to his child's call for help, such a person is unable to fulfil this altruistic wish. A deep realization of this predicament -- the inability to act upon our wishes -- leads to the following intended result of this meditation.",
        "DEVELOPING BODHICHITTA",
        "Through contemplation and examination we will discover that only a completely perfect being who has awakened from the sleep of ignorance, a fully enlightened Buddha, has the complete power to liberate others from their suffering. The truth of this becomes clear when we think about the attributes a true liberator of others must have. Such a being would have to possess the four characteristics of an Awakened One:",
        "(1)\tFreedom from all obstructions preventing liberation and omniscience",
        "(2)\tGreat skill in liberating living beings from their suffering",
        "(3)\tCompassion for all living beings without discrimination",
        "(4)\tBenefiting all living beings whether or not they have helped him",
        "In this world we do not find any ordinary person who has such qualities. Any being who does have these four characteristics is what Buddhists refer to when they use the title 'Buddha'. In the past many people in eastern countries have earned this title by developing supreme qualities through meditation on the Mahayana path. It is my hope that in this present day many people throughout the world also may develop these precious qualities and likewise achieve Buddhahood.",
        "In conclusion, when the sixth realization, superior intention, has been developed and we subsequently recognize that only a Buddha endowed with the four above-mentioned qualities has the full power to fulfil this pure wish, we achieve the intended result of this meditation. In our mind arises the continuous thought to seek the full enlightenment of Buddhahood in order to benefit all mother sentient beings and remove them from suffering. This is the mind of enlightenment, bodhichitta, and anyone who develops it is called 'Bodhisattva'.",
        "As Shantideva stated in the previous verse, while there are many types of bodhichitta they are all contained within the following two aspects: the aspiring mind and the engaging, or venturing, mind. [16] These can be likened to the wish to go somewhere and the actual going. First the mind aspiring or wishing to go to the destination arises, and it continues to arise while the journey is being made. In a similar fashion, the aspiring mind of bodhichitta seeks to attain enlightenment for the benefit of all sentient beings, and it continues to arise until this goal is achieved. As for the engaging mind, it begins when the Bodhisattva vows have been received. It is at this point that we actually engage in the practices leading to enlightenment -- the six perfections and the other virtues.",
        "The two aspects of bodhichitta are stabilized within our mind by keeping the appropriate precepts and vows. First, in the presence of an actual Preceptor or the visualized assembly of Buddhas, we commit ourself to the aspiring mind. At this time we promise never to abandon this mind but to hold it firmly until enlightenment is reached. Then we take the following eight precepts to prevent this aspiring mind from degenerating in this life and in all future lives. For the sake of this life we vow:",
        "(1)\tTo remember the benefits of bodhichitta six times a day",
        "(2)\tTo generate bodhichitta six times a day",
        "(3)\tNot to abandon any living being",
        "(4)\tTo accumulate merit and wisdom",
        "As for the four precepts that prevent the aspiring mind from degenerating in future lives, we vow:",
        "(5)\tNot to cheat or deceive our Preceptors or Spiritual Guides",
        "(6) \tNot to criticize those who have entered the Mahayana",
        "(7)\tNot to cause others to regret their virtuous actions",
        "(8) \tNot to pretend to have good qualities or hide our faults without a special, pure intention",
        "When the aspiring mind has become firm and full of encouragement, the Bodhisattva naturally develops the wish to practise all the perfections, the pure deeds of a Bodhisattva. At this point the vows of the engaging mind are taken, again either in the presence of a Preceptor or before the visualized assembly of Buddhas. At this time we commit ourself to observing all the countless precepts contained within the practice of the six perfections. These six perfections will be explained later in this commentary, and the actual ceremony for taking the Bodhisattva vows will be explained in the third chapter.",
        "When the full set of Bodhisattva vows are taken the aspiring mind of bodhichitta becomes the engaging mind of bodhichitta. If all the precepts are kept purely, the Bodhisattva moves ever closer to the attainment of supreme enlightenment. However, if these precepts are disregarded, violated and abandoned, heavy negative consequences are incurred, removing our mind further from the goal. A full explanation of the eighteen root and forty-six secondary vows of a Bodhisattva can be found in Arya Asanga's The Bodhisattva's Grounds (Skt. Bodhisattvabhumi) and Je Tsongkhapa's The Main Path to Enlightenment (Tib. Jang chub shung lam), and in the book The Bodhisattva Vow."
      ]
    },
    "recording": "https://drive.google.com/file/d/1V_CCJv-rDCeXv23wLurq2loXiVMlzMkq/view?usp=share_link"
  }
]