{
  "title": "Guide to the Bodhisattva's Way of Life",
  "author": "Shantideva",
  "translator": "Gen-la Kelsang Thubten",
  "chapters": {
    "1": {
      "title": "An Explanation of the Benefits of Bodhichitta",
      "verses": {
        "1": "I prostrate to the enlightened Buddhas endowed with the Truth Body,\nAnd to the Bodhisattvas and all other objects of prostration.\nI will explain briefly, in accordance with the Scriptures,\nHow to engage in the condensed practices of the Bodhisattva.",
        "2": "There is nothing written here that has not been explained before,\nAnd I have no special skills in composition.\nMy reason for writing this is to benefit others\nAnd to keep my mind acquainted.",
        "3": "Thus, the strength of my faith and my virtuous realizations\nMight for a while be increased by this,\nAnd perhaps others who are as fortunate as I\nMight also find this meaningful to behold.",
        "4": "This precious human life, so hard to find,\nOffers the ultimate goal for living beings.\nIf we do not strive to accomplish this goal now,\nHow will such a precious opportunity arise again?",
        "5": "Just as on a dark and cloudy night\nA flash of lightning for a moment illuminates all,\nSo for the worldly, through the power of Buddha's blessings,\nA virtuous intention occasionally and briefly occurs.",
        "6": "Thus, while our virtues are mostly weak,\nOur non-virtues are extremely strong and fearsome.\nOther than bodhichitta \"“ a compassionate mind wishing for enlightenment \"“\nWhat virtue can overcome the heaviest evils?",
        "7": "The Able Ones, the Buddhas, who have considered this for many aeons,\nHave all seen bodhichitta to be the most beneficial\nBecause, through it, countless masses of living beings\nCan easily attain the supreme bliss of enlightenment.",
        "8": "Those who wish to destroy their own suffering,\nThose who wish to dispel the suffering of others,\nAnd those who wish to experience much happiness\nShould never forsake the practice of bodhichitta.",
        "9": "The moment bodhichitta is generated\nEven in pitiful beings bound within the prison of samsara,\nThey become Bodhisattvas \"“ a 'Son or Daughter of Buddha' \"“\nAnd are worthy of veneration by humans and worldly gods.",
        "10": "Just like the supreme elixir that transmutes into gold,\nBodhichitta can transform this impure body we have taken\nInto the priceless jewel of a Buddha's form.\nTherefore, firmly maintain bodhichitta.",
        "11": "Since the limitless wisdom of Buddha, the Sole Navigator of living beings,\nUpon thorough investigation has seen its preciousness,\nThose who wish to be free from samsara's suffering\nShould firmly maintain this precious mind of bodhichitta.",
        "12": "Whereas all other virtues are like plantain trees,\nIn that they are exhausted once they bear fruit,\nThe enduring celestial tree of bodhichitta\nIs not exhausted but increases by bearing fruit.",
        "13": "Just as when those who are greatly afraid rely upon a courageous one,\nWhoever relies upon bodhichitta will immediately be freed from danger\nEven if they have committed unbearable evils;\nSo why do the conscientious not rely upon it?",
        "14": "Just like the fire at the end of the aeon,\nIn an instant it completely consumes all great evil.\nIts countless benefits were explained by the wise Protector Maitreya\nTo Bodhisattva Sudhana.",
        "15": "In brief, you should know\nThat bodhichitta has two types:\nThe mind that observes enlightenment and aspires,\nAnd the mind that observes enlightenment and engages.",
        "16": "Just as the distinction between wishing to go\nAnd actually going is understood,\nSo, respectively, the wise should understand\nThe difference between these two bodhichittas.",
        "17": "From the mind that aspires to enlightenment,\nGreat effects arise while in samsara;\nBut an uninterrupted flow of good fortune does not ensue\nAs it does from the engaging mind.",
        "18": "For whoever takes up the engaging mind of bodhichitta\nWith the intention never to turn back\nFrom completely liberating\nThe infinite living beings throughout all realms,",
        "19": "From that time forth, for him there will arise \"“\nEven if he is asleep or apparently unconcerned \"“\nVast and powerful merit, equal to space,\nThat flows without interruption.",
        "20": "For the sake of those with lesser inclinations,\nThese benefits were explained with logical reasons\nBy the Tathagata himself\nIn Sutra Requested by Subahu.",
        "21": "If even the thought to relieve\nThe headaches of others\nIs a beneficial intention\nThat results in infinite merit,",
        "22": "What can be said of the wish\nTo dispel the immeasurable misery\nOf each and every living being\nAnd lead them all to countless good qualities?",
        "23": "Does our father or mother\nHave such a beneficial intention as this?\nDo the gods or the sages?\nDoes even Brahma himself?",
        "24": "If, before generating bodhichitta, these living beings\nDo not even dream of such a mind\nFor their own sakes,\nHow will they develop it for the sake of others?",
        "25": "This mind to benefit living beings,\nWhich does not arise in others even for their own sakes,\nIs an extraordinary jewel of a mind,\nWhose birth is an unprecedented wonder.",
        "26": "How can we possibly measure\nThe benefits of this jewel of a mind \"“\nThe source of joy for all living beings\nAnd the cure for all their sufferings?",
        "27": "If the mere intention to benefit others\nIs more meritorious than making offerings to the Buddhas,\nWhat can be said of actually striving\nFor the happiness of every single living being?",
        "28": "Although living beings wish to be free from suffering,\nThey run straight towards the causes of suffering;\nAnd although they wish for happiness,\nOut of ignorance they destroy it like a foe.",
        "29": "For those who are deprived of happiness\nAnd afflicted with many sorrows,\nBodhichitta bestows upon them boundless joy,\nEradicates all their suffering,",
        "30": "And even dispels their confusion.\nWhere is there virtue equal to this?\nWhere is there even such a friend?\nWhere is there merit such as this?",
        "31": "If even someone who repays a kindness\nIs worthy of some praise,\nWhat can be said of the Bodhisattva who helps others\nRegardless of whether or not they help him?",
        "32": "If someone regularly, or even just once,\nGives food in a disdainful manner,\nWhich satisfies a few beings for only half a day,\nPeople honour him or her as virtuous;",
        "33": "So what can be said of one who eternally gives\nTo countless living beings\nThe everlasting, unsurpassed bliss of the Sugatas,\nFulfilling all their wishes?",
        "34": "Buddha said that whoever generates an evil mind\nTowards a Bodhisattva, a supreme benefactor,\nWill remain in hell for as many aeons\nAs the moments for which that evil mind was generated;",
        "35": "But, for whoever generates a pure mind of faith,\nThe effects of good fortune will increase even more than that.\nEven when Bodhisattvas are faced with great adversity,\nNegativity does not arise; rather, their virtues naturally increase.",
        "36": "I prostrate to those who have generated\nThe holy, precious mind of bodhichitta;\nAnd I go for refuge to those sources of happiness\nWho bestow bliss even upon those who harm them.\nThis concludes the first chapter of Guide to the Bodhisattva's Way of Life, entitled 'An Explanation of the Benefits of Bodhichitta'."
      }
    },
    "2": {
      "title": "Purifying Negativity",
      "verses": {
        "1": "To maintain this precious mind of bodhichitta,\nI make excellent offerings to the oceans of good qualities \"“\nThe Buddhas, the stainless jewel of the holy Dharma,\nAnd the assembly of Bodhisattvas.",
        "2": "However many flowers and fruits there are,\nAnd all the different types of medicine;\nAll the jewels there are in the world,\nAnd all the pure, refreshing waters;",
        "3": "Mountains of jewels, forest groves,\nAnd quiet and joyful places;\nHeavenly trees adorned with flowers,\nAnd trees whose branches hang with delicious fruits;",
        "4": "Scents that come from the celestial realms,\nIncense, wish-granting trees and jewelled trees;\nHarvests that need no cultivation,\nAnd all ornaments that are suitable to be offered;",
        "5": "Lakes and pools adorned with lotuses,\nAnd the beautiful call of wild geese;\nEverything that is unowned\nThroughout all worlds as extensive as space \"“",
        "6": "Holding these in my mind, I offer them well\nTo the supreme beings, the Buddhas and Bodhisattvas.\nO Compassionate Ones, holy objects of offering,\nThink of me kindly and accept what I offer.",
        "7": "Lacking merit, I am destitute\nAnd have nothing else that I can offer;\nTherefore, O Protectors, who think of the welfare of others,\nPlease accept these for my sake.",
        "8": "Eternally I will offer all my bodies\nTo the Buddhas and Bodhisattvas.\nOut of respect, I will become your servant;\nPlease accept me, O Supreme Heroes.",
        "9": "Being completely under your care,\nI will benefit living beings with no fear of samsara.\nI will purify my previous evils\nAnd in future I will commit no more.",
        "10": "Within this sweetly scented bathing chamber\nWith a clear and glistening crystal floor,\nMajestic pillars ablaze with jewels,\nAnd canopies of radiant pearls spread aloft;",
        "11": "With many jewelled vases filled to the brim\nWith scented waters that steal the mind,\nAnd to the accompaniment of music and song,\nI offer ablution to the Buddhas and Bodhisattvas.",
        "12": "I dry their bodies with matchless cloths\nThat are immaculately clean and scented.\nThen I offer to the holy beings\nFragrant garments in magnificent colours.",
        "13": "With various excellent raiments, fine and smooth,\nAnd a multitude of supreme ornaments,\nI adorn Arya Samantabhadra,\nManjushri, Avalokiteshvara and all the others.",
        "14": "Just like polishing pure, refined gold,\nI anoint the radiant bodies of all the Able Ones\nWith supreme perfumes whose fragrance pervades\nEvery part of the three thousand worlds.",
        "15": "To the Able Ones, the supreme objects of offering,\nI offer all the beautiful, scented flowers \"“\nMandaras, upalas, lotuses and so forth \"“\nAnd exquisite garlands, finely arranged.",
        "16": "I offer them vast and fragrant clouds\nOf supreme incense that steal the mind;\nAnd I offer delicacies of the gods,\nTogether with a variety of food and drink.",
        "17": "I also offer jewelled lamps\nArranged on golden lotuses;\nAnd on polished ground sprinkled with scent\nAnd scattered with beautiful flower petals,",
        "18": "I offer to those with the nature of compassion\nA celestial palace resounding with heavenly praise\nAnd hung with beautiful pearls and jewelled ornaments\nWhose infinite radiance illuminates space.",
        "19": "Eternally I will offer to the Able Ones\nExquisite jewelled parasols held aloft,\nWith pleasing shapes, handles of gold,\nAnd rims embellished with beautiful ornaments.",
        "20": "In addition to these, may masses of offerings\nResounding with music and beautiful melodies\nRemain like so many clouds that send down relief\nTo suffering living beings.",
        "21": "And upon all the holy Dharma Jewels,\nThe stupas, and the images,\nMay there fall an uninterrupted rain\nOf flowers, jewels and so forth.",
        "22": "Just as Manjushri, Samantabhadra, and others\nMade offerings to the Conquerors,\nSo do I make offerings to the Sugatas, the Protectors,\nAnd to the Bodhisattvas.",
        "23": "To these oceans of good qualities,\nI offer a melodious ocean of praise.\nMay a chorus of sweet-sounding melodious verses\nAlways ascend to their presence.",
        "24": "To all the Buddhas abiding in the three times,\nThe Dharma and the Supreme Assembly,\nI prostrate with as many emanated bodies\nAs there are atoms in all the worlds.",
        "25": "I prostrate to the bases for generating bodhichitta,\nTo the images of Buddha's body, speech and mind,\nTo the Abbots and Preceptors,\nAnd to the supreme practitioners on the path.",
        "26": "Until I attain the essence of great enlightenment,\nI will go for refuge to the Buddhas;\nLikewise, I will go for refuge to Dharma\nAnd to the assembly of Bodhisattvas.",
        "27": "With my palms pressed together, I make requests\nTo those endowed with great compassion \"“\nThe perfect Buddhas and the Bodhisattvas,\nWho abide throughout the ten directions.",
        "28": "Since beginningless time in samsara,\nThroughout this and all my previous lives,\nOut of ignorance I have committed evil,\nOrdered it to be committed,",
        "29": "And, overwhelmed by deceptive ignorance,\nRejoiced in its being committed by others.\nSeeing all these to be grave mistakes,\nFrom the depths of my heart I confess them to the holy beings.",
        "30": "Whatever harmful actions of body, speech or mind\nI have done under the influence of delusion\nTowards the Three Precious Jewels,\nMy father and mother, my Spiritual Guide, and others \"“",
        "31": "All the extremely unbearable evil actions\nCommitted by me, an evil person\nPolluted by many faults \"“\nI confess before the Deliverers, the enlightened beings.",
        "32": "But I might die before I purify\nAll my negativities;\nO Please protect me so that I\nMay surely and swiftly be freed from them.",
        "33": "Since the untrustworthy Lord of Death\nWill not wait while I purify my evils,\nRegardless of whether I am sick or not,\nThis momentary life is unreliable.",
        "34": "I shall have to leave everything and depart alone\nBut, through failing to understand this,\nI have committed many kinds of evil action\nWith respect to my friends and others.",
        "35": "And yet my friends will become nothing\nAnd others will also become nothing.\nEven I shall become nothing;\nLikewise, everything will become nothing.",
        "36": "Just like an experience in a dream,\nEverything I now enjoy\nWill become a mere recollection,\nFor what has passed cannot be seen again.",
        "37": "Even during this brief life,\nMany friends and others have passed away;\nBut the unbearable results of the evil I have committed for their sake\nStill lie ahead of me.",
        "38": "Thus, through failing to realize\nThat I shall suddenly die,\nI have committed many evils\nOut of ignorance, attachment and anger.",
        "39": "Remaining still neither day nor night,\nThis life is continuously slipping away\nAnd never increases in duration;\nSo why should death not come to one such as me?",
        "40": "Even if, as I lie on my deathbed,\nI am surrounded by friends and relatives,\nI alone shall have to experience\nThe feeling of my life being severed.",
        "41": "Of what help will my companions be\nWhen I am seized by the messengers of the Lord of Death?\nAt that time, only merit will protect me,\nBut upon that I have not relied.",
        "42": "O Protectors, oblivious to dangers such as these,\nI, who am devoid of conscientiousness,\nHave committed many negative actions\nFor the sake of this transient life.",
        "43": "Terrified is the person who today is led away\nTo a place where his limbs will be torn from his body.\nWith a dry mouth and sunken eyes,\nHis appearance is completely distorted.",
        "44": "So what need is there to mention the terrible despair\nI shall experience when, stricken by great panic,\nI am seized by the physical apparitions\nOf the terrifying messengers of the Lord of Death?",
        "45": "'Who can grant me real protection\nFrom this great terror?'\nPetrified, with wide, bulging eyes,\nI shall search for refuge in all directions,",
        "46": "But, seeing no refuge anywhere,\nI shall become utterly dejected.\nIf I cannot find refuge there,\nWhat shall I do at that time?",
        "47": "Therefore, from today I go for refuge\nTo the Conqueror Buddhas who protect living beings,\nWho seek to give refuge to all living beings,\nAnd who, with their great strength, eradicate all fear.",
        "48": "Likewise, I sincerely go for refuge\nTo the Dharma they have realized,\nWhich dispels the fears of samsara,\nAnd to the assembly of Bodhisattvas.",
        "49": "Overcome with fear, I offer myself\nTo Arya Samantabhadra,\nAnd I offer my body into the service\nOf Arya Manjushri.",
        "50": "To Protector Avalokiteshvara,\nWho acts unerringly out of compassion,\nI utter this desperate cry for help:\n'O Please protect me, an evildoer!'",
        "51": "Seeking refuge, from my heart\nI pray to Arya Akashagarbha,\nTo Arya Ksitigarbha,\nAnd to all the compassionate Protectors.",
        "52": "I go for refuge to Arya Vajrapani,\nUpon sight of whom all harmful beings,\nSuch as the messengers of the Lord of Death,\nFlee in terror to the four directions.",
        "53": "Previously I transgressed your advice,\nBut now, having seen these great dangers,\nI go to you for refuge\nTo quickly dispel my fears.",
        "54": "If I need to follow the doctor's advice\nWhen frightened by an ordinary illness,\nHow much more necessary is it to follow Buddha's advice\nWhen perpetually afflicted by the many harmful diseases of the delusions?",
        "55": "If all the people living in this world\nCan be greatly harmed by just one of these delusions,\nAnd if no medicine other than Dharma\nCan be found anywhere to cure them,",
        "56": "Those who do not act in accordance with the Dharma teachings\nGiven by Buddha, the all-knowing physician,\nThrough which all pains of the delusions can be removed,\nAre surely foolish and confused.",
        "57": "If it is necessary to exercise caution\nWhen near a small, ordinary precipice,\nHow much more necessary is it when near the fathomless pits of hell\nInto which I could fall for a very long time?",
        "58": "It is unwise to indulge in pleasures,\nThinking, 'At least I shall not die today';\nFor without doubt the time will come\nWhen I shall become nothing.",
        "59": "Who will grant me fearlessness?\nHow can I be freed from these fears?\nIf I shall inevitably become nothing,\nHow can I continue to indulge?",
        "60": "What remains with me now from the pleasant experiences\nOf my previous lives that have now ceased?\nAnd yet, because of my strong attachment to worldly pleasures,\nI have gone against the advice of my Spiritual Guide.",
        "61": "If, when I depart from this life\nAnd from my friends and relatives,\nI must wander all alone,\nWhy commit non-virtue for the sake of friends and enemies?",
        "62": "'How can I definitely be freed\nFrom non-virtue, the source of all suffering?'\nThroughout the day and the night,\nI should think only about this.",
        "63": "Whatever I have done\nOut of unknowing and confusion \"“\nBe it a natural non-virtue\nOr a transgression \"“",
        "64": "With my palms pressed together\nAnd my mind fearful of suffering,\nProstrating myself again and again,\nI confess them all before the Protectors.",
        "65": "I request all the holy beings\nTo free me from all my evils and faults;\nAnd since these bring only harmful results,\nIn future I will not commit them again.\nThis concludes the second chapter of Guide to the Bodhisattva's Way of Life, entitled 'Purifying Negativity'."
      }
    },
    "3": {
      "title": "Generating Engaging Bodhichitta",
      "verses": {
        "1": "With great gladness I rejoice\nIn the virtues that protect living beings\nFrom the sufferings of the lower realms\nAnd lead all those who suffer to fortunate realms.",
        "2": "I rejoice in the accumulation of virtue\nThat releases living beings from samsaric rebirth\nAnd leads them to the state of nirvana \"“\nThe supreme, permanent inner peace.",
        "3": "I rejoice in the enlightenment of the Conqueror Buddhas\nAnd in the spiritual paths of the Bodhisattvas.",
        "4": "With delight I rejoice in the ocean of virtue\nThat arises from generating the mind of enlightenment, bodhichitta,\nWhich brings happiness to all living beings,\nAnd in the deeds that benefit those beings.",
        "5": "To the Buddhas residing in all directions,\nWith my palms pressed together I make this request:\nPlease continue to shine the lamp of Dharma\nFor living beings lost and suffering in the darkness of ignorance.",
        "6": "To the Conquerors who wish to enter parinirvana,\nWith my palms pressed together I make this request:\nPlease do not leave living beings in a state of blindness,\nBut remain with us for countless aeons.",
        "7": "Thus, through the merit I have collected\nFrom all these virtuous actions,\nMay the suffering of every living being\nBe brought completely to an end;",
        "8": "And until all those who are sick\nHave been cured of their illness,\nMay I become their medicine,\nTheir doctor and their nurse.",
        "9": "May a rain of food and drink descend\nTo dispel the miseries of hunger and thirst;\nAnd during the great aeon of famine,\nMay I become their food and drink.",
        "10": "May I become an inexhaustible treasury\nFor the poor and destitute.\nMay I be everything they might need,\nPlaced freely at their disposal.",
        "11": "From this moment on, without any sense of loss,\nI shall give away my body and likewise my wealth,\nAnd my virtues amassed throughout the three times\nTo help all living beings, my mothers.",
        "12": "Through giving all, I shall attain the nirvana of a Buddha\nAnd my bodhichitta wishes will be fulfilled.\nI give up everything for the sake of living beings,\nWho are the supreme objects of giving.",
        "13": "Since I have given up this body\nFor the happiness of living beings,\nIt will always be theirs to beat, to revile\nOr even to kill if they please.",
        "14": "Even if they play with it,\nMock it or humiliate it,\nSince I have given this body to others,\nWhat is the point of holding it dear?",
        "15": "Therefore, in whatever I do,\nI will never cause harm to others;\nAnd whenever anyone encounters me,\nMay it never be meaningless for them.",
        "16": "Whether those who encounter me\nGenerate faith or anger,\nMay it always be the cause\nOf their fulfilling all their wishes.",
        "17": "May all those who harm me \"“\nWhether verbally or by other means \"“\nAnd those who otherwise insult me\nThereby create the cause to attain enlightenment.",
        "18": "May I become a protector for the protectorless,\nA guide for those who travel on the road,\nAnd, for those who wish to cross the water,\nMay I become a boat, a ship or a bridge.",
        "19": "May I become an island for those seeking dry land,\nA lamp for those needing light,\nA place of rest for those who desire one,\nAnd a servant for those needing service.",
        "20": "To benefit all living beings,\nMay I become a treasury of wealth,\nPowerful mantras, potent medicine,\nA wish-fulfilling tree and a wish-granting cow.",
        "21": "Just like the great elements such as earth,\nAnd like eternal space,\nMay I become the basis from which everything arises\nFor sustaining the life of countless living beings;",
        "22": "And, until they have passed beyond sorrow,\nMay I sustain all forms of life\nThroughout the realms of living beings\nThat reach to the ends of space.",
        "23": "Just as all the previous Sugatas, the Buddhas,\nGenerated the mind of enlightenment, bodhichitta,\nAnd accomplished all the stages\nOf the Bodhisattva's training,",
        "24": "So will I too, for the sake of all beings,\nGenerate the mind of enlightenment\nAnd accomplish all the stages\nOf the Bodhisattva's training.",
        "25": "The wise who have sincerely taken up\nThe mind of enlightenment in this way,\nSo as to maintain it and increase it\nShould encourage themselves as follows.",
        "26": "Now my life has borne great fruit,\nMy human life has attained great meaning;\nToday I am born into the lineage of Buddha\nAnd have become a Bodhisattva.",
        "27": "All my actions from now on\nShall accord with this noble lineage;\nAnd upon this lineage, pure and faultless,\nI shall never bring disgrace.",
        "28": "Just as it is rare indeed\nFor a blind person to find a jewel in a heap of rubbish,\nSo too, by some very rare chance,\nI have generated bodhichitta.",
        "29": "It is the supreme nectar that overcomes\nThe dominion of death over living beings,\nAnd an inexhaustible treasury\nThat dispels all their poverty.",
        "30": "It is the supreme medicine that relieves\nThe sickness of living beings,\nAnd a shady tree that provides shelter\nFor weary beings travelling samsara's paths.",
        "31": "It is a universal bridge by which all living beings\nCan be delivered from the lower realms,\nAnd a rising moon of a mind\nThat relieves the torment of their delusions.",
        "32": "It is a vast sun that completely dispels\nThe fog of unknowing from living beings.\nIt is the quintessential butter that arises\nWhen the milk of Dharma is churned.",
        "33": "For the honoured guests, the beings on samsara's paths\nWho wish to enjoy the delights of bliss,\nBodhichitta will satisfy them all\nBy leading them to the supreme state of bliss.",
        "34": "Today, in the presence of all the Protectors,\nI invite all living beings to be my guests\nTo enjoy these temporary and ultimate delights.\nMay gods, demi-gods and everyone else be joyful!\nThis concludes the third chapter of Guide to the Bodhisattva's Way of Life, entitled 'Generating Engaging Bodhichitta'."
      }
    },
    "4": {
      "title": "Relying upon Conscientiousness",
      "verses": {
        "1": "A practitioner who has firmly generated\nAspiring and engaging bodhichitta in this way\nShould always apply effort without wavering\nSo as not to stray from the trainings.",
        "2": "If an ordinary action is undertaken in haste\nOr without being well thought out,\nIt might be appropriate to reconsider,\nEven if a promise has been made;",
        "3": "But how could I possibly turn back\nFrom something that has been examined\nBy the wisdom of the Buddhas and Bodhisattvas,\nAnd that I too have repeatedly examined?",
        "4": "If, having made the bodhichitta promise,\nI do not actually put it into practice,\nSince I shall be deceiving all these living beings,\nWhat sort of rebirth shall I then take?",
        "5": "It is said that someone who, out of miserliness,\nDoes not give even the smallest ordinary thing\nThat he or she has dedicated to others\nWill be reborn as a hungry spirit.",
        "6": "So, if I were to deceive all living beings,\nWhom from the depths of my heart I have invited\nTo be guests at the banquet of enlightenment,\nHow could I take a fortunate rebirth in the future?",
        "7": "How someone who abandons bodhichitta\nCan then attain liberation\nIs beyond ordinary comprehension \"“\nOnly the omniscient can know that.",
        "8": "For a Bodhisattva, abandoning bodhichitta\nIs the heaviest of all downfalls\nFor, should he or she incur it,\nThe whole basis of working for others will be lost.",
        "9": "And if someone else were to obstruct or hinder\nA Bodhisattva's virtuous actions, even for a moment,\nSince he would be undermining the welfare of all living beings,\nThere would be no end to his lower rebirths.",
        "10": "For if I would experience misfortune\nAs a result of destroying the happiness of just one being,\nWhat can be said of the consequences of destroying\nThe happiness of all living beings as extensive as space?",
        "11": "Those who repeatedly renew their Bodhisattva vow\nOnly to go on to incur further downfalls\nWill remain for a long time enmeshed in samsara,\nObstructed from attaining higher spiritual grounds.",
        "12": "Therefore, I must practise sincerely,\nIn accordance with the promise I have made.\nIf, from now on, I make no effort,\nI shall be reborn in lower and lower states.",
        "13": "Even though there have been countless Buddhas in the past\nWorking to benefit all living beings,\nBecause I have so many karmic obstacles\nI have not been a direct object of their care;",
        "14": "And, if I remain like this,\nAgain and again I shall have to experience\nSickness, incarceration, laceration,\nAnd mutilation in the lower realms.",
        "15": "Since the appearance of a Tathagata \"“ a Buddha,\nFaith in his teachings, a precious human body,\nAnd a suitable basis for practising Dharma are so rare,\nWhen will an opportunity like this arise again?",
        "16": "Today, for example, I might be free from sickness,\nWell-nourished and without afflictions;\nBut this life is fleeting and deceptive,\nAnd my body is as if borrowed for a moment.",
        "17": "If I engage in non-virtuous actions,\nI shall not obtain a human body again;\nAnd if I do not attain a human form,\nThere will be no virtue, only negativity.",
        "18": "If I do not practise virtue now\nWhile I have the good fortune to do so,\nWhat virtue shall I be able to practise\nWhen I am suffering and confused in the lower realms?",
        "19": "For if I do not practise virtue\nBut accumulate only evil,\nI shall not even hear the words 'fortunate rebirth'\nFor a hundred million aeons.",
        "20": "It is for these reasons that Buddha, the Blessed One, said\nThat it is extremely difficult to obtain a precious human life;\nJust as it is rare for a turtle to insert its neck\nInto a yoke adrift on a vast ocean.",
        "21": "Since just one moment of evil\nCan lead to an aeon in the deepest hell,\nIf I do not purify all the evil I have collected since beginningless time,\nIt goes without saying that I shall not take a human rebirth.",
        "22": "Simply experiencing the effects of my non-virtue\nWill not lead to my being released from the lower realms,\nFor, while I am experiencing those effects,\nI shall be generating yet more non-virtue.",
        "23": "If, having found the freedom and endowment of a human life,\nI do not strive to practise Dharma,\nThere can be no greater self-deception,\nThere can be no greater folly.",
        "24": "Having understood this,\nIf out of ignorance I remain indolent,\nThen, when the time comes for me to die,\nI shall be choked with unimaginable terror.",
        "25": "If my body will burn for a very long time\nIn the unbearable fires of hell,\nThen, without doubt, my mind will be consumed\nBy the raging fires of regret.",
        "26": "Having found, by some very slight chance,\nThis beneficial state, so rare to find,\nIf, while I am endowed with such good fortune,\nI am once again led to the hells,",
        "27": "It is as if I am confused by a spell\nAnd my mind has been reduced to nothing!\nEven I do not know what causes this confusion \"“\nWhat is it that dwells within me?",
        "28": "The inner enemies of hatred, attachment and so forth\nDo not have arms and legs,\nNor do they have courage or skill;\nSo how have they made me their slave?",
        "29": "While they remain within my mind,\nThey harm me at their pleasure,\nAnd yet, without anger, I patiently endure them.\nHow shameful! This is no occasion for patience.",
        "30": "If all living beings, including the gods and demi-gods,\nWere to rise up against me as one enemy,\nThey could not lead me to the fires of the deepest hell\nAnd throw me in;",
        "31": "But this powerful enemy of the delusions\nIn an instant can cast me into that fiery place\nWhere even the ashes of Mount Meru\nWould be consumed without a trace.",
        "32": "No other type of enemy\nCan remain for as long a time\nAs can the enduring foes of my delusions,\nFor they have no beginning and no apparent end.",
        "33": "If I agree with external enemies and honour them,\nThey will eventually bring me benefit and happiness;\nBut if I entrust myself to delusions,\nIn the future they will bring me only more pain and suffering.",
        "34": "So how can I remain in samsara joyfully and without fear\nWhile I readily reserve a place in my heart\nFor this interminable enemy of long duration\nThat alone is the cause of increasing all my suffering?",
        "35": "How can I ever be happy\nWhile these guardians of the prison of samsara\nThat torture and torment me in the hells and elsewhere\nDwell like a net of iron in my mind?",
        "36": "Out of anger, worldly people who are filled with pride will not sleep\nUntil they have destroyed those who cause them even the slightest temporary harm.\nIn the same way, I will not abandon my efforts\nUntil this inner foe of mine is directly and definitely destroyed.",
        "37": "If those who engage in violent battles,\nStrongly wishing to destroy deluded beings who must suffer death anyway,\nDisregard the pain of being wounded by weapons\nAnd do not withdraw until they have accomplished their aim,",
        "38": "Then it goes without saying that, even if I have to endure great hardships,\nFrom now on I should not be indolent or faint-hearted\nIn striving once and for all to destroy this natural foe\nThat is the constant source of all my suffering.",
        "39": "If scars inflicted by enemies for no great reason\nAre displayed on the body like ornaments,\nWhy should I not be prepared to endure hardships\nIn striving sincerely to accomplish the great purpose?",
        "40": "If fishermen, hunters and farmers,\nWho think only of their own livelihood,\nEndure such sufferings as heat and cold,\nWhy can I not forbear hardships for the sake of the happiness of all?",
        "41": "If I myself am not free from delusions\nWhen I promise all living beings\nAbiding in the ten directions throughout space\nThat I will liberate them from their delusions,",
        "42": "Is it not foolish of me to say such things\nWhile disregarding my own shortcomings?\nThis being so, I must never turn back\nFrom destroying my own delusions.",
        "43": "This will be my main objective:\nBearing a strong grudge, to do battle with my delusions.\nAlthough such a grudge appears to be a delusion,\nBecause it destroys delusions it is not.",
        "44": "It would be better for me to be burned to death\nOr to have my head cut off\nThan to ever allow myself\nTo come under the influence of delusions.",
        "45": "An ordinary enemy who is expelled from a country\nWill go to another and remain there,\nOnly to return when he has regained his strength;\nBut the enemy of the delusions is not like that.",
        "46": "O delusions, delusions, where will you go\nWhen banished by the eye of wisdom and expelled from my mind?\nAnd from where will you return to harm me again?\nBut, being weak-minded, I am reduced to making no effort!",
        "47": "The delusions are not in the objects, in the sense powers, between them, or elsewhere;\nSo from where can they cause harm to all living beings?\nBecause they are just like illusions, I should banish fear from my heart and strive to attain wisdom.\nWhy bring the sufferings of hell and so forth upon myself for no reason?",
        "48": "Therefore, having considered this well,\nI will strive sincerely to practise these precepts as they have been explained.\nIf a sick person does not listen to the doctor's advice,\nHow can he expect to be cured?\nThis concludes the fourth chapter of Guide to the Bodhisattva's Way of Life, entitled 'Relying upon Conscientiousness'."
      }
    },
    "5": {
      "title": "Guarding the Mind with Alertness",
      "verses": {
        "1": "Those who wish to make progress in the trainings\nShould be very attentive in guarding their minds,\nFor, if they do not practise guarding the mind,\nThey will not be able to complete the trainings.",
        "2": "A crazy, untamed elephant in this world\nCannot inflict such harm\nAs the sufferings of the deepest hell\nCaused by the rampaging elephant of the mind;",
        "3": "But if the elephant of our mind\nIs bound tightly on all sides by the rope of mindfulness,\nAll fears will cease to exist\nAnd all virtues will fall into our hands.",
        "4": "Tigers, lions, elephants, bears,\nSnakes, all kinds of enemy,\nGuardians of the beings in hell,\nEvil spirits and cannibals \"“",
        "5": "These will all be bound\nSimply by binding the mind,\nAnd will all be subdued\nSimply by subduing the mind.",
        "6": "Buddha, the Able One, says,\n'Thus, all fears\nAnd all infinite sufferings\nArise from the mind.'",
        "7": "Who purposely creates the weapons\nThat harm the beings in the hells?\nWho creates the blazing iron ground?\nFrom where do the tempting hallucinations arise?",
        "8": "The Able One says that all such things\nCome only from evil minds.\nThus, there is nothing to fear within the three worlds\nThat has not come from the mind.",
        "9": "If completing the perfection of giving\nWere eliminating the poverty of living beings,\nSince hungry beings still exist,\nHow could the previous Buddhas have completed that perfection?",
        "10": "The completion of the perfection of giving is said to be\nThe thought wishing to give everything to all living beings,\nTogether with the merit that results from that giving;\nTherefore, it depends only on mind.",
        "11": "The killing of fish and other creatures\nHas not been eradicated anywhere,\nFor completing the perfection of moral discipline is said to be\nAttaining a mind that has abandoned non-virtue.",
        "12": "It is not possible to subdue unruly beings\nWho are as extensive as space;\nBut simply destroying the mind of anger\nIs the same as overcoming all these foes.",
        "13": "Where is there enough leather\nTo cover the surface of the Earth?\nBut just having leather on the soles of one's feet\nIs the same as covering the whole Earth.",
        "14": "In the same way, it is not possible\nTo control all external events;\nBut, if I simply control my mind,\nWhat need is there to control other things?",
        "15": "Rebirth as a first form realm god and so on, the highest level of mundane happiness,\nWhich results from the mental action of clear concentration of the actual absorption* of the form or formless realms,\nDoes not come from actions of body or speech\nBut from actions of mind.\n* The two absorptions \"“ the absorption of close preparation and the actual absorption \"“ can be understood from the book Ocean of Nectar.",
        "16": "Buddha, the All Knowing One, has said\nThat reciting mantras and prayers, and enduring spiritual hardships,\nEven for a long time,\nAre to no avail if the mind is distracted elsewhere.",
        "17": "Even those who wish to find happiness and avoid suffering\nWill wander without meaning or purpose\nIf they do not practise training the mind,\nThe supreme and principal Dharma.",
        "18": "Therefore, I will guard my mind well\nAnd protect it from what is inappropriate.\nWithout the discipline of guarding the mind,\nWhat is the use of many other disciplines?",
        "19": "Just as I would be careful of a wound\nWhen in a jostling and unruly crowd,\nSo should I always guard the wound of my mind\nWhen among those who might provoke delusions.",
        "20": "If I am careful of a physical wound\nOut of fear of even the slightest pain,\nWhy do I not protect the wound of my mind\nOut of fear of being crushed by the mountains of hell?",
        "21": "If I always practise in this way,\nThen, whether I am among harmful beings\nOr with people I find attractive,\nNeither my steadfastness nor my vows will decline.",
        "22": "I can accept losing my wealth and reputation,\nOr even my livelihood or my body,\nAnd I can even accept my other virtues degenerating;\nBut I can never allow my practice of guarding the mind to decline.",
        "23": "With my palms pressed together,\nI beseech those who wish to guard their minds:\nAlways put effort into guarding\nBoth mindfulness and alertness.",
        "24": "Just as people who are troubled by sickness\nHave no strength for any kind of physical work,\nSo those whose minds are disturbed by confusion\nHave no strength for any kind of virtuous action.",
        "25": "Moreover, for those whose minds lack alertness,\nThe wisdoms from listening, contemplating and meditating\nWill not be retained by their memory\nAny more than water will remain in a leaky pot.",
        "26": "Even those who have much learning and faith\nAnd who have sincerely applied great effort\nWill become defiled by moral downfalls\nThrough the fault of lacking alertness.",
        "27": "If I lack alertness, the thieves of the delusions\nWill cause my mindfulness to degenerate,\nAnd then steal even the merit I have so diligently gathered\nSo that I shall fall into the lower realms.",
        "28": "These legions of thieves of the delusions\nAre just waiting for an opportunity\nAnd, when one arises, they will steal my wealth of virtue\nAnd destroy any chance of a fortunate rebirth.",
        "29": "Therefore, I will not allow my mindfulness\nTo stray from the doorway of my mind;\nAnd, if I notice it is about to leave,\nI will restore it by recalling the sufferings of the lower realms.",
        "30": "Fortunate ones who follow the instructions they receive,\nMaintain respect for their Spiritual Guide\nAnd generate fear of the lower realms\nCan easily develop and maintain mindfulness.",
        "31": "'I am always in the presence\nOf the Buddhas and Bodhisattvas\nWho, with their omniscient gaze,\nSee everything without obstruction.'",
        "32": "By thinking in this way, we can maintain\nSense of shame, respect and fear,\nAnd repeatedly bring to mind\nThe good qualities of the Buddhas.",
        "33": "When mindfulness is maintained\nWith the purpose of guarding the mind,\nAlertness will naturally arise\nAnd even that which was lost will return.",
        "34": "First, I should check to see how my mind is;\nAnd, if I see it is polluted with negativity,\nI should remain unmoving,\nWith a mind as impassive as wood.",
        "35": "I should never look around\nOut of distraction or for no purpose,\nBut always, with a resolute mind,\nBe mindful of my gaze.",
        "36": "From time to time, to relax my gaze,\nI should look around without distraction;\nAnd if someone appears in my field of vision,\nI should acknowledge them and greet them.",
        "37": "To avoid dangers or accidents on the path,\nI should occasionally look in all directions,\nAnd prevent my mind from becoming distracted\nBy relying upon conscientiousness.",
        "38": "I should practise in the same way\nWhenever I go or return.\nUnderstanding the need to behave like this,\nI should apply this practice in all situations.",
        "39": "I should prepare for any activity by thinking,\n'My body and mind must remain correctly composed';\nAnd from time to time check carefully to see\nWhat I am actually doing and thinking.",
        "40": "With all my effort, I should regularly check\nThat the unsubdued elephant of my mind\nHas not broken free but remains bound\nTo the great pillar of thinking about Dharma.",
        "41": "Striving for concentration by whatever means,\nI should not let my mind wander for even a moment\nBut closely examine it by asking,\n'How is my mind behaving?'",
        "42": "It is said there are times, when practising giving, that one can be judicious\nIn applying some of the finer points of moral discipline.\nWhen there is danger or a special celebration,\nOne can perform actions suitable for that occasion.",
        "43": "I should undertake what I intend and have decided to do,\nWithout being distracted by other things;\nAnd, with my thoughts focused on that practice,\nFor now, I should do just that.",
        "44": "In this way, I shall do everything well;\nOtherwise, I shall accomplish neither one thing nor the other.\nWith this skilful practice, there can be no increase\nIn secondary delusions, such as non-alertness.",
        "45": "Whenever I listen to any sort of talk,\nWhether pleasant or unpleasant,\nOr observe attractive or unattractive people,\nI should prevent attachment or hatred towards them.",
        "46": "If for no reason I begin to perform actions\nThat cause damage to the environment,\nI should recall Buddha's advice\nAnd, out of respect, stop straightaway.",
        "47": "Whenever I wish to move my body\nOr to utter any words,\nI should first examine my mind\nAnd then steadfastly act in an appropriate way.",
        "48": "Whenever there arises in my mind\nThe desire to become attached or angry,\nI should not do or say anything\nBut remain as impassive as wood.",
        "49": "Whenever I am pretentious, mocking,\nArrogant or self-important;\nWhenever I develop the intention to speak of others' faults,\nOr think of profiteering or deceiving;",
        "50": "Or whenever I start to solicit praise,\nDeprecate others,\nOr use harmful or divisive speech,\nI should remain as impassive as wood.",
        "51": "Whenever I desire wealth, honour or fame,\nOr the attentions of a circle of admirers;\nOr whenever my mind wishes for veneration,\nI should remain as impassive as wood.",
        "52": "If I develop a mind wishing to say something,\nWhile neglecting others' welfare\nAnd pursuing only my own,\nI should remain as impassive as wood.",
        "53": "If I am ever impatient with suffering, or lazy and fearful of virtue;\nIf I am about to speak recklessly or disparagingly;\nOr if attachment to my circle of acquaintances arises,\nI should remain as impassive as wood.",
        "54": "Thus, having checked thoroughly for delusions\nAnd minds that are drawn to meaningless things,\nCourageous practitioners should hold their mind steady\nThrough applying the appropriate opponents.",
        "55": "With complete certainty, strong faith,\nSteadfastness, respect, politeness,\nSense of shame, fearfulness, and inner peace,\nI should strive to bring joy to others.",
        "56": "I should not become disheartened by the behaviour of others \"“\nThe childish, who are in disharmony with one another \"“\nBut understand how this behaviour arises through the force of delusions\nAnd be compassionate towards them.",
        "57": "I should engage only in virtuous actions\nTo benefit living beings, with no thought for myself;\nAnd I should do so with the understanding that I am like an illusion\nThat does not exist from its own side.",
        "58": "Contemplating again and again\nThat I have attained this special freedom after a very long time,\nI should hold as unmoveable as Mount Meru\nThe intention to accomplish the real meaning of a human life.",
        "59": "If, mind, you are concerned\nAbout death taking this body from you\nAnd its being burned or buried beneath the ground,\nWhy do you cherish it so now?",
        "60": "Why, mind, do you hold this body as 'mine'\nAnd grasp it with such affection?\nIt is only borrowed from others\nAnd will soon be taken from you.",
        "61": "Why, confused mind,\nDo you not hold onto a clean wooden form?\nWhat is the use of grasping at this putrid machine\nThat is only a collection of impurities?",
        "62": "Begin by mentally separating\nThe layers of skin from the flesh.\nThen, with the blade of wisdom,\nCut the flesh away from the bones.",
        "63": "Break open even the bones\nAnd look right down to the marrow.\nMake your own investigation \"“\n'Where is its essence?'",
        "64": "If you do not find any essence there\nEven when you search with such effort,\nWhy, mind, do you still grasp this body\nWith so much attachment?",
        "65": "It is so impure, it is not even fit to eat,\nIts blood is not fit to drink\nAnd its intestines are not fit to suck;\nSo what use is this body to you?",
        "66": "It is suitable to protect it and care for it\nOnly for attaining spiritual goals \"“\nThis body of a human being\nShould be used just for practising Dharma.",
        "67": "But if you guard it for other purposes,\nWhat will you be able to do\nWhen the merciless Lord of Death seizes it\nAnd reduces it to a pile of ashes?",
        "68": "A servant is not rewarded with clothes and the like\nIf he does no work;\nSo why do you insist on nourishing this collection of flesh and bone\nWhen, even when fed, its loyalties lie elsewhere?",
        "69": "In exchange for paying my body its wages,\nI will employ it to create virtue for myself and others;\nBut I should not grasp it as 'mine'\nBecause such grasping is a form of ignorance.",
        "70": "I will regard my body as a boat \"“\nA basis for coming and going \"“\nAnd to accomplish the welfare of all living beings\nI will transform my body into an enlightened wishfulfilling jewel.",
        "71": "While I have control,\nI should always display a smiling face\nAnd, forsaking frowns and angry looks,\nBe friendly and honest towards others.",
        "72": "I should not behave in ways that disturb others,\nSuch as moving furniture noisily\nOr opening and closing doors loudly,\nBut always delight in humility.",
        "73": "Just as a stork, a cat or a thief\nAccomplish their aims with skill and patience,\nSo should I accomplish my spiritual goal\nOf attaining the state of enlightenment.",
        "74": "When others offer wise advice or admonishment\nThat, though unsolicited, is nevertheless beneficial,\nI should accept it graciously and with respect,\nAnd always be willing to learn from it.",
        "75": "To anyone who speaks the truth,\nI should say, 'You have spoken well';\nAnd whenever I see others perform meritorious actions,\nI should offer praise and develop genuine joy.",
        "76": "I should discreetly describe others' good qualities\nAnd pass on any I hear about,\nBut, should my own good qualities be mentioned,\nI should simply acknowledge any I might have, without pride.",
        "77": "I should perform all actions for others' happiness.\nThis good quality is precious and rare,\nAnd through it I shall enjoy the pure happiness and joy\nThat arises from actions that benefit others.",
        "78": "If I do this, I shall suffer no loss in this life\nAnd in future lives I shall experience great happiness;\nBut, if I do the opposite,\nI shall experience misery and pain in life after life.",
        "79": "I should speak truthfully, coherently and to the point,\nMaking my meaning clear in a pleasant manner.\nI should speak gently and in moderation,\nWithout a selfish motivation.",
        "80": "Whenever I see other beings,\nI should think, 'I can attain enlightenment\nIn dependence upon these living beings!'\nAnd cherish them sincerely.",
        "81": "With either a cultivated motivation\nOr one that arises spontaneously,\nI should always sow seeds of great virtue\nIn the fields of holy beings and living beings.",
        "82": "I should perform all my Dharma activities\nWith skill, clear understanding and strong faith,\nSo that others will increase their wisdom\nAnd experience immeasurable benefit.",
        "83": "Although in general the perfections of giving and so forth\nAre progressively higher than those that precede them,\nI should not forsake great virtues for the sake of small ones.\nPrincipally, I should consider the benefit to others.",
        "84": "Buddha, the compassionate Far-Seeing One,\nAllows Bodhisattvas to perform certain actions that are otherwise proscribed.\nUnderstanding this well, I should always put effort\nInto my practice of the Bodhisattva's way of life.",
        "85": "I should share my food with animals,\nPeople who are hungry and practitioners,\nAnd eat merely what I need.\nOrdained people can give everything except their three robes.",
        "86": "Because I use this body to practise bodhichitta,\nI should not harm it for the sake of temporary benefits,\nBut care for it so that I may fulfil my bodhichitta wish,\nSo that eventually all living beings' wishes will be fulfilled.",
        "87": "Those who lack pure compassion and wisdom\nShould not actually give away their body\nBut, instead, devote it to accomplishing\nThe great purpose of this and future lives.",
        "88": "I should listen to Dharma\nWith respect and a good heart,\nRecognizing it as the supreme medicine\nFor curing the pains of anger and attachment.",
        "89": "I should teach the vast and profound Dharma with a pure intention,\nFree from any wish to acquire wealth or reputation;\nAnd I should always maintain a pure motivation of bodhichitta\nAnd make great effort to put Dharma into practice.",
        "90": "I should explain Dharma to release those who are listening\nFrom samsara, the cycle of suffering,\nAnd to lead them to the ultimate goal \"“\nThe attainment of full enlightenment.",
        "91": "I should keep places clean and not throw litter\nBut dispose of it correctly.\nMoreover, I should not defile\nWater or land used by others.",
        "92": "I should not eat with my mouth full,\nNoisily or with my mouth open.\nI should not sit with my legs outstretched,\nNor rub my hands together meaninglessly.",
        "93": "I should not sit alone with another's partner\nIn a vehicle, on a bed or in the same room.\nI should observe and enquire about what offends people\nAnd then avoid such actions.",
        "94": "To show someone the way,\nI should not point with just one finger\nBut respectfully use my right hand\nWith all the fingers extended.",
        "95": "I should not wave my arms around in an uncontrolled manner,\nBut communicate with slight movements\nAnd appropriate gestures;\nOtherwise, I shall lose my composure.",
        "96": "To sleep, I should lie in the appropriate position \"“\nJust as Protector Buddha lay when he entered parinirvana \"“\nAnd before falling asleep, with alertness,\nMake a definite decision to rise quickly.",
        "97": "Within the limitless practices\nTaught as the Bodhisattva's way of life,\nI should start by emphasizing\nThese practices that train the mind.",
        "98": "I should practise the Sutra of the Three Heaps\nThree times each day and three times each night,\nAnd, with reliance on the Three Jewels and bodhichitta,\nPurify non-virtues and downfalls.",
        "99": "Whatever I do in any situation,\nWhether for myself or for the benefit of others,\nI should strive to practise\nWhatever training has been taught for that occasion.",
        "100": "For a Bodhisattva, there is no teaching of Buddha\nThat he or she should not practise.\nIf I become skilled in this way of life,\nNothing I do will lack merit.",
        "101": "Whether directly or indirectly,\nI should never do anything that is not for the sake of living beings.\nI should dedicate everything\nSolely to the enlightenment of all living beings.",
        "102": "Never, even at the cost of my life,\nShould I abandon my Spiritual Guide,\nWho is skilled in the meaning of the Mahayana\nAnd a supreme practitioner of the Bodhisattva trainings.",
        "103": "I should train in relying upon the Spiritual Guide\nIn the manner explained in the Biography of Shri Sambhava.\nI can understand this and other advice given by Buddha\nFrom studying the Mahayana Sutras.",
        "104": "I should read these Sutras\nBecause they reveal the Bodhisattva trainings.\nFirst, it is important to study\nAkashagarbha Sutra.",
        "105": "Also, it is important to read again and again\nThe Compendium of Trainings\nBecause it extensively reveals\nWhat is to be practised all the time.",
        "106": "Moreover, sometimes one should read\nThe Condensed Compendium of Sutras;\nAnd with great effort, one should also study\nThe same two titles by Superior Nagarjuna.",
        "107": "In summary, since I generated engaging bodhichitta and took the Bodhisattva vow,\nI should practise all the precepts mentioned above,\nSo that others' pure view, mind of faith and good intention\nWill be increased by my example.",
        "108": "The defining characteristic of guarding alertness\nIs to examine again and again\nThe state of our body, speech and mind,\nAnd to understand whether our actions are correct or not.",
        "109": "We need to put Buddha's teachings, the Dharma, into practice\nBecause nothing can be accomplished just by reading words.\nA sick man will never be cured of his illness\nThrough merely reading medical instructions!\nThis concludes the fifth chapter of Guide to the Bodhisattva's Way of Life, entitled 'Guarding the Mind with Alertness'."
      }
    },
    "6": {
      "title": "Relying upon Patience",
      "verses": {
        "1": "All the virtuous deeds and merit,\nSuch as giving and making offerings,\nThat we have accumulated over thousands of aeons\nCan be destroyed by just one moment of anger.",
        "2": "There is no evil greater than anger,\nAnd no virtue greater than patience.\nTherefore, I should strive in various ways\nTo become familiar with the practice of patience.",
        "3": "If I harbour painful thoughts of anger,\nI shall not experience mental peace,\nI shall find no joy or happiness,\nAnd I shall be unsettled and unable to sleep.",
        "4": "Overcome by a fit of anger,\nI might even kill a benefactor\nUpon whose kindness I depend\nFor my wealth or reputation.",
        "5": "Anger causes friends and relatives to grow weary of me\nAnd, even if I try to attract them with generosity, they will not trust me.\nIn short, there is no one\nWho can live happily with anger.",
        "6": "Although the enemy of anger\nCreates sufferings such as these,\nWhoever works hard to overcome it\nWill find only happiness in this and future lives.",
        "7": "Through having to do what I do not want to do\nOr being prevented from doing what I want to do,\nI develop mental unhappiness, which becomes the fuel\nThat causes anger to grow and destroy me.",
        "8": "Therefore, I should never allow this fuel of mental unhappiness\nThat causes anger to grow within my mind,\nFor this enemy of anger has no function\nOther than to harm me.",
        "9": "I will not allow anything that happens to me\nTo disturb my mental peace.\nIf I become unhappy, I shall be unable to fulfil my spiritual wishes\nAnd my practice of virtue will decline.",
        "10": "If something can be remedied\nWhy be unhappy about it?\nAnd if there is no remedy for it,\nThere is still no point in being unhappy.",
        "11": "People do not want suffering, criticism,\nHarsh words or anything unpleasant\nFor themselves or for their friends;\nBut for their enemies it is the opposite!",
        "12": "In samsara, the causes of happiness rarely occur,\nWhereas the causes of suffering are innumerable.\nWithout suffering, there would be no renunciation;\nTherefore, mind, you should remain firm.",
        "13": "If some ascetics and the people of Karnapa\nCan endure the pain of burns and cuts for no great purpose,\nWhy can I not endure hardships\nFor the sake of liberating everyone from their suffering?",
        "14": "There is nothing that is not easy to accomplish\nIf we develop familiarity with it;\nSo first I should learn to forbear small sufferings\nAnd then gradually endure greater ones.",
        "15": "This can be seen in those who voluntarily endure minor sufferings,\nSuch as animal or insect bites,\nFeelings of hunger or thirst,\nOr irritations of the skin.",
        "16": "I should not become impatient\nWith heat and cold, wind and rain,\nOr sickness, confinement or beatings;\nFor, if I do, the pain will only increase.",
        "17": "Some, when they see their own blood,\nBecome even stronger and braver;\nWhile for others, just seeing someone else's blood\nCauses them to become weak and even to faint!",
        "18": "Both these reactions depend on the mind \"“\nWhether it is strong or it is weak \"“\nSo I should disregard any harm that befalls me\nAnd not allow myself to be affected by suffering.",
        "19": "Whenever I experience hardship,\nI should fight my delusions, such as anger;\nAnd whenever I experience physical pain,\nI should use wisdom to maintain a pure and peaceful mind.",
        "20": "Those who disregard all suffering\nTo destroy the foes of anger and so forth\nAre the true conquerors worthy of the name 'hero';\nOther so-called heroes merely slay corpses.",
        "21": "Moreover, suffering has many good qualities.\nThrough experiencing it, we can dispel pride,\nDevelop compassion for those trapped in samsara,\nAbandon non-virtue and delight in virtue.",
        "22": "I do not become angry when the cause of suffering\nIs something inanimate, such as sickness;\nSo why become angry with animate causes,\nFor they too are all controlled by other conditions?",
        "23": "Although it is not wished for in the least,\nSickness nevertheless occurs.\nIn the same way, even though they are not wanted,\nDelusions such as anger forcibly arise.",
        "24": "People do not think, 'I will get angry',\nThey just get angry;\nAnd anger does not think, 'I will arise',\nIt just arises.",
        "25": "All the shortcomings there are,\nAnd all the various non-virtues,\nArise through the force of other conditions \"“\nThey do not govern themselves.",
        "26": "The assembled conditions have no thought\nTo produce a suffering result;\nNor does the resultant suffering think,\n'I was produced from conditions.'",
        "27": "Neither that which is asserted as the 'independent creator of all'\nNor that which is asserted as the 'independent permanent self'\nCan come into being through intentionally thinking,\n'Now I will arise.'",
        "28": "If the independent creator itself is not produced,\nThen how can it produce anything?\nIf the self were permanent, then it would follow\nThat experiences cannot be changed from unpleasant to pleasant.",
        "29": "Clearly, if the self were permanent,\nThen, just like space, it could not perform any actions;\nAnd, even if it could meet with other conditions,\nIt would still be unable to do anything.",
        "30": "Since, even when acted upon, it would remain as it was,\nWhat effect could an action have on it?\nIf you say that something else affects the self,\nWhat relationship could the self have with that?",
        "31": "Thus, all effects arise from other conditions,\nWhich in turn depend upon previous conditions.\nTherefore, all things are like illusions \"“ they are not independent.\nIf we realize this, we shall not become angry with anything.",
        "32": "'If all things were like illusions, who would restrain what?\nSurely, any restraint would be inappropriate.'\nOn the contrary, it is precisely because things lack inherent existence\nThat it is possible to assert that the continuum of suffering can be cut.",
        "33": "Thus, whenever an enemy, or even a friend,\nCommits an inappropriate action,\nSuch behaviour arises from other conditions.\nRealizing this, I should remain with a happy mind.",
        "34": "If things occurred independently, out of choice,\nThen, since no one wishes to suffer,\nHow would suffering ever arise\nFor any living being?",
        "35": "Some misguided people inflict harm upon themselves\nBy lying on thorns and the like;\nWhile others, obsessed with finding a partner,\nDeprive themselves of food.",
        "36": "Then there are those who inflict harm on themselves\nThrough non-meritorious actions,\nSuch as hanging themselves, leaping from cliffs,\nSwallowing poison or eating bad food.",
        "37": "Although they cherish themselves more than anything else,\nIf, under the influence of delusions, people are capable even of killing themselves,\nWhy should I be surprised when they inflict harm\nOn other living beings such as me?",
        "38": "When those who, under the influence of delusions,\nSet out to harm or even to kill me,\nIf I cannot develop compassion for them,\nAt the very least I should refrain from getting angry.",
        "39": "If it were the very nature of a childish person\nTo inflict harm on others,\nIt would be no more reasonable to get angry with him\nThan it would be to resent fire for burning us.",
        "40": "On the other hand, if that harmfulness were a temporary fault\nAnd that person were otherwise good-natured,\nIt would be just as unreasonable to get angry with him\nAs it would be to resent space for filling with smoke.",
        "41": "If someone were to harm us with a stick or other weapon,\nWe would normally become angry with the person;\nBut, since his intent is governed by anger,\nIt is really towards that anger that we should direct our wrath.",
        "42": "In such situations, we should think,\n'In the past, I harmed others in a similar manner.\nTherefore, it is fitting that I, who caused harm to others,\nShould now be experiencing such harm myself.'",
        "43": "The physical suffering I experience\nIs caused by both the stick and my body;\nBut, since the stick comes from my assailant and the body from me,\nWith which of these should I get angry?",
        "44": "Blinded by craving and ignorance,\nI have taken this form, the basis of human suffering,\nWhich can hardly bear to be touched;\nSo with whom should I get angry when it is hurt?",
        "45": "Although we childish beings have no wish for suffering,\nWe are greatly attached to its causes.\nThus, the harm we receive is entirely our fault;\nWhat reason is there to blame it on others?",
        "46": "Just as with the guardians of hell,\nThe forest of razor-sharp leaves and so forth,\nMy sufferings in this life result from my actions \"“\nSo with whom should I be angry?",
        "47": "Although those who harm me\nAre provoked into doing so by my own karma,\nIt is they who will take rebirth in hell as a result;\nSo, is it not I who harm them?",
        "48": "By depending upon them as my objects of patience,\nI can purify many non-virtues;\nBut by depending upon me as their object of anger,\nThey will fall for a long time into hellish states of suffering.",
        "49": "Thus, since it is I who inflict harm on them\nAnd they who benefit me,\nWhy, unruly mind, do you distort things so\nBy becoming angry with them?",
        "50": "If I maintain this positive view,\nI shall not create the cause to be reborn in hell;\nBut, although I protect myself through the practice of patience,\nThe same effect will not ripen on others.",
        "51": "'Then would it not be better to return their harm?'\nNo! Retaliation would not protect them;\nIt would just cause my Bodhisattva vow to degenerate\nAnd destroy my practice of patience.",
        "52": "Since my mind is not a bodily form,\nThere is no one who can destroy it;\nBut, because I am strongly attached to my body,\nI feel hurt when it is suffering.",
        "53": "Contempt, harsh words\nAnd unpleasant speech\nDo not harm the body;\nSo why, mind, do you become so angry?",
        "54": "'Such slanderous words may cause others to dislike you.'\nTheir dislike will not cause me any harm\nIn this or future lives;\nSo why should I not want it?",
        "55": "'If people dislike you, that might prevent you\nFrom acquiring wealth or status.'\nBut I shall lose all my worldly acquisitions when I die \"“\nThe only thing to remain will be the non-virtue I create.",
        "56": "It would be better for me to die today\nThan to live a long life filled with non-virtue;\nAnd, even if I have a long life,\nI shall still have to face the suffering of death.",
        "57": "If one person were to awake from a dream\nIn which he had experienced a hundred years of happiness,\nAnd another were to awake from a dream\nIn which he had experienced but a brief moment of happiness,",
        "58": "Once awake, the situation would be the same for both\nBecause neither could ever return to that happiness.\nIn the same way, whether our life is long or short,\nAt the time of death everything ends just the same.",
        "59": "Even if I live happily for a long time\nAnd acquire great wealth and possessions,\nI shall still have to leave this life empty-handed and naked,\nAs if I had been robbed by a thief.",
        "60": "'Even so, acquiring wealth will support your life\nSo that you can purify non-virtue and accumulate merit.'\nBut if in acquiring that wealth I generate non-virtues such as anger,\nIt will be my non-virtue that increases and my merit that declines.",
        "61": "What is the point of a life\nIn which we commit only non-virtue?\nNon-virtues are the main cause of our suffering,\nAnd suffering is the main object to be abandoned!",
        "62": "'At least you should retaliate when people speak ill of you\nAnd cause others to lose their faith in you.'\nIn that case, why do I not get angry\nWhen people speak ill of others?",
        "63": "If, mind, you can forbear such loss of faith\nWhen it is related to others,\nWhy are you not patient when others speak ill of you,\nFor that is related to the arising of delusions?",
        "64": "Even if someone were to insult or destroy the Dharma,\nThe holy images or the stupas,\nIt would still not be appropriate to get angry with them,\nFor how could the Three Jewels ever be harmed?",
        "65": "We should also prevent anger arising towards anyone\nWho might harm our Spiritual Guide, our friends or our relatives\nBy seeing that such harm also occurs in dependence upon conditions\nIn the way that was just explained.",
        "66": "Embodied beings are harmed\nBy both animate and inanimate objects;\nSo why become angry only with animate ones?\nWe should be patient with both types of harm.",
        "67": "If one person causes harm out of ignorance\nAnd another gets angry with him, also out of ignorance,\nWhich person is at fault\nAnd which one is not?",
        "68": "Out of ignorance, previously I committed actions\nThat now result in others causing me harm.\nThus, all the harm I receive is related to my own actions,\nSo why get angry with others?",
        "69": "Seeing this to be the case,\nI should practise what is meritorious,\nImpelled by the wish that all living beings\nWill develop love for one another.",
        "70": "If, for example, a house caught fire\nAnd there was a danger of the fire spreading to an adjacent house,\nIt would be advisable to remove anything, such as dry grass,\nThat might enable the fire to spread.",
        "71": "In the same way, when those to whom I cling are harmed,\nMy attachment to them enables the fire of anger to spread to me.\nFearing that this will consume all my merit,\nI should definitely abandon such attachment.",
        "72": "How fortunate is a person condemned to death\nWho is spared with having just his hand cut off;\nAnd how fortunate are we if, instead of the agonies of hell,\nWe have to experience only the sufferings of the human realm.",
        "73": "If we cannot bear the relatively slight suffering\nThat we have to experience now,\nWhy do we not refrain from anger,\nWhich causes the far greater sufferings of hell?",
        "74": "In the past, because of my attachment to non-virtuous actions,\nI have endured aeons of torment in the hells and elsewhere,\nAnd yet none of that has brought any benefit\nEither to myself or to others;",
        "75": "But now, through enduring comparatively little discomfort,\nI can accomplish the greatest purpose of all \"“\nTo free all living beings from their suffering \"“\nSo I should feel only joy at having to endure such hardships.",
        "76": "If someone else develops a mind of joy\nThrough praising another's good qualities,\nWhy, mind, do you not praise him too\nAnd experience the same kind of joy?",
        "77": "I should always rejoice in others' happiness and virtue.\nThis joy causes my virtues to increase.\nMoreover, it is the cause of delighting the holy beings\nAnd the supreme method for benefiting others.",
        "78": "Those who are not concerned with others' happiness\nAnd do not want them to be happy,\nAre like someone who stops paying wages to those who work for him,\nWho then experiences many problems.",
        "79": "When my own good qualities are praised,\nI want others to rejoice in me;\nSo why, when others' good qualities are praised,\nShould I not want to rejoice in them?",
        "80": "Having generated the bodhichitta motivation\nWishing for all living beings to be happy,\nWhy on earth do we not rejoice\nWhen others find some happiness for themselves?",
        "81": "If I really wish for living beings to become Buddhas,\nWho are worshipped throughout all worlds,\nWhy do I dislike it so\nWhen others receive a little mundane respect now?",
        "82": "If someone I was looking after\nAnd providing for in different ways\nWere to find his own source of livelihood,\nSurely I would be happy, not upset.",
        "83": "If I begrudge living beings even this,\nHow can I wish for them to attain enlightenment?\nWhere is the bodhichitta in one who is not happy\nWhen others receive something good?",
        "84": "People become angry when someone benefits their enemy,\nBut, whether their enemy receives benefit or not,\nIt is the enemy's own anger that urges him to attack;\nSo it is that anger which is to blame, not the benefactor.",
        "85": "Why, by getting angry, do we throw away our merit,\nThe faith others have in us, and our other good qualities?\nWould it not be better to get angry with anger itself,\nFor it brings no benefit to us or to others?",
        "86": "It is bad enough that you, mind, have no remorse\nFor the non-virtues you have committed;\nBut why do you compound it\nBy being jealous with those who practise virtue?",
        "87": "The thought that wishes for our enemy to suffer\nHarms only us, through creating non-virtue;\nUnderstanding this, we should not develop harmful thoughts\nTowards anyone, including our enemies.",
        "88": "And even if your enemy did suffer as you wish,\nHow would that benefit you?\nIf you say, 'Well, at least it would give me some satisfaction',\nHow can there be a mind lower than that?",
        "89": "Such thoughts are like unbearably sharp hooks\nCast by the fishermen of the delusions, such as anger.\nOnce caught on them, we shall definitely be boiled alive\nIn the terrifying cauldrons of the guardians of hell.",
        "90": "Praise, fame and good reputation\nWill not increase my merit or extend my life,\nNor will they give me strength, freedom from illness,\nOr any form of physical pleasure.",
        "91": "Transient pleasures, such as drinking and playing meaningless games,\nAre deceptive.\nIf I understand the real meaning of a human life,\nSuch things will have no value for me.",
        "92": "For the sake of fame and reputation,\nPeople give away their wealth and even sacrifice their lives;\nBut what good can a few dry words do when we die?\nTo whom can they bring any pleasure?",
        "93": "When people lose their reputation,\nThey become despondent, like a child\nWho cries when the sandcastle he has built\nIs washed away by the tide.",
        "94": "A few short-lived, inanimate sounds\nCan have no intention to praise me.\n'But they are a source of pleasure for the one who praises you;\nSo you should be happy too.'",
        "95": "Whether someone praises me or others,\nHow shall I benefit from their pleasure?\nSince it is entirely in their mind,\nI shall not receive any part of it.",
        "96": "'But you should be happy because he is happy.'\nThen I should feel the same way about everyone \"“\nIn which case I should also be happy\nWhen something pleases my enemy!",
        "97": "Seeking happiness from praise\nGiven by friends and others\nIs entirely inappropriate \"“\nIt is completely childish behaviour.",
        "98": "Praise and so forth distract me from virtue,\nWeaken my disillusionment with samsara,\nCause me to envy others' good qualities,\nAnd undermine everything that is beneficial.",
        "99": "Therefore, those who conspire\nTo prevent me from being praised\nAre really acting to prevent me\nFrom falling into the lower realms!",
        "100": "I, who seek liberation, have no need for wealth or a good reputation\nFor they only keep me bound in samsara;\nSo why should I get angry\nWith those who free me from this bondage?",
        "101": "Those who cause me suffering\nAre like Buddhas bestowing their blessings.\nSince they lead me to liberating paths,\nWhy should I get angry with them?",
        "102": "'Don't they obstruct your virtuous practice?'\nNo! There is no virtuous practice greater than patience;\nTherefore, I will never get angry\nWith those who cause me suffering.",
        "103": "If, because of my own shortcomings,\nI do not practise patience with my enemy,\nIt is not he, but I, who prevent me from practising patience,\nThe cause of accumulating merit.",
        "104": "My enemy is the cause of my accumulating the merit of patience\nBecause without him there is no patience to practise,\nWhereas with him there is.\nSo how does he obstruct my virtuous practice?",
        "105": "A beggar is not an obstacle\nTo people practising giving\nAny more than an Abbot is an obstacle\nTo those wishing to ordain.",
        "106": "Indeed, there are many beggars in this world,\nBut people who harm me are extremely rare.\nIn fact, if I had not inflicted harm on others in the past,\nThere would be no one to inflict harm on me now!",
        "107": "Just as if some treasure were suddenly to appear in my house\nWithout my making any effort to obtain it,\nI should be delighted to have found an enemy\nWho can help me practise the conduct that leads to enlightenment.",
        "108": "Along with myself, my enemy is the cause of my practising patience.\nTherefore, I should first dedicate\nWhatever fruits arise from this practice\nTo the person who was a cause of it.",
        "109": "'But your enemy has no intention to help you practise patience,\nSo why should you venerate him?'\nThen why venerate the holy Dharma\nAs a way of practising virtue?",
        "110": "'Surely you should not venerate an enemy\nWho harbours the intention to cause you harm.'\nBut if everyone was like a doctor striving to help me,\nWhen would I ever practise patience?",
        "111": "Thus, because the practice of patience occurs\nIn dependence upon those with hateful minds,\nSuch people should be venerated just like the holy Dharma\nBecause they are causes of the practice of patience.",
        "112": "Buddha says that the field of living beings\nIs like the field of enlightened beings,\nFor there are many practitioners who, through pleasing living beings,\nHave attained the state of perfection, Buddhahood.",
        "113": "Since living beings and enlightened beings are alike\nIn that the qualities of a Buddha arise in dependence upon them,\nWhy do we not show the same respect to living beings\nAs we do to the enlightened beings?",
        "114": "They are not equal with regard to their realizations;\nBut, because living beings have the good quality\nOf helping to produce the same result, Buddhahood,\nThey are equal in the sense of also being a field of merit.",
        "115": "Whatever merit there is in venerating one with limitless love\nIs due to the greatness of all living beings,\nAnd whatever merit there is in having faith in the Buddhas\nIs due to the greatness of the Buddhas.",
        "116": "Thus, they are said to be equal because being respectful to both\nLeads to the attainment of the state of Buddhahood;\nBut because living beings do not possess limitless good qualities,\nThey are not actually equal to Buddhas.",
        "117": "The unique qualities of a Buddha are so extensive\nThat any being in whom even a small fraction of them appears\nIs worthy of veneration that would not be adequately expressed\nEven by offering them everything in the three worlds.",
        "118": "Therefore, because they share in giving rise\nTo the supreme state of Buddhahood,\nAt least from this point of view\nIt is suitable to venerate living beings.",
        "119": "Moreover, besides pleasing living beings,\nWhat other way is there for us to repay\nThose supreme, unchanging friends\nWho bestow immeasurable benefit?",
        "120": "By benefiting these living beings, I can repay Buddha,\nWho many times gave up his life and entered the deepest hell for their sake.\nTherefore, even if they inflict great harm on me,\nI will always treat them respectfully and with a good heart.",
        "121": "If Buddhas, who are far superior to me,\nDisregard their own bodies for the sake of living beings,\nWhy do I act out of foolish pride\nAnd not behave as if I were a servant of others?",
        "122": "Buddhas are delighted when living beings are happy\nAnd displeased when they are harmed;\nSo it follows that, when I please or harm living beings,\nIt is the same as pleasing or harming all the Buddhas.",
        "123": "If we harm a child,\nThere is no way to please its mother.\nIn the same way, if we harm any living being,\nThere is no way to please the compassionate Buddhas.",
        "124": "Therefore, since I have caused harm to living beings,\nWhich has displeased the compassionate Buddhas,\nToday I confess individually all these non-virtues \"“\nPlease, O Compassionate Ones, forgive me for offending you so.",
        "125": "From now on, to delight the Tathagatas,\nI will definitely become like a servant to all living beings.\nEven if people kick me and humiliate me,\nI will please the Buddhas by not retaliating.",
        "126": "There is no doubt that the compassionate Buddhas\nHave completed exchanging self with all living beings.\nThus, the nature of living beings is the very nature of the Buddhas,\nSo we should afford them the same respect.",
        "127": "Practising in this way pleases all the Buddhas,\nIs a perfect method for accumulating good fortune,\nAnd gives me the ability to dispel the sufferings of the world.\nTherefore, I should always practise the three types of patience.",
        "128": "If, for example, a king's minister\nWere to cause harm to many people,\nFar-sighted people would not retaliate\nEven if they were able to do so",
        "129": "Because they would see that he was not alone\nBut was supported by the might of the king.\nIn the same way, we should not retaliate\nTo those who cause us a little harm,",
        "130": "Because they are supported by the compassionate Buddhas \"“\nAnd by the guardians of hell!\nTherefore, we should be like the subjects of a powerful king\nAnd try to please other living beings.",
        "131": "Even if such a king were to get angry,\nHe would not be able to subject me to the sufferings of hell,\nWhich is what I shall experience\nIf I harm other beings.",
        "132": "And, no matter how benevolent that king might be,\nHe could not bestow upon me the attainment of Buddhahood,\nWhich is what I shall experience\nIf I please other beings.",
        "133": "Why can I not see that my eventual attainment of Buddhahood,\nAnd my success, good reputation\nAnd prosperity in this life,\nAll come from pleasing other living beings?",
        "134": "Even while I remain in samsara,\nThrough patience I shall attain beautiful forms,\nGood health, reputation, very long lives\nAnd even the extensive happiness of a chakravatin king!\nThis concludes the sixth chapter of Guide to the Bodhisattva's Way of Life, entitled 'Relying upon Patience'."
      }
    },
    "7": {
      "title": "Relying upon Effort",
      "verses": {
        "1": "With the practice of patience I should train in effort\nBecause the fruit of enlightenment depends upon it.\nJust as a candle flame cannot move without wind,\nSo the collections of wisdom and merit cannot grow without effort.",
        "2": "Effort is a mind that delights in virtue.\nIts opponents are the laziness of indolence,\nThe laziness of being attracted to non-virtuous actions\nAnd the laziness of discouragement.",
        "3": "The laziness of indolence develops\nWhen, through being attracted to worldly pleasures,\nAnd particularly to the pleasures of sleep,\nWe fail to become disillusioned with the sufferings of samsara.",
        "4": "Why do we not realize that while we are caught\nIn the snare of delusions such as laziness,\nWe are trapped in the net of samsara\nAnd held within the jaws of the Lord of Death?",
        "5": "If I check carefully, I can see that the Lord of Death\nIs systematically slaughtering everyone;\nYet still I am not concerned about my death,\nJust like an animal unconcerned about being butchered.",
        "6": "The Lord of Death is looking for his next victim\nSo that he can prevent him from travelling the path to liberation,\nAnd that victim might well be me;\nSo how can I just indulge in worldly pleasures?",
        "7": "The time of death will come quickly,\nSo accumulate wisdom and merit while you can.\nDo not wait until the time of death to abandon laziness,\nFor then it will be too late!",
        "8": "With some things not yet started\nAnd others half-finished,\nThe Lord of Death will suddenly strike\nAnd I shall think, 'Oh no, this is the end for me!'",
        "9": "When I become a victim of the Lord of Death,\nMy relatives \"“ their eyes red and swollen with sorrow\nAnd their faces flushed with tears \"“\nWill finally give up hope.",
        "10": "Tormented by memories of my previous non-virtues\nAnd hearing the sounds of impending hell,\nOut of terror I shall cover myself in excrement!\nWhat shall I be able to do in such a pathetic state?",
        "11": "If even in this human life I shall experience terror\nLike that felt by a fish being cooked alive,\nWhat can be said of the unbearable sufferings of hell\nThat I shall experience as a consequence of my non-virtuous actions?",
        "12": "As a result of the non-virtues I have committed,\nI shall be reborn in the hot hells\nWhere my tender, young flesh will be scalded by hot, molten metals;\nSo how can I remain at ease under the control of laziness?",
        "13": "I wish for higher attainments without having to make any effort,\nPermanent freedom without having patiently to endure any pain,\nAnd to remain like a long-life god while living in the jaws of death.\nHow foolish I am! When death comes, I shall be overwhelmed by suffering!",
        "14": "By depending upon this boat-like human form,\nWe can cross the great ocean of suffering.\nSince such a vessel will be hard to find again,\nThis is no time to sleep, you fool!",
        "15": "Why do I forsake the joy of holy Dharma,\nWhich is a boundless source of happiness,\nJust to seek pleasure in distractions and meaningless pursuits\nThat are only causes of suffering?",
        "16": "Without being discouraged, I should collect wisdom and merit\nAnd strive for self-control through mindfulness and alertness.\nThen I should equalize self and others\nAnd practise exchanging myself with others.",
        "17": "I should not discourage myself by thinking,\n'How shall I ever become enlightened?'\nFor the Tathagatas, who speak only the truth,\nHave said that it can be so.",
        "18": "It is said that even flies, bees, gnats\nAnd all other insects and animals\nCan attain the rare and unsurpassed state of enlightenment\nThrough developing the power of effort;",
        "19": "So why should I, who am born a human,\nAnd who understands the meaning of spiritual paths,\nNot attain enlightenment\nBy following the Bodhisattva's way of life?",
        "20": "Some people might be discouraged out of fear\nOf having to sacrifice their flesh,\nBut this is due to not understanding\nWhat we should give, or when.",
        "21": "In our previous lives, over countless aeons,\nWe have been cut, stabbed, burned\nAnd flayed alive innumerable times;\nBut we have not achieved anything from these hardships.",
        "22": "Yet the hardships we must forbear to attain enlightenment\nAre insignificant compared to these.\nIt is like enduring the lesser suffering of surgery\nSo as to stop much greater pain.",
        "23": "If doctors have to use unpleasant medical treatments\nTo cure people of their illnesses,\nI should be able to forbear a few discomforts\nTo destroy the many sufferings of samsara.",
        "24": "But Buddha, the Supreme Physician, does not use\nOrdinary treatments such as these;\nRather, he uses extremely gentle methods\nTo eliminate all the great diseases of the delusions.",
        "25": "To begin with, Buddha, the Guide, encourages us\nTo practise giving such things as food.\nLater, when we become used to this,\nWe can gradually learn to give our own flesh.",
        "26": "When eventually we develop a mind\nThat regards our body as being just like food,\nWhat discomfort shall we feel\nFrom giving away our flesh?",
        "27": "The Bodhisattva has abandoned non-virtue and so does not experience physical suffering;\nAnd, because he clearly realizes emptiness, he does not experience mental pain.\nBy contrast, we are afflicted by wrong conceptions\nAnd our bodies and minds are harmed by non-virtuous actions.",
        "28": "Because of his merit, the Bodhisattva experiences physical happiness,\nAnd because of his wisdom, mental joy;\nSo even if this compassionate one must abide in samsara for the sake of others,\nHow could he ever be perturbed?",
        "29": "Through the power of his bodhichitta,\nHe purified all his previous non-virtue;\nAnd because he accumulates vast collections of merit and wisdom,\nHe is said to surpass the Hearers.",
        "30": "Having mounted the steed of bodhichitta\nThat dispels mental discouragement and physical weariness,\nThe Bodhisattva travels the path from joy to joy.\nKnowing this, who could ever be discouraged?",
        "31": "The four powers that assist us in working for the benefit of others\nAre the powers of aspiration, self-confidence, joy and rejection.\nThe power of aspiration is generated by contemplating the benefits of virtuous actions\nAnd developing fear of the cycle of suffering.",
        "32": "Having overcome all three types of laziness,\nI should continuously strive to increase my effort\nThrough aspiration, self-confidence, joy and rejection,\nAnd through the force of familiarity and mental suppleness.",
        "33": "In the past, I have accumulated\nCountless non-virtuous actions,\nEven just one of which can cause me\nTo experience many aeons of suffering,",
        "34": "But, because of my laziness,\nI have not purified any of these evils\nAnd so I remain as an abode of infinite suffering.\nWhy does my heart not crack open with fear?",
        "35": "I need to attain the good qualities of a Bodhisattva\nFor the sake of myself and others,\nBut it might take me many aeons\nTo accomplish just one of these.",
        "36": "Up to now, I have not familiarized myself\nWith even a fraction of these good qualities.\nHow tragic it would be if I were now to waste\nThis rare and precious rebirth on meaningless pursuits!",
        "37": "Do I have faith and respect in Buddha?\nHave I practised his teachings, the Dharma?\nDo I rely upon the supreme spiritual friends, the Sangha?\nHave I fulfilled the wishes of the poor and needy?",
        "38": "Do I give help to those in danger\nOr relief to those who are suffering?\nNo! All I have done is experience the discomforts\nOf being in my mother's womb, and all the subsequent sufferings.",
        "39": "In my previous lives I held views\nThat denied Buddha's teachings\nAnd, as a result, I am now very poor in spiritual realizations.\nKnowing this, how can I give up the practice of Dharma?",
        "40": "Buddha, the Able One, has said\nThat the root of Dharma is the intention to practise it.\nWe can generate this intention by meditating\nOn the law of karma, or actions and their effects.",
        "41": "All physical suffering and mental unhappiness,\nAll the different types of fear,\nAnd the suffering of being separated from what we want\nArise from non-virtuous actions.",
        "42": "Through committing non-virtuous actions,\nEven though we may wish for happiness\nWe shall be pierced by the weapons of suffering\nWherever we find ourself;",
        "43": "But, through performing virtuous actions with a pure intention,\nWe shall be sustained by a happiness\nThat results from that merit,\nWherever we are reborn.",
        "44": "Those born in Buddha's Pure Land arise from the lotus of pure actions performed through receiving the light of Conqueror Buddha's blessings.\nThey are completely pure, uncontaminated by delusions, like a lotus unstained by mud.\nNourished by hearing Conqueror Buddha's speech directly, they experience supreme inner peace.\nAll this happiness and goodness is the result of virtuous actions, such as the six perfections, prayer and dedication.",
        "45": "By contrast, those born in hell, on the fiery ground of red-hot iron, suffer at the hands of the henchmen of the Lord of Death,\nWho tear open their skin and pour molten copper into their bodies\nAnd then, piercing them with flaming swords and spears, cut their flesh into hundreds of fragments.\nSuch sufferings, which are experienced for many aeons, are the result of non-virtuous actions.",
        "46": "Therefore, I should always keep the intention to accumulate virtues, not non-virtues,\nAnd put this intention into practice with strong effort.\nAs mentioned in Vajradotsa Sutra,\nWhatever Dharma practice I study, I should complete it with strong confidence.",
        "47": "First, I should examine what is to be done,\nTo see whether I can do it or not.\nIf I am unable to do it, I should not start it;\nBut, once I start something, I should never turn back.",
        "48": "Otherwise this habit will carry into my future lives\nAnd my non-virtue and suffering will continue to increase.\nMoreover, other virtuous actions will take a long time to accomplish\nAnd will yield only meagre results.",
        "49": "I should maintain self-confidence in three things:\nMy Dharma practice, my Dharma activities and overcoming my own delusions.\nI should encourage myself by thinking, 'I alone will lead all living beings to the happiness of enlightenment',\nAnd in this way sustain my self-confidence in these three things.",
        "50": "Unlike me, worldly beings are powerless.\nBeing under the control of delusion and karma,\nThey are unable to make their lives meaningful.\nTherefore, I will practise virtue for their sake.",
        "51": "How can I sit and do nothing\nWhile others waste their lives on meaningless tasks?\nAlthough it might seem like self-importance,\nI should act out of self-confidence, which is quite different from self-importance.",
        "52": "If a snake lies dying on the ground,\nCrows will act like brave eagles and attack it.\nIn the same way, if my self-confidence is weak,\nEven the slightest adversity will be able to harm me.",
        "53": "If, out of laziness, I give up trying,\nHow shall I ever attain liberation in such a feeble state?\nBut if, out of self-confidence, I generate effort,\nIt will be difficult for even the greatest adversity to harm me.",
        "54": "Therefore, with a steadfast mind\nI will overcome all downfalls\nFor, if I am defeated by a downfall,\nMy wish to triumph over all obstacles will be but a joke.",
        "55": "'I will conquer all obstacles,\nAnd none shall conquer me.'\nThus I, who will become a Conqueror,\nWill practise with self-confidence.",
        "56": "Anyone who is governed by the view of self-importance\nIs under the influence of delusion, not self-confidence.\nSuch a person has succumbed to the enemy of the self-important view,\nWhereas one with self-confidence has not.",
        "57": "Those who are inflated by the deluded view of self-importance\nWill be reborn in the lower realms;\nAnd, if they later take rebirth in a human form,\nThey will be poor and miserable, like slaves eating others' food.",
        "58": "Stupid, ugly and feeble, they will be despised by everyone.\nSo-called 'tough people' who are puffed up with pride\nAre also counted among the self-important \"“\nWho could be more pathetic than they are?",
        "59": "By contrast, whoever develops the self-confidence to conquer the enemy of the self-important view\nIs a self-confident one who is a true conquering hero;\nAnd whoever completely eradicates the enemy of the self-important view\nWill be able to fulfil the temporary wishes of living beings and bestow upon them the fruit of enlightenment.",
        "60": "When I find myself assailed by a host of delusions,\nI will oppose them in a thousand ways.\nLike a lion among a group of foxes,\nI will not allow myself to be harmed by delusions.",
        "61": "Just as people protect their eyes\nWhen in dangerous situations,\nSo, whenever there is a danger of the delusions,\nI will protect myself from their influence.",
        "62": "It would be far better for me to be burned to death\nOr to have my head cut off\nThan it would be for me ever to submit\nTo the enemy of the delusions.",
        "63": "Like a Bodhisattva, I should long to work for others\nWith the same enthusiasm as that possessed by someone\nWho thoroughly enjoys playing a game.\nI should never tire, but experience uninterrupted joy.",
        "64": "Although it is uncertain whether the result will be happiness or suffering,\nWorldly people still work hard to make themselves happy;\nSo why do we not derive joy from the practice of Dharma,\nWhich definitely results in happiness?",
        "65": "I have a strong wish to pursue objects of desire,\nWhich, like honey on a razor's edge, give no real satisfaction;\nBut it would be far better to develop a strong wish to pursue virtuous actions,\nWhich result in the everlasting happiness of liberation from all suffering.",
        "66": "Therefore, to complete the virtuous actions mentioned above,\nI will engage in them with the same enthusiasm\nAs that with which an elephant, tormented by the heat of the day,\nPlunges into a cool, refreshing pool.",
        "67": "If I become weak or tired, I should stop what I am doing\nAnd continue with it once I have rested.\nWhen I have done something well, I should not be attached,\nBut move on to what needs to be done next.",
        "68": "Just as a seasoned warrior on the battlefront\nApproaches the enemy's weapons with care,\nSo will I protect myself from the weapons of the delusions\nAnd bind these enemies so that I can destroy them.",
        "69": "If someone drops his weapon during a battle,\nOut of fear he will immediately pick it up again.\nLikewise, if I ever lose the weapon of mindfulness,\nI will recall the sufferings of hell and out of fear restore it straightaway.",
        "70": "Just as a little poison will spread throughout the body\nWith the circulation of the blood,\nSo, given an opportunity,\nThe delusions will spread throughout my mind.",
        "71": "A Dharma practitioner should practise as attentively\nAs a person would walk if he were forced to carry a jar brimming with oil,\nFearful in the knowledge that, if he spilled just one drop,\nThe tormentor behind him would slay him with a sword.",
        "72": "Therefore, just as I would quickly jump up\nIf a snake were to crawl into my lap,\nSo, whenever sleep or laziness threaten,\nI will swiftly remove them from my mind.",
        "73": "Each time faults such as delusions arise,\nI will thoroughly chastise myself\nAnd then focus for a long time\nOn the determination not to let that happen again.",
        "74": "In this way, in all situations\nI will acquaint myself with mindfulness \"“\nSincerely and purely practising Dharma\nSo that I can protect myself and others from suffering.",
        "75": "To ensure that I have the strength for all of this,\nBefore I commence I will recall\nThe instructions on conscientiousness\nAnd rise to these tasks with suppleness of body and mind.",
        "76": "Just as a piece of cotton moving back and forth\nIs controlled by the movement of the wind,\nSo with my body, speech and mind controlled by the joy of effort\nI will swiftly accomplish all realizations.\nThis concludes the seventh chapter of Guide to the Bodhisattva's Way of Life, entitled 'Relying upon Effort'."
      }
    },
    "8": {
      "title": "Relying upon Mental Stabilization",
      "verses": {
        "1": "Having generated effort in this way,\nI should place my mind in concentration;\nFor a person whose mind is distracted\nIs trapped within the fangs of the delusions.",
        "2": "Distractions do not arise for those\nWho abide in physical and mental solitude.\nTherefore, I should forsake the worldly life\nAnd abandon all disturbing thoughts.",
        "3": "Attachment to people, possessions and reputation\nPrevent me from forsaking the worldly life.\nTo abandon these obstacles,\nI should contemplate as follows.",
        "4": "Realizing that delusions are thoroughly destroyed\nBy superior seeing conjoined with tranquil abiding,\nI should first strive to attain tranquil abiding\nBy gladly forsaking attachment to worldly life.",
        "5": "I, who am decaying moment by moment, have attachment to others\nWho are also decaying moment by moment.\nAs a result of this, I shall not be able to see\nPure, attractive objects for thousands of lifetimes.",
        "6": "If I do not see someone whom I find attractive,\nI become unhappy and cannot place my mind in concentration;\nYet, when I do see that person, I find no satisfaction\nBut am just as tormented by attachment as I was before.",
        "7": "Having strong attachment to other living beings\nObstructs the correct view of emptiness,\nPrevents renunciation for samsara,\nAnd causes great sorrow at the time of death.",
        "8": "While we preoccupy ourself with the things of this life,\nOur whole life passes without any meaning.\nFor the sake of impermanent friends and relatives,\nWe neglect the Dharma that leads to permanent liberation.",
        "9": "By behaving in such a childish way,\nWe definitely create the causes of lower rebirth.\nSince worldly beings lead us to unfortunate states,\nWhat is the point of relying on them?",
        "10": "One moment they are friends,\nThe next moment they become enemies;\nAnd even while they are enjoying themselves, they become angry \"“\nHow unreliable worldly beings are!",
        "11": "If I tell them about something that is meaningful, they become angry\nAnd even try to prevent me from engaging in that meaningful action;\nYet if I do not listen to what they say, they become angry with that\nAnd in so doing create the causes of lower rebirth!",
        "12": "The childish are jealous of anyone superior to them,\nCompetitive with their equals, and arrogant towards their inferiors.\nThey are conceited when praised but get angry if criticized.\nThere is never any benefit in being attached to them.",
        "13": "As a result of associating with the childish,\nWe naturally engage in unwholesome actions\nSuch as praising ourself, disparaging others\nAnd discussing the importance of worldly pleasures.",
        "14": "The relationships I have made with the childish\nHave been completely deceptive,\nFor the childish have done nothing to fulfil my wishes\nAnd I have done nothing to fulfil theirs.",
        "15": "Therefore, I should withdraw to a great distance from the childish.\nIf I should subsequently meet them, I should please them by being happy\nAnd, without becoming too close,\nAct in agreeable ways according to convention.",
        "16": "Just as a bee takes pollen from a flower,\nSo should I gather only what I need to sustain my practice\nAnd then, without clinging, return to abide in solitude\nAs if I had never met anyone.",
        "17": "If people think I have many possessions,\nThey will respect me and like me;\nBut if I harbour this kind of pride,\nI shall experience terrible fears after I die.",
        "18": "O thoroughly confused mind,\nFor as many objects as you accumulate,\nYou will have to endure a thousand times more suffering\nBecause of your attachment to them.",
        "19": "Thus, because objects of attachment give rise to fear,\nThe wise should not become attached,\nBut remain firm in the understanding\nThat by their very nature these things are to be left behind.",
        "20": "Even if I have acquired many possessions,\nFame, and a good reputation,\nNone of these things\nCan go with me when I die.",
        "21": "Why am I unhappy when someone criticizes me\nAnd happy when I am praised?\nBoth criticism and praise are just empty words,\nLike echoes in an empty cave.",
        "22": "Living beings have so many different inclinations\nThat even Buddha is unable to satisfy them all;\nSo what chance do I, an ordinary confused being, have?\nTherefore, I should give up the wish to associate with worldly beings.",
        "23": "They look down on those who do not have wealth\nAnd despise those who do.\nHow can people who are so hard to get along with\nEver see anything but faults in me?",
        "24": "Whenever their wishes are not fulfilled,\nThe childish become unhappy.\nThis is why the Tathagatas have advised us\nNot to associate with them.",
        "25": "When shall I withdraw into the forest\nAnd live among the trees\nWith birds and deer who say nothing unpleasant\nBut are a joy to live with?",
        "26": "Or dwell in a cave or an empty shrine,\nOr abide beneath the trees,\nWith a mind unfettered by attachment,\nWhich never turns to look back?",
        "27": "When shall I live in a place that no one calls 'mine' \"“\nA place that is naturally open and spacious,\nWhere I can act freely and do as I wish,\nWithout any attachment to body or possessions?",
        "28": "With just a few possessions, such as a begging bowl\nAnd clothes that no one else wants,\nI shall be free from any danger of thieves and robbers.\nIn this way, I should live without grasping onto 'I' or 'mine'.",
        "29": "I should withdraw to a burial ground\nAnd meditate on the impermanence of my body\nBy thinking that it is really no different from a dead body,\nFor both are decaying moment by moment.",
        "30": "It might happen that, when I die,\nMy body will decay quickly and emit an odour so foul\nThat not even foxes will want to come near it!\nI should happily accept that such things could happen.",
        "31": "If this body, which is one unit,\nWill break into separate pieces\nOf flesh and bone,\nWhat can be said of my relationships?",
        "32": "At birth I was born alone\nAnd at death I shall have to die alone.\nSince I cannot share these sufferings with others,\nWhat use are friends who prevent me from practising virtue?",
        "33": "Just as people who travel have no attachment\nTo a guest house where they stay for just one night,\nSo should I not develop attachment to this body,\nWhich is the guest house for just one rebirth.",
        "34": "Before such time as this body of mine\nIs borne aloft by four pallbearers\nAnd worldly beings grieve my passing,\nI will withdraw to the solitude of the forest.",
        "35": "Encountering neither friends nor enemies,\nMy body will remain in complete solitude.\nIf I am already counted among the dead,\nThere will be no one to mourn me when I die.",
        "36": "Then, with no one around me\nGrieving or planning harm,\nWho will there be to distract me\nFrom my recollection of holy Buddha?",
        "37": "Therefore, I will dwell alone\nIn a quiet and peaceful place.\nHappy, contented and with no worries,\nI will strive to pacify all distractions.",
        "38": "Having given up all other desires\nAnd being motivated solely by bodhichitta,\nI will strive to attain single-pointed concentration\nAnd control my mind by recollecting the meaning of emptiness.",
        "39": "Deluded desires give rise to misfortune\nIn both this and future lives.\nIn this life they cause injury, incarceration and death,\nAnd in the next the sufferings of the lower realms.",
        "40": "For the sake of acquiring a sexual partner,\nPeople send messages through go-betweens\nAnd, disregarding any harm to their reputation,\nCommit all manner of non-virtue.",
        "41": "Although we engage in harmful actions\nAnd even sacrifice all our wealth for them,\nWhat is the real nature of these bodies\nThat we like so much to embrace?",
        "42": "They are nothing other than skeletons\nThat are neither autonomous nor inherently existent.\nRather than being so desirous and attached to them,\nWhy do I not strive to pass beyond sorrow instead?",
        "43": "When we are very attached to someone,\nWe want to see their face again and again;\nBut, whether we see their face or not,\nThe real face always remains covered with skin.",
        "44": "If we were to remove that skin,\nWe would realize that they are not an object of desire\nBut an object of aversion;\nSo why do we develop attachment for others' bodies?",
        "45": "Although we jealously guard our lover from others' advances,\nThe Lord of Death will take him from us\nAnd his body will be burned or buried in the ground;\nSo what is the point of our jealousy and attachment?",
        "46": "Others' bodies to which we are very attached\nAre just collections of flesh and bone.\nAt any moment, they could be destroyed by the Lord of Death;\nSo why develop attachment to them?",
        "47": "When we see a human corpse, which is a mere collection of flesh and bone,\nWe develop fear even though it does not move;\nSo why are we not fearful of living bodies, which are also just collections of flesh and bone\nMoving here and there like zombies?",
        "48": "Since both dead bodies and living bodies\nAre mere collections of flesh and bone,\nWhy am I attracted to living bodies but not to dead ones?\nThinking in this way, I should stop attachment to others' bodies.",
        "49": "Both saliva and urine come from the same source \"“\nThe intake of fluids into the body \"“\nSo why is it that we like saliva when kissing\nBut have no desire for urine?",
        "50": "Although cotton is also soft to touch,\nYou find no sexual pleasure in a pillow.\nRather, you think the body does not emit foul smells \"“\nO desirous mind, you are so confused about what is unclean!",
        "51": "Just as we sometimes get angry at other people,\nWhy don't we also get angry at pillows?\nFor, although they too are soft to touch,\nWe cannot copulate with them!",
        "52": "We might feel that what we are attracted to is not impure;\nAnd yet we want to copulate with others' bodies,\nWhich are just cages of bone tied together with muscles\nAnd plastered over with the mud of flesh!",
        "53": "We have enough impurities of our own\nThat we constantly have to contend with;\nSo why, out of an obsession with the unclean,\nDo we desire other bags of filth?",
        "54": "'It is the flesh that I enjoy.'\nIf this is what you like to see and touch,\nWhy do you not want it in its natural state \"“\nWhen it is devoid of mind?",
        "55": "Any mind that you desire\nCan be neither seen nor touched,\nAnd anything you can see or touch cannot be mind;\nSo why engage in meaningless copulation?",
        "56": "Perhaps it is not so strange\nThat you do not realize others' bodies are impure,\nBut it is very strange\nThat you do not realize your own is.",
        "57": "If your main interest is in attractive forms,\nWhy do you not prefer to touch such things\nAs beautiful young flowers\nRather than desiring others' bodies, which are just cages of filth?",
        "58": "If you do not want to touch a place\nCovered with impurities such as vomit,\nWhy do you want to touch the body\nFrom which these impurities come?",
        "59": "If you are not attached to what is unclean,\nWhy do you embrace others' bodies,\nWhich come from impure blood and sperm\nWithin an unclean womb?",
        "60": "You have no desire for the body of an insect, however small,\nThat emerges from a pile of dung;\nSo why do you desire a gross, impure body\nThat is produced from thirty-six impure substances?",
        "61": "Not only do you not disparage\nThe impurity of your own body,\nBut, out of attachment to what is unclean,\nYou desire other bags of filth!",
        "62": "Even pure medicinal herbs\nAnd delicately cooked rice or vegetables\nWill defile the ground on which they land\nIf they are spat out after having been in the mouth.",
        "63": "Although the impurity of the body is obvious,\nIf you still have doubts, go to a burial ground\nAnd reflect on the impurity of the corpses\nThat have been abandoned there.",
        "64": "Once you have understood\nThat, when the skin is removed,\nThe body gives rise to great aversion,\nHow can you ever derive pleasure from it again?",
        "65": "The fragrance of another's body comes from other sources,\nSuch as the sandalwood with which it is anointed;\nSo why are you attracted to a body\nBecause of scents that are not its own?",
        "66": "Since in its natural state the body smells foul,\nWould it not be better to have no attachment for it?\nWhy do those who crave the meaningless things of this world\nAnoint this body with perfume?",
        "67": "If the scent comes from perfume, such as sandalwood,\nHow can it come from the body?\nWhy be attached to others\nBecause of a scent that is not theirs?",
        "68": "When left naked in its natural state,\nThe body is hideous, with long hair and nails,\nFoul-smelling, yellowing teeth\nAnd a pervasive stench of dirt.",
        "69": "Putting so much effort into beautifying it\nIs just like polishing a sword that will be used to harm you.\nIt seems the whole world is pervaded by this madness\nBecause people believe beauty is only external.",
        "70": "Having contemplated the piles of bones in the burial ground,\nOnce we turn our mind elsewhere\nAnd see graveyard cities full of moving bones,\nHow can we find pleasure in them?",
        "71": "Furthermore, we do not come to enjoy others' bodies\nWithout acquiring material possessions.\nWe exhaust ourself in non-virtuous activities to gather these,\nOnly to experience suffering in this life and the lower realms in the next.",
        "72": "When we are young, we do not have the resources to support a partner;\nAnd later we are so busy that there is no time to enjoy ourself.\nWhen at last we have accumulated the resources we need,\nWe are too old to indulge our desires!",
        "73": "Some, under the influence of desire, work like slaves.\nThey tire themselves out working long days\nAnd, when they return home in the evening,\nTheir exhausted bodies collapse like corpses.",
        "74": "Some have to experience the disruptions of travel\nOr suffer from being far from home.\nAlthough they long to be close to their partners,\nThey do not see them for years at a time.",
        "75": "Some, confused about how to earn what they desire,\nEffectively sell themselves to others.\nEven then they do not get what they want\nBut are driven without meaning by the needs of others.",
        "76": "Then there are those who sell themselves into servitude\nAnd work for others without any freedom.\nThey live in lonely, desolate places\nWhere their children are born with only trees for shelter.",
        "77": "Deceived by desire, people become fools.\nSome think, 'I need money to support my life',\nAnd, although they fear for their lives, go off to war;\nWhile others enslave themselves for the sake of profit!",
        "78": "Some, as a consequence of their desires,\nSuffer cuts to their bodies\nOr are stabbed, impaled\nOr even burned.",
        "79": "We should realize that a preoccupation with wealth leads to endless problems\nBecause acquiring it, protecting it and losing it all involve pain.\nThose who allow themselves to become distracted out of attachment to wealth\nWill find no opportunity to escape from the miseries of samsara.",
        "80": "People attached to a worldly life\nExperience many such problems, and for little reward.\nThey are like a horse forced to pull a cart,\nWho can grab only an occasional mouthful of grass to eat.",
        "81": "Those who are driven by uncontrolled desires\nWaste this precious freedom and endowment, so hard to find,\nFor the sake of a few petty rewards that are in no way rare,\nFor even animals can obtain them.",
        "82": "Our objects of desire will definitely perish,\nAnd then we shall fall into the lower realms.\nIf we consider all the hardships we have endured since beginningless time\nIn pursuing meaningless worldly pleasures,",
        "83": "We could have attained the state of a Buddha\nFor a fraction of the difficulty!\nWorldly beings experience much greater suffering than those who follow the path to enlightenment \"“\nAnd yet they do not attain enlightenment as a result!",
        "84": "If we consider the sufferings of hell and so on,\nWe shall see that the discomforts endured by worldly people in this life \"“\nSuch as those caused by weapons, poison, enemies or treacherous places \"“\nBear no comparison in their severity.",
        "85": "Thus, having become disillusioned with worldly desires,\nWe should generate the wish to abide in solitude.\nFortunate ones stroll in quiet and peaceful places,\nFar away from all conflict and objects of delusion.",
        "86": "Cooled by flower-scented moonlight\nAnd fanned by peaceful, silent breezes,\nThey abide joyfully without distraction,\nWith their minds focused on benefiting others.",
        "87": "They dwell for as long as they wish\nIn empty houses, beneath trees, or in remote caves.\nHaving abandoned the pain of clinging to and guarding possessions,\nThey live independently, free from all cares.",
        "88": "They live freely without attachment\nAnd unbound by any relationships.\nEven the most powerful humans and gods\nCannot find a life as contented and happy as this!",
        "89": "Thus, having contemplated\nThe good qualities of solitude,\nI should completely pacify all disturbing conceptions\nAnd meditate on bodhichitta.",
        "90": "First, I should apply myself to meditation\nOn the equality of self and others.\nBecause we are all equal in wanting to experience happiness and avoid suffering,\nI should cherish all beings as I do myself.",
        "91": "Although there are many different parts of the body, such as the arms and the legs,\nWe protect all these parts as equally as we protect the body itself.\nIn a similar way, although there are many different living beings,\nI should cherish them all as equally as I cherish myself.",
        "92": "The suffering I experience\nDoes not harm others,\nBut I find it hard to bear\nBecause I cherish myself.",
        "93": "Likewise, the suffering of others\nDoes not harm me,\nBut, if I cherish others,\nI shall find their suffering hard to bear.",
        "94": "Therefore, I should dispel others' suffering\nSimply because it is suffering, just like mine;\nAnd I should bring happiness to others\nSimply because they are living beings, just like me.",
        "95": "If both I and others\nAre the same in that we wish for happiness,\nWhat is so special about me\nThat I work only for my own happiness?",
        "96": "And if both I and others\nAre the same in that we wish to avoid suffering,\nWhat is so special about me\nThat I protect myself but not others?",
        "97": "But why should I protect others\nIf their suffering does me no harm?\nIf we cherish only others, we find their suffering hard to bear;\nSo we definitely need to protect them.",
        "98": "It is not a wrong conception to think\nThat it will be I who experiences the future suffering,\nBecause it will not be another person who dies\nAnd yet another who is reborn.",
        "99": "'Surely, whenever there is suffering,\nIt should be dispelled by whoever is experiencing it.'\nThen, since the suffering of the foot is not the hand's,\nWhy should the hand help to alleviate it?",
        "100": "We alleviate the suffering of the foot with the hand\nBecause it is a specific method to relieve this pain.\nIt is also incorrect to grasp at an independent self and others \"“\nSuch grasping should be completely abandoned.",
        "101": "Things that we call 'continuums' or 'collections',\nSuch as rosaries or armies, are falsely existent.\nThus, there is no independent possessor of suffering,\nFor who is there who has control over it?",
        "102": "Since there is no independent possessor of suffering,\nThere is no real difference between my own and others' suffering.\nThus, we should dispel all suffering simply because it is painful \"“\nWhy cling to false distinctions with such certainty?",
        "103": "'There is no need to dispel everyone else's suffering!'\nThis is not a valid argument.\nIf my suffering should be dispelled, so should everyone else's;\nAnd if others' suffering should not be dispelled, neither should mine.",
        "104": "'But such compassion will bring me suffering,\nSo why should I strive to develop it?'\nHow can compassion bring suffering?\nIt is the very nature of a peaceful mind!",
        "105": "If, through one person experiencing relatively little suffering,\nThe infinite sufferings of living beings can be eliminated,\nA kind-hearted Bodhisattva will gladly endure it\nAnd delight in working for others.",
        "106": "Thus, although the Bodhisattva Supushpachandra understood\nThat he would suffer at the hands of the king,\nHe did not seek to avoid his own death\nBut instead released many others from their suffering.",
        "107": "Because one whose mind is acquainted with the equality of self and others\nDerives great joy from relieving the suffering of others,\nFor their sakes, he or she would happily enter the deepest hell,\nJust like a wild goose plunging into a refreshing lotus pool.",
        "108": "The ocean of joy that will arise\nWhen all living beings are liberated\nIs everything I wish for \"“\nSo why should I wish for my solitary liberation?",
        "109": "But although I work for the benefit of others,\nI should do so without pride or pretension.\nMoved only by the joy of benefiting others,\nI should not hope for any reward.",
        "110": "And just as I protect myself\nFrom anything unpleasant, however small,\nSo should I act towards others\nWith a compassionate and caring mind.",
        "111": "Although there is no I there,\nThrough the force of familiarity\nI cling to an I within a body\nThat arose from the drops of others' sperm and blood.",
        "112": "In the same way, why can I not\nIdentify 'I' with the bodies of others?\nEqually, I should not find it hard\nTo identify 'other' with my own body.",
        "113": "Seeing the faults of cherishing myself\nAnd the many good qualities of cherishing others,\nI should completely forsake self-cherishing\nAnd become familiar with cherishing others.",
        "114": "Just as I regard the hands and so forth\nAs limbs of my body,\nSo should I regard all living beings\nAs limbs of a living whole.",
        "115": "Through the force of familiarity, I generate a mind\nThat grasps at I with respect to this non-self-existent body;\nSo why, through familiarity with cherishing others,\nShould I not develop a mind that grasps at I with respect to others' bodies?",
        "116": "Although I work for others in this way,\nI should not develop pride or pretension;\nAnd, just as when I feed myself,\nI should hope for nothing in return.",
        "117": "Therefore, just as I protect myself\nFrom anything unpleasant, however small,\nSo should I become familiar with\nA compassionate and caring mind towards others.",
        "118": "Out of his great compassion,\nArya Avalokiteshvara even blessed his own name\nTo relieve living beings from the fear of self-cherishing;\nSo I should recite his name mantra to receive his blessings.",
        "119": "Do not turn away from learning to cherish others because it is difficult.\nFor example, a person's lover may once have been her enemy, the mere sound of whose name induced fear;\nBut now through familiarity she cherishes him\nAnd becomes unhappy when he is not around.",
        "120": "Thus, whoever wants to swiftly protect\nBoth themselves and others\nShould practise this holy secret\nOf exchanging self with others.",
        "121": "Because we have attachment for our body,\nEven a small object of fear frightens us greatly;\nSo who would not revile as an enemy\nCherishing this body, which is the source of that fear?",
        "122": "Out of our wish to find remedies\nFor the body's hunger, thirst, and sickness,\nWe kill birds, fish, and other animals\nAnd even resort to attacking people!",
        "123": "Sometimes for money or other possessions\nWe might even kill our father or mother,\nOr steal the property of a spiritual community,\nAnd as a consequence burn in the fires of hell.",
        "124": "Who with wisdom would cherish oneself\nOr grasp at this body?\nWe should view the self-cherishing mind as a foe\nAnd despise it accordingly.",
        "125": "'If I give this to others, what shall I have to enjoy?'\nSuch self-cherishing is the mind of a hungry spirit.\n'If I enjoy this, what shall I have to give to others?'\nSuch cherishing of others is the mind of the enlightened ones.",
        "126": "If we harm others for the sake of our own happiness,\nWe shall suffer the torments of the lower realms;\nBut if we are harmed for the sake of others' happiness,\nWe shall experience the happiness of higher rebirth.",
        "127": "If we hold ourself in high esteem, we shall be reborn in the lower realms\nAnd later, as a human, experience low status and a foolish mind;\nBut if we transfer this esteem to others, we shall be reborn in fortunate realms,\nCommand respect, and enjoy good company and pleasant surroundings.",
        "128": "If we use others for our own selfish means,\nWe shall experience servitude ourself;\nBut if we use ourself for the sake of others,\nWe shall enjoy high status and pleasing forms.",
        "129": "All the happiness there is in this world\nArises from wishing others to be happy,\nAnd all the suffering there is in this world\nArises from wishing ourself to be happy.",
        "130": "But what need is there to speak at length?\nThe childish work only for themselves,\nWhereas the Buddhas work only for others \"“\nJust look at the difference between them!",
        "131": "If we do not exchange our happiness\nFor the suffering of others,\nWe shall not attain the state of a Buddha\nAnd even in samsara there will be no happiness.",
        "132": "Never mind what will happen in future lives;\nWith employees not providing adequate service\nOr employers not giving proper reward,\nEven our wishes in this life will remain unfulfilled.",
        "133": "By not cherishing others, we lose the excellent qualities of our human life\nThat allow us to attain happiness both now and in the future;\nAnd if we actually inflict harm on others,\nOut of ignorance we shall bring unbearable suffering upon ourself.",
        "134": "If all the torment in this world \"“\nAll mental fear and physical pain \"“\nArise from cherishing oneself,\nWhat use is this fearful spirit to us?",
        "135": "Without destroying fire,\nWe cannot stop being burned;\nLikewise, without destroying self-cherishing,\nWe cannot stop experiencing suffering.",
        "136": "Therefore, to eliminate my pain\nAnd pacify the suffering of others,\nI will give myself completely to others\nAnd consider them as precious as I now consider myself to be.",
        "137": "I completely dedicate myself to the happiness of others.\nFrom now on, mind, you must understand this clearly\nAnd not think of anything\nOther than benefiting all living beings.",
        "138": "Because my eyes and so forth are now at the disposal of others,\nI should not use them for my own purpose;\nNor should I use them in any way\nThat is contrary to the welfare of others.",
        "139": "Being principally concerned for others,\nI will take anything\nThat I regard as belonging to myself\nAnd use it to benefit them.",
        "140": "Putting myself in the place of those who are lower than, equal to, and higher than me,\nAnd then regarding my former self as 'other',\nWith my mind free from the crippling conception of doubt\nI should meditate on jealousy, competitiveness and pride.",
        "141": "'He is honoured, but I am not.\nI do not have the wealth he has.\nHe is praised, but I am despised.\nHe is happy, but I suffer.",
        "142": "'I have much heavy work to do,\nWhile he remains comfortably at rest.\nHis reputation has spread throughout the world,\nBut all I am known for is my lack of good qualities.",
        "143": "'But what do you mean, \"I have no good qualities?\"\nI have many such qualities.\nIn comparison with many, he is inferior,\nWhile there are many to whom I am superior.",
        "144": "'My morals, views, and so on degenerate\nThrough the force of my delusions, not because I want them to.\nYou, Bodhisattva, should help us regenerate them in any way that you can,\nAnd willingly forbear any hardships you might encounter in doing so.",
        "145": "'But he does nothing to help us,\nSo why does he make us feel so insignificant?\nWhat use are his so-called good qualities to us?\nHe never uses them for our benefit!",
        "146": "'Not only does he have no compassion\nFor beings such as us dwelling within the jaws of the lower realms;\nExternally he displays pride in his own good qualities\nAnd prefers to contend with the wise.'",
        "147": "'This Bodhisattva is regarded as my equal,\nBut so that I might outshine him\nI will acquire wealth and reputation,\nAnd defeat him in debate.",
        "148": "'I will proclaim my own good qualities to the whole world\nBy whatever means I can,\nBut I will make sure that no one ever hears\nOf any good qualities he might possess.",
        "149": "'I will hide my own faults but make his known.\nI will be venerated by others but ensure that he is not.\nI will acquire a great deal of material wealth\nAnd encourage others to honour me, but not him.",
        "150": "'For a long time, I will take pleasure\nIn seeing him be humiliated.\nI will make him the laughing stock of all\nAnd an object of ridicule and blame.'",
        "151": "'It is said that this deluded being\nIs vying to be my equal,\nBut how can he compare with me in learning or wisdom,\nOr in looks, status, or wealth?",
        "152": "'When others hear of my good qualities\nAs they are proclaimed to the world,\nMay they experience so much delight\nThat their hair pores tingle with excitement.",
        "153": "'And as for whatever he owns,\nSince he is supposed to be working for us,\nWe will allow him just what he needs\nAnd take the remainder by force for ourselves.",
        "154": "'Thus, may his happiness decline,\nWhile we continue to burden him with our problems.'\nCountless times in samsaric rebirths,\nThis self-cherishing attitude has caused me harm.",
        "155": "O mind, because you wish to benefit yourself,\nAll the hard work you have done\nFor countless aeons in samsara\nHas resulted only in suffering.",
        "156": "Therefore, I will definitely engage\nIn working for the benefit of others;\nAnd because Buddha's teachings are non-deceptive,\nI shall experience excellent results in the future.",
        "157": "If in the past I had practised\nExchanging myself with others,\nI would not now be in this situation \"“\nDevoid of the excellent happiness and bliss of Buddhahood.",
        "158": "Just as I am familiar with developing the thought 'I', 'I',\nWhen perceiving my body, which arose from others' sperm and blood,\nSo should I become familiar with developing the thought 'I', 'I',\nWhen perceiving others' bodies.",
        "159": "Examining myself thoroughly\nTo make sure I am working for others,\nI will take whatever I possess\nAnd use it to benefit them.",
        "160": "I am happy but others are sad;\nI have a high position but others are lowly;\nI benefit myself but not others \"“\nWhy am I not jealous of myself?",
        "161": "I must give my happiness to others\nAnd take their suffering upon myself instead.\nI should constantly examine my behaviour for faults\nBy asking, 'Why am I acting in this way?'",
        "162": "If others do something wrong,\nI will transform it into a fault of my own;\nBut if I cause even the slightest harm to others,\nI will declare it openly in the presence of many.",
        "163": "I should spread the fame of others farther,\nSo that it completely outshines my own;\nAnd, regarding myself as a lowly servant,\nEmploy myself in the service of all.",
        "164": "Being full of faults, I should not praise myself\nJust because of some superficial good quality.\nI will not let even a few people know\nOf any good qualities I might possess.",
        "165": "In short, may the harm I have caused others\nFor the sake of myself\nReturn and ripen upon me\nFor the sake of others.",
        "166": "I should not be domineering\nOr act in self-righteous ways.\nRather, I should be like a newly-wed\nWho is bashful, timid and restrained.",
        "167": "In this way, selfish mind, you should avoid non-virtue.\nIf you do not observe this discipline,\nI will bring you under control\nThrough the power of mindfulness and alertness.",
        "168": "However, if you choose not to act\nIn the way that you have been advised,\nSince you are the source of all my misfortune\nI will completely annihilate you.",
        "169": "The time when you could govern me\nHas been consigned to the past.\nNow that I see you to be the source of all my problems,\nI will eradicate you wherever you appear.",
        "170": "Now I will immediately cast aside\nAll thoughts to work for my own sake.\nO self-cherishing mind, I have sold you to others;\nSo stop complaining and get on with helping them!",
        "171": "If, out of non-conscientiousness,\nI were not to give you to others,\nYou would certainly deliver me\nTo the guardians of hell!",
        "172": "You have done this to me often enough in the past\nAnd, as a result, I have suffered for a very long time;\nBut now that I have brought to mind all my grudges towards you,\nI am determined to destroy you, selfish mind.",
        "173": "Thus, if I want happiness,\nI should not be happy with the self-cherishing mind;\nAnd if I want protection,\nI should always protect others.",
        "174": "To whatever extent I seek\nTo fulfil the desires of the body,\nTo that extent I shall experience\nA state of dissatisfaction.",
        "175": "The desires of the self-cherishing mind\nCannot be satisfied\nEven by all the wealth in the world \"“\nSo how can we hope to fulfil all its wishes?",
        "176": "When our desires are not fulfilled,\nWe develop delusions and a dissatisfied mind;\nBut whoever becomes free from such distracting concerns\nWill never know dissatisfaction.",
        "177": "Therefore, I will never allow\nThe desires of the body to increase.\nA person who has no attachment to attractive objects\nWill find contentment \"“ the best of all possessions.",
        "178": "My body is a frightening, impure form\nThat cannot move without depending upon mind\nAnd that eventually will completely disintegrate;\nSo why do I grasp at it as 'I'?",
        "179": "Whether it lives or dies,\nWhat use is it to me to grasp at this machine?\nIt is no different from grasping at a clod of earth;\nSo why do I not give up the pride of grasping 'my body'?",
        "180": "As a result of attending to the body's desires,\nI have experienced much suffering without real meaning.\nWhat is the point of generating anger or attachment\nFor the sake of something that is like a piece of wood?",
        "181": "Whether I care for it in the way that I do,\nOr allow it to be harmed by others,\nThe body itself develops neither attachment nor anger;\nSo why do I feel so attached to it?",
        "182": "Since the body itself does not know\nAnger when it is insulted\nOr attachment when it is praised,\nWhy do I go to so much trouble for its sake?",
        "183": "'But I want to cherish this body\nBecause it is very beneficial to me.'\nThen why not cherish all living beings,\nFor they are very beneficial to us?",
        "184": "Therefore, without any attachment,\nI will give up my body for the benefit of all;\nBut, although it might have many faults,\nI will look after it while I am working for others.",
        "185": "I will put a stop to all childish behaviour\nAnd follow in the steps of the wise Bodhisattvas.\nRecalling the instructions on conscientiousness,\nI will turn away from sleep, mental dullness and the like.",
        "186": "Just like the compassionate Sons and Daughters of the Conqueror Buddha,\nI will patiently apply myself to whatever needs to be done.\nIf I do not apply constant effort throughout the day and the night,\nWhen will my misery ever come to an end?",
        "187": "Therefore, to dispel both obstructions,\nI will withdraw my mind from all distracting conceptions\nAnd place it in constant meditative equipoise\nOn the perfect object of meditation, the correct view of emptiness.\nThis concludes the eighth chapter of Guide to the Bodhisattva's Way of Life, entitled 'Relying upon Mental Stabilization'."
      }
    },
    "9": {
      "title": "The Perfection of Wisdom",
      "verses": {
        "1": "Buddha taught all the method practices explained above\nTo enable us to complete the training in wisdom realizing emptiness.\nTherefore, those who wish to liberate themselves and others from suffering\nShould strive to develop this wisdom.",
        "2": "The two truths are explained as conventional truths and ultimate truths.\nUltimate truth, emptiness, is a non-affirming negative phenomenon\nThat cannot be realized directly by a mind that has dualistic appearance,\nFor such minds are conventional, and thus mistaken awareness.",
        "3": "Of those who assert the two truths, two types of person can be distinguished:\nMadhyamika-Prasangika Yogis and proponents of things.\nThe views held by the proponents of things, who assert that things are truly existent,\nAre refuted by the logical reasonings of the Prasangika Yogis.",
        "4": "Moreover, among the Prasangika Yogis, there are different levels of insight \"“\nThose with greater understanding surpassing those with lesser understanding.\nAll establish their view through valid analytical reasons.\nGiving and so forth are practised without investigation for the sake of achieving resultant Buddhahood.",
        "5": "When you proponents of things see things,\nYou do not recognize their illusion-like character\nBut assert them to be inherently existent.\nThis is where we Madhyamika-Prasangikas disagree with you.",
        "6": "Forms that we see directly are just mere appearance to mind.\nThey exist falsely because the way they appear\nDoes not correspond to the way they exist,\nJust as a human body is conventionally accepted as clean when in reality it is impure.",
        "7": "Buddha taught the impermanence of things\nTo lead people gradually to a realization of emptiness \"“\nThe lack of inherent existence of things.\n'Then it is incorrect to say that things exist even conventionally.'",
        "8": "No, there is no fault, because things exist by conventional valid cognizers.\nFrom the point of view of worldly people, seeing things is seeing reality;\nBut worldly people never actually see reality\nBecause the real nature of things is their emptiness.",
        "9": "Just as you receive merits you consider to be truly existent from making offerings to a Buddha you consider to be truly existent,\nSo we receive illusion-like merits from making offerings to an illusion-like Buddha.\n'If, as you say, living beings lack true existence and are like illusions,\nHow can they take rebirth after they die?'",
        "10": "Provided all the necessary conditions are assembled,\nEven an illusion will come into being.\nWhy, simply by virtue of their longer duration,\nShould living beings be any more true?",
        "11": "Killing an illusion incurs no actual karma of killing\nBecause an illusion has no mind,\nBut benefiting or harming an illusion-like person who has an illusion-like mind\nGives rise to merit and negativity respectively.",
        "12": "Because the mantras and so forth that cause an illusion cannot produce mind,\nAn illusion does not develop a mind.\nDifferent types of cause\nGive rise to different types of illusion.",
        "13": "There does not exist a single cause that is capable of\nGiving rise to a variety of different results.\n'If, as you say, nirvana is not truly existent,\nBut samsara exists conventionally,",
        "14": "'Then Buddha must be in samsara because nirvana does not exist;\nSo what is the point of practising the Bodhisattva's way of life?'\nEven an illusion does not cease if the continuum of its causes is not cut,\nBut once the continuum of samsara's causes, delusions, is severed,",
        "15": "Samsara will not occur, even conventionally.\nSince Buddhas have done this, they have attained nirvana.\n'The illusion-like forms that you assert do not exist,\nBecause you assert that illusion-like awareness lacks true existence.'",
        "16": "Since for you Chittamatrins such illusion-like forms do not exist,\nHow do forms exist?\n'Although forms do not exist as external objects, they do exist in another way \"“\nA form is an aspect, the nature of the mind to which it appears.'",
        "17": "You Chittamatrins assert that mind itself appears in the aspect of form.\nIf this is so, how does the mind arise?\nBuddha, the Protector of the World, has said\nThat the mind cannot behold itself.",
        "18": "For example, just as the blade of a sword cannot cut itself,\nSo a mind cannot behold itself.\n'On the contrary, just as a lamp can illuminate both itself and the objects around it,\nSo the mind can behold both itself and other phenomena.'",
        "19": "If a lamp illuminates itself, then darkness obscures itself,\nAnd it follows that no one can see darkness because it is obscured!\n'When clear crystal turns blue, it does so in dependence upon something else;\nBut lapis lazuli is by nature blue \"“ it does not depend upon anything else to appear blue.",
        "20": "'Similarly, some awarenesses are related to objects other than themselves,\nWhereas others, such as self-cognizers, are not.'\nThe blueness of lapis lazuli does not exist without depending upon anything else \"“\nIt does not create its own nature!",
        "21": "'Even though a lamp does not illuminate itself, it is the nature of illumination.'\nThen you should say that mind does not know itself\nBut is the nature of conscious illumination.\nHowever, you cannot say that it is known by a mind that is substantially different from itself.",
        "22": "According to you, if there is no truly existent awareness that knows mind,\nThen mind does not exist;\nIn which case it makes no more sense to discuss whether the mind illuminates itself or not\nThan it does to discuss the looks of the daughter of a childless person.",
        "23": "'If self-cognizers do not exist,\nHow do we remember subjective consciousness?'\nWhen we remember the object experienced, we remember the consciousness related to it,\nJust as we would recall being poisoned by an animal bite when we experienced the pain that subsequently occurred.",
        "24": "'If people who have attained states such as tranquil abiding can see the minds of others far away,\nSurely one can see one's own mind, which is very close.'\nPeople who apply magical eye lotion can see treasure vases deep beneath the ground,\nBut they cannot see the lotion!",
        "25": "We have no intention of refuting the existence of\nEye awareness, ear awareness or any other awareness.\nWhat needs to be abandoned is the awareness that grasps at truly existent forms and so forth,\nWhich is the fundamental cause of all suffering.",
        "26": "'Illusion-like forms are not other than the mind,\nBut neither can they be considered to be one with the mind.'\nIf they are true, why say they are not other than the mind?\nAnd if they are not other than the mind, why say they are true?",
        "27": "Just as illusion-like forms lack any true existence,\nSo it is with the mind that beholds them.\n'Samsara, like all imputed objects, must have something substantial as its basis;\nOtherwise, it would be completely empty, just like space.'",
        "28": "If imputed phenomena, such as samsara, had truly existent bases,\nHow could you ever become bound in samsara and how could you ever escape from it?\nAccording to you, mind cannot be an apprehender related to something it apprehends;\nRather, it must be an isolated cognition of itself.",
        "29": "If the mind exists inherently, or independently,\nThen it is already free from all defilements,\nAnd it follows that all living beings are already enlightened!\nSo what is the point of teaching that everything is just the nature of mind?",
        "30": "'How does realizing that all phenomena are like illusions\nEliminate delusions?\nAfter all, a magician who creates an illusion of a woman\nCan still develop attachment for that illusory woman.'",
        "31": "This is because the magician has not abandoned\nThe deluded tendency to grasp at true existence.\nThus, when he beholds the illusory woman,\nHis tendency to perceive her emptiness is very weak.",
        "32": "By developing acquaintance with the view of emptiness,\nWe shall eventually abandon grasping at true existence;\nAnd especially by meditating on the emptiness of emptiness,\nWe shall come to abandon grasping at emptiness itself as being truly existent.",
        "33": "When it is said that 'No thing exists',\nThis means that truly existent things do not exist;\nSo how could a mind grasping at the true existence of that emptiness remain\nWhen the basis for such a misconception \"“ grasping at true existence \"“ has been removed?",
        "34": "Eventually, when the true existence of things and the true existence of emptiness\nNo longer appear to the mind,\nSince there is no other aspect of true existence,\nThe mind will abide in the resultant pacified state in which all conceptuality has ceased.",
        "35": "Just as wishfulfilling jewels and wish-granting trees fulfil the hopes of humans and gods\nEven though they have no conceptual mind,\nSo, through the force of the prayers they previously made and the merit accumulated by fortunate beings,\nBuddhas manifest physical forms in this world.",
        "36": "For example, although the Brahmin who consecrated\nThe substance in the reliquary known as the 'Garuda'\nHas long since passed away,\nThe reliquary continues to alleviate poisons and so forth.",
        "37": "In a similar fashion, a Bodhisattva, while training on the path,\nCreates the 'reliquary' of a Buddha through his collections of merit and wisdom;\nAnd, although he eventually passes beyond sorrow,\nHe continues to bestow both temporary and ultimate benefits upon all living beings.",
        "38": "'But if Buddha has no conceptual mind,\nHow can there be meritorious results from making offerings to him?'\nIt is said in the scriptures that the results will be the same\nWhether the Buddha to whom we make offerings is living or has passed away.",
        "39": "Moreover, the scriptures say that the results we receive depend upon our degree of faith,\nWhether we think Buddha is conventionally or ultimately existent when we make the offerings.\nJust as you receive merits from making offerings to a Buddha you consider to be truly existent,\nSo do we receive merits from making offerings to an illusion-like Buddha.",
        "40": "'Since we can attain liberation by gaining a direct realization of the four noble truths,\nWhat is the point of striving to realize emptiness, lack of true existence?'\nIt is necessary because the scriptures explain that without the path of wisdom realizing this emptiness,\nIt is impossible to attain even the small enlightenment of self-liberation.\n(41-4)\t'Because we do not believe in the Mahayana, your quoting from Mahayana scriptures is pointless.'\nWe both believe that the Hinayana scriptures are valid;\nSo you should apply your reasons for believing the Hinayana equally to the Mahayana.\nThus, we understand that both are the holy Dharma taught by Buddha himself.\nBecause they do not understand its profundity,\nThe Vaibhashika schools deny the Mahayana;\nAnd because they do not believe in nirvana,\nSome non-Buddhist schools deny the Hinayana.\nBuddha's purpose in teaching both the Mahayana and the Hinayana\nWas to lead living beings to permanent liberation from the cycle of suffering.\nFocusing on this ultimate aim, practitioners of both the Mahayana and the Hinayana\nEmphasize the three higher trainings of moral discipline, concentration and wisdom.",
        "45": "Buddha gave his teachings as medicine to cure the disease of the delusions, the cause of all suffering.\nSome of his teachings are simple and others are very profound.\nIf you do not understand his higher, more profound teachings,\nYou should not simply conclude that they were not taught by Buddha.",
        "46": "The great Master Kashyapa gathered many of Buddha's teachings,\nPrincipally the Perfection of Wisdom Sutras, Buddha's Mahayana teachings.\nHowever, the Vaibhashika schools do not understand the profound meaning of the Perfection of Wisdom Sutras;\nThus, they conclude that these Sutras are not Buddha's teachings.",
        "47": "The principal holders of Buddhadharma were said to be those who have attained nirvana, the Arhats;\nBut the Arhats that you proponents of things assert\nCannot be real Arhats because, according to your view,\nTheir minds still grasp at truly existent things.",
        "48": "'They attained nirvana, or liberation, and became Arhats because they abandoned their delusions.'\nYou seem to think that, simply by abandoning manifest delusions, one immediately becomes an Arhat;\nBut it is clear that even though a person might have temporarily abandoned manifest delusions,\nNevertheless, he or she still bears the karmic potentials to be reborn in samsara.",
        "49": "'The abandonment that Arhats achieve is not temporary. They definitely do not take rebirth in samsara again\nBecause they completely abandon craving, the principal cause of such rebirth.'\nBut just as you say that they have non-deluded confusion,\nWhy not also say that they have non-deluded craving?",
        "50": "These so-called Arhats have pleasant feelings\nThat they apprehend to be truly existent.\nBecause of feeling, craving develops \"“\nSo they must be subject to the craving.",
        "51": "Although for a person who has not realized emptiness \"“ the lack of truly existent things \"“\nManifest delusions might be temporarily abandoned, eventually they will manifest again,\nJust as feelings and discriminations return when the concentration on the absorption without discrimination ends.\nTherefore, you must strive to realize emptiness to attain even solitary liberation.",
        "52": "The result of a Bodhisattva's meditation on emptiness\nIs the ability to remain in the abodes of samsara\nOut of compassion for those who suffer due to confusion,\nAnd free from the extremes of attachment and fear.",
        "53": "Since the realization of emptiness is the antidote that removes the darkness\nOf the delusion-obstructions and the obstructions to knowing,\nWhy do those who wish to attain enlightenment\nNot meditate on emptiness right away?",
        "54": "Thus, it is quite inappropriate to cast aspersions\nOn those who hold the view of emptiness;\nRather, you should meditate without any doubt\nOn emptiness, lack of true existence.",
        "55": "By all means, be afraid of something\nThat is the principal cause of samsaric suffering;\nBut, since meditation on emptiness eliminates this suffering,\nWhy should you be afraid of emptiness?",
        "56": "If there were a truly existent I,\nIt would make sense to be afraid of certain things;\nBut, since there is no truly existent I,\nWho is there to be afraid?",
        "57": "The teeth, hair or nails are not the I,\nNor are the bones or blood.\nThe mucus and phlegm are not the I,\nNor are the lymph or pus.",
        "58": "The body's fat or sweat are not the I,\nNor are the lungs or liver.\nNone of the other inner organs is the I,\nNor are the excrement or urine.",
        "59": "The flesh or skin are not the I,\nNor are the body's warmth or winds.\nThe space element of the body is not the I,\nNor are any of the six consciousnesses.",
        "60": "If, as the Samkhya school asserts, a permanent consciousness is the I,\nThen the consciousness that enjoys sound is also permanent;\nBut how can it continue to enjoy sound\nWhen the object, sound, is no longer present?",
        "61": "If it can be a subjective consciousness even though its object does not exist,\nThen it follows that even a piece of wood can be a subjective consciousness.\nNothing can be established as a consciousness\nIf there is no object of which to be conscious.",
        "62": "'When no sound is present, the consciousness enjoys other objects such as visual forms.'\nBut if it is permanent, why does it not continue to apprehend sound?\n'Because there is no sound in the vicinity at that time.'\nWell, if there is no object, sound, then there is no subjective apprehender of sound!",
        "63": "Moreover, how can an awareness whose nature it is to apprehend sound\nAlso be an awareness whose nature it is to apprehend visual forms?\n'It is like one person who can be considered to be both a father and a son.'\nBut this is mere imputation; he is not by nature both.",
        "64": "The analogy of father and son does not work for you Samkhyas.\nAccording to you, the independent creator of all manifests all forms.\nThus, father and son must be one nature, as must an apprehender of sound and an apprehender of visual forms \"“\nBut such things are not seen by a valid mind.",
        "65": "'It is like an actor changing roles and being seen in different aspects.'\nWell, if the I changes in this way, it cannot be permanent!\n'Although the aspects change, its nature remains one and the same.'\nBut you cannot establish an unchangeable nature of the I, because you deny the ultimate nature of I, the lack of a truly existent I.",
        "66": "'The different aspects are not true, only their nature is.'\nIf the aspects are not true, why say their nature is true?\n'Their nature is true and the same in that they are both merely conscious apprehenders.'\nWell then, all living beings must be one and the same because they are all conscious apprehenders.",
        "67": "Moreover, it follows that animate and inanimate phenomena must be one and the same,\nAs creations of the general principle, the independent creator of all.\nIf all the particular aspects are false,\nHow can their basis, their nature, be true?",
        "68": "The material I asserted by materialists also cannot be the I,\nBecause it is devoid of mind, just like a jug.\n'But it has a relationship with mind and so it can know objects.'\nWhen the self, or I, comes to know something, the former self that did not know ceases;",
        "69": "But if, as you say, the self is permanent and unchanging,\nHow can it form a relationship with mind and become a knower?\nSaying that the self is devoid of mind and unable to function\nIs like saying that space is the self, or I!",
        "70": "'If the self were not permanent but perished in the next moment,\nThere would be no relationship between actions and their effects\nBecause, if the self perished the moment it committed an action,\nWho would there be to experience its fruits?'",
        "71": "There is no point in our arguing about this,\nBecause we both assert that the continuum of a person who commits an action\nIs not different from the continuum of the person who experiences its effect;\nBut at the time of experiencing the effect, the person who committed the causal action no longer exists;",
        "72": "And at the time of committing the causal action,\nIt is impossible to see the person experiencing the effects.\nBoth the committer of the action and the experiencer of its effects\nAre merely imputed upon a single continuum of a collection of aggregates.",
        "73": "Neither the mind of the past nor the mind of the future is the self,\nBecause the former has ceased and the latter has yet to be produced.\n'But surely the mind arising in the present moment is the self.'\nIf it were, then the self would not exist in the next moment!",
        "74": "If you peel away the layers of the trunk of a plantain tree,\nYou will never discover anything substantial.\nIn the same way, if you conduct a detailed analysis,\nYou will never be able to find a self, or I.",
        "75": "'If living beings have no true existence,\nFor whom can we develop compassion?'\nWe promise to achieve the goal of Buddhahood\nFor the sake of those whom ignorance imputes as truly existent.",
        "76": "'If living beings do not truly exist, who will gain the results of meditating on compassion?'\nIt is true that the cause, meditation on compassion, and the result, Buddhahood, do not truly exist; but they do exist nominally.\nThus, so that the suffering of all living beings may be completely pacified,\nWe should not reject the nominally existent compassion which leads to that result.",
        "77": "It is suffering and its causes that need to be abandoned,\nAnd it is the ignorance of self-grasping that causes delusions and suffering to increase.\n'But there is no way to abandon self-grasping so that it will never recur.'\nOn the contrary, meditation on selflessness, or emptiness, is the supreme method for accomplishing this.",
        "78": "Neither the feet nor the calves are the body,\nNor are the thighs or the loins.\nNeither the front nor the back of the abdomen is the body,\nNor are the chest or the shoulders.",
        "79": "Neither the sides nor the hands are the body,\nNor are the arms or the armpits.\nNone of the inner organs is the body,\nNor is the head or the neck.\nSo where is the body to be found?",
        "80": "If you say that the body is distributed\nAmong all its different parts,\nAlthough we can say that the parts exist in the parts,\nWhere does a separate possessor of these parts abide?",
        "81": "And if you say that the entire body exists\nWithin each part, such as the hand,\nIt follows that there are as many bodies\nAs there are different parts!",
        "82": "If a truly existent body cannot be found either inside or outside the body,\nHow can there be a truly existent body among the parts such as the hands?\nAnd since there is no body separate from its parts,\nHow can there be a truly existent body at all?",
        "83": "Therefore, there is no body,\nBut, because of ignorance, we see a body within the hands and so forth,\nJust like a mind mistakenly apprehending a person\nWhen observing the shape of a pile of stones at dusk.",
        "84": "For as long as the causes of mistaking the stones for a person are present,\nThere will be a mistaken apprehension of the body of a person.\nLikewise, for as long as the hands and so forth are grasped as truly existent,\nThere will be an apprehension of a truly existent body.",
        "85": "Just as the body lacks true existence, so do its parts such as the hands;\nFor they too are merely imputed upon the collection of their parts, the fingers and so forth.\nThe fingers, in turn, are merely imputed upon the collection of their parts, such as the joints;\nAnd, when the joints are separated into their parts, they too are found to lack true existence.",
        "86": "The parts of the joints are merely imputed upon a collection of atoms,\nAnd they, in turn, are merely imputed upon their directional parts.\nSince the directional parts, too, can be further divided,\nAtoms lack true existence and are empty, like space.",
        "87": "Therefore, what intelligent person\nWould develop attachment for this dream-like form?\nAnd since there is no truly existent body,\nWho is truly existent male and who is truly existent female?",
        "88": "If painful feelings are truly existent, they can never be changed,\nAnd it follows that living beings never experience pleasant feelings.\nAnd if pleasant feelings are truly existent,\nWhy do delicious tastes not bring joy to one who is grieving?",
        "89": "'Such a person does develop pleasant feelings, but he or she does not experience them\nBecause they are suppressed by the strength of the painful feelings.'\nHow can there possibly be a feeling\nThat is not experienced?",
        "90": "'When a strong pleasant feeling occurs, there is still a subtle painful feeling.\nThe gross feeling of pain is dispelled, and the subtle pain that remains\nBecomes the nature of a subtle pleasant feeling.'\nWell then, that subtle feeling is a pleasant feeling, not a painful one!",
        "91": "'So what you are saying is that painful feelings do not occur at that time\nBecause the delicious taste is a cause of their opposite \"“ pleasant feelings.'\nWhether it is a cause of pleasant or painful feelings depends merely upon conceptual imputation;\nThus, feelings are established as having no inherent existence.",
        "92": "The antidote that abandons grasping at truly existent feelings\nIs meditation on and analysis of lack of true existence.\nThe superior seeing that arises from analysis of this emptiness, conjoined with tranquil abiding,\nIs the food that nourishes the Yogi's realizations.",
        "93": "If there is space between the partless particles of a sense power and those of its object,\nHow can you maintain that they have met?\nBut if there is no space between them, they must mix and become completely one;\nIn which case, what is it that meets with what?",
        "94": "But one partless particle could never penetrate another\nBecause they would both be equal in size without any empty space inside.\nWithout penetrating, they could not mix;\nAnd without mixing, they could not meet.",
        "95": "To say that two partless things can meet\nIs completely illogical.\nIf it were possible, you would be able to detect it;\nSo please show me an example!",
        "96": "There can be no truly existent meeting between consciousness and form\nBecause consciousness has no material qualities.\nMoreover, as we explained previously, there is no truly existent collection;\nSo there is no truly existent collection of material particles with which to meet.",
        "97": "Thus, if contact is not truly existent,\nThe feeling that arises from it must also lack true existence.\nSo why exhaust yourself pursuing pleasant feelings?\nAnd, if there are no truly existent painful feelings, who can be harmed by what?",
        "98": "If there are no truly existent feelings,\nThere is no truly existent person to experience them.\nSeeing this to be the case,\nWhy do we not abandon our craving?",
        "99": "All objects of consciousness that give rise to feelings \"“ from visual forms to tactile objects \"“\nAre like dreams and illusions, utterly devoid of true existence.\nIf the mind experiencing feelings is truly existent,\nIt cannot experience any feelings that arise simultaneously with it.",
        "100": "Moreover, even if you assert that it can remember feelings that have passed, it cannot experience them;\nAnd it cannot experience feelings that have yet to arise because they do not exist.\nSo, feelings cannot experience themselves,\nAnd no truly existent other consciousness can experience them either.",
        "101": "Thus, since the person who experiences feelings does not truly exist\nAnd feelings themselves do not truly exist,\nHow can this selfless collection of aggregates\nBe harmed or benefited by painful or pleasant feelings?",
        "102": "Mental consciousness cannot be found in the six powers,\nIn the six objects of consciousnesses, such as forms, or in the collection of the two.\nIt cannot be found either inside or outside of the body,\nNor can it be found anywhere else.",
        "103": "Mental consciousness is neither the body nor inherently other than the body.\nIt is not mixed with the body, nor is it entirely separate from it.\nIt is not the slightest bit truly existent.\nThis lack of true existence, the emptiness of the mind, is called the 'natural state of nirvana'.",
        "104": "If a sense awareness exists prior to its object,\nWhat is it aware of?\nIf it arises simultaneously with its object,\nIn dependence upon what object does it arise?",
        "105": "And if a sense awareness is truly existent,\nHow can it arise subsequently in dependence upon an object condition?\nIn this way, we can understand\nThat all six consciousnesses lack true existence.",
        "106": "'Well then, it follows that phenomena cannot exist even conventionally,\nIn which case your presentation of the two truths is invalid.\nMoreover, if conventional truths are merely imputed by mistaken minds,\nHow can living beings pass beyond sorrow even nominally?'",
        "107": "According to our system, to exist conventionally\nDoes not mean to be imputed by a mind grasping at true existence.\nA conventional truth, such as body, is imputed by a valid conceptual mind having perceived a valid basis of imputation.\nWithout such imputation by a valid mind, there would be no conventional truths.",
        "108": "The imputing mind and the object imputed\nAre established in mutual dependence upon each other.\nEach distinct phenomenon is posited by an analytical mind\nAccording to what is validly known in the world.",
        "109": "'When an analytical mind realizes an object to be non-truly existent,\nAnother analytical mind must analyze that mind to realize that it too is non-truly existent.\nThat analytical mind, in turn, must be analyzed by another,\nAnd so the process is endless, which is absurd.'",
        "110": "When a valid mind directly realizes the lack of true existence of all phenomena,\nThe true existence of that mind is implicitly negated at the same time.\nThis non-true existence of both subject and object\nIs also called the 'natural state of nirvana'.",
        "111": "Despite your attempts, you Chittamatrins are unable to establish\nThe true existence of the apprehending mind and the object apprehended.\n'On the contrary, forms, for example, are truly existent because consciousness apprehends them to be so.'\nHow can you establish anything with a consciousness that is truly existent?",
        "112": "'We can establish that consciousness is truly existent because the objects it apprehends are truly existent.'\nIf you say this, on what basis is the true existence of these objects established,\nGiven that they and the consciousness that apprehends them are mutually dependent?\nSurely this demonstrates that both consciousness and its object lack true existence.",
        "113": "For example, if a man has no child, he cannot be a father;\nAnd if there is no father, how can there be a child?\nSince without a child, there is no father, they are mutually dependent and therefore neither is truly existent.\nIt is likewise with consciousness and its object.",
        "114": "'From the fact that a truly existent sprout arises from a seed,\nWe can understand the true existence of the seed.\nSo why, from the fact that a truly existent consciousness arises from an object,\nCan we not understand that the object too is truly existent?'",
        "115": "It is true that the existence of a seed can be inferred from the existence of its sprout\nBy a consciousness that is substantially distinct from that sprout;\nBut what consciousness can cognize a truly existent consciousness\nThat, according to you, indicates the true existence of its object?",
        "116": "Even worldly people can see clearly\nThat most things arise from causes.\nThe different types of coloured lotus, for example,\nArise from a variety of different causes.",
        "117": "'And what gave rise to that variety of causes?'\nA previous variety of causes.\n'But how does a distinct cause give rise to a distinct effect?'\nEach effect is produced from a specific potentiality in its preceding cause.",
        "118": "If you Samkhyas want to say that Ishvara is the creator of all things,\nThen please explain who or what Ishvara is.\n'He is basically the nature of the four great elements.'\nThen why go to the trouble of giving them the name 'Ishvara'?",
        "119": "Since the elements such as earth are multiple substances,\nImpermanent, unmoved by mind, non-divine\nAnd something trodden upon and unclean,\nThey cannot possibly be Ishvara.",
        "120": "Space is not Ishvara because it cannot produce anything,\nAnd a permanent self cannot be Ishvara because this has already been refuted.\n'Although he is the creator, Ishvara is unknowable.'\nWhat is the point of talking about something that cannot be known?",
        "121": "Precisely what is it that Ishvara is supposed to create?\n'He creates the world, living beings, and his own subsequent continuum.'\nBut if this is so, how did such an independent creator himself develop?\nMoreover, consciousness is produced from its previous continuum,",
        "122": "And, since beginningless time, happiness and suffering have been created by karma, or actions.\nSo, tell us, what does Ishvara create?\nIf the cause has no beginning,\nThe effect must also have no beginning.",
        "123": "So why, if their production does not depend upon other conditions,\nAre effects such as happiness and suffering not constantly produced without interruption?\nAnd if, as you say, there is nothing other than phenomena created by Ishvara,\nUpon what conditions does Ishvara depend when he creates an effect?",
        "124": "If a collection of causes and conditions produces an effect,\nThat effect is not produced by Ishvara.\nIf the causes and conditions are assembled, even Ishvara does not have the power to prevent the effect being produced;\nAnd, if they are not assembled, he cannot possibly produce that effect.",
        "125": "If effects such as suffering are produced without Ishvara's wishing for them,\nIt follows that they are produced through the power of something other than him.\nYou say that all effects are produced according to Ishvara's wishes,\nBut those wishes have no power to produce all things, so how can Ishvara be the creator of everything?",
        "126": "The assertion that the world and living beings are produced from permanent partless particles\nHas already been refuted.\nYou Samkhyas assert that the creator is\nThe permanent general principle.",
        "127": "You describe this general principle as a balanced state\nOf three qualities: lightness, activity and darkness,\nWhich should be understood as the feelings of indifference, pleasure and pain.\nUnbalanced states of these, you say, are the manifestations that constitute the world.",
        "128": "If the general principle, the independent creator of all, has a threefold nature,\nIt is neither singular nor plural, and therefore does not exist.\nSimilarly, the individual qualities cannot exist\nBecause you say that each of them is a composite of the three qualities.",
        "129": "If the three qualities do not exist, the general principle does not exist,\nIn which case it is impossible to establish its manifestations such as visual forms and sounds.\nAnd it is simply impossible for mindless things, such as clothing,\nTo have the same nature as feelings, such as happiness.",
        "130": "'All things truly exist in the nature of their causes.'\nBut we have already thoroughly refuted the possibility of truly existent things.\nAccording to you, clothing and the like arise from the general principle, which is a balanced state of pleasure and so forth;\nBut this cannot be the case, because we have refuted the existence of such a general principle.",
        "131": "In fact, feelings such as pleasure arise from things such as wearing clothing;\nAnd when these causes are lacking, their effects \"“ pleasure and so forth \"“ do not occur.\nIf the general principle were permanent, its nature of pleasure, for example, would also be permanent;\nBut this has never been seen by a valid cognizer.",
        "132": "If pleasure were permanent, it would always be manifest;\nSo why is it not experienced when pain is manifest?\n'At those times, the gross feeling of pleasure becomes subtle.'\nHow can something that is permanent change from gross to subtle?",
        "133": "Something that abandons a gross state and becomes subtle\nIs at one time gross and at another time subtle, and therefore impermanent.\nIn the same way, you should assert\nThat all functioning things are impermanent.",
        "134": "If gross pleasure is not different from pleasure itself,\nThen clearly pleasure, and therefore the general principle, are impermanent.\nYou assert that a manifest phenomenon does not exist at the time of its cause\nAnd thus that a product does not exist at the time of its cause.",
        "135": "Although you do not want to assert that a manifest phenomenon that did not previously exist is produced anew,\nIn reality this is what you are saying.\nIf the effect exists as the same nature as its cause,\nThen eating food is the same as eating the excrement it produces!",
        "136": "So instead of spending your money on clothes of woven cotton,\nYou might as well purchase cotton seeds to wear!\n'Worldly people do not see the effect at the time of the cause because of their confusion.'\nWell, what about your teacher, Kapila? He must know because you say he is omniscient;",
        "137": "And since you teach his view to worldly people,\nWhy can they not see the effect at the time of the cause?\n'Because worldly people do not see things with valid cognizers.'\nThen the manifest phenomena that they see clearly must also not be true!",
        "138": "'According to you Madhyamikas, valid cognizers are not truly existent, and so they must be false,\nIn which case the objects established by them must also be false.\nIf this is so, then the emptiness you assert is false,\nAnd meditating on it serves no purpose.'",
        "139": "Without first correctly identifying the object to be negated, true existence,\nYou cannot apprehend its negation, or non-existence, emptiness.\nThe negation of true existence, emptiness,\nClearly has no true existence itself.",
        "140": "For example, if a mother dreams her child has died,\nThe thought that the child no longer exists\nRemoves the thought of the child's existence,\nEven though neither thought is truly existent.",
        "141": "Through these various lines of reasoning,\nWe have established that production does not occur without a cause,\nAnd that a result, such as a sprout, does not exist in any of its causes and conditions,\nEither individually or collectively.",
        "142": "Effects do not come from anywhere else when they are produced,\nThey do not go anywhere when they perish, and they do not inherently abide.\nThey appear to be truly existent only because of ignorance,\nBut in fact they are like illusions.",
        "143": "Examine something produced from causes\nAnd compare it with an illusion conjured up by a magician.\nWhere do they come from when they arise?\nWhere do they go to when they perish?",
        "144": "We can see that effects arise from causes\nAnd that, without a cause, there cannot be an effect.\nThus, things are artificial, like reflections.\nHow can they possibly be truly existent?",
        "145": "If something is truly existent,\nWhat need is there for a cause to produce it?\nAnd if something is non-existent,\nAgain, what need is there for a cause to produce it?",
        "146": "Even with a hundred million causes,\nA non-thing will never transform into a thing.\nIf it remained a non-thing, how could it become a thing?\nFrom what state could it transform into a thing?",
        "147": "While it is not a thing, it cannot exist as a thing;\nSo when could it ever become a thing?\nIt would be unable to separate from being a non-thing\nWithout first becoming a thing;",
        "148": "But without its being separated from the state of being a non-thing,\nIt is impossible for the state of a thing to arise.\nLikewise, a functioning thing cannot become a permanent phenomenon\nBecause, if it did, it would have two mutually exclusive natures.",
        "149": "Just as there is no truly existent production of things,\nSo there is no truly existent cessation.\nThus, living beings are not truly born,\nNor do they truly cease.",
        "150": "Living beings are like objects in a dream\nFor, when analyzed, they have no ultimate identity, just like a rainbow.\nThus, in that they both lack true existence, there is no difference\nBetween nirvana, the state beyond sorrow, and samsara, the state of sorrow.",
        "151": "With objects that are empty in this way,\nWhat is there to gain and what is there to lose?\nWho is there to praise me?\nAnd who is there to blame me?",
        "152": "With no truly existent benefit or harm,\nWhat is there to be happy or unhappy about?\nAnd, when their ultimate nature is sought,\nWhere are those who seek a good reputation, and where is what they seek?",
        "153": "When examined in this way,\nWho is living and who is it who will die?\nWhat is the future and what is the past?\nWho are our friends and who are our relatives?",
        "154": "I beseech you who are just like me,\nPlease know that all things are empty, like space.\nConsider that although all people wish for happiness,\nThey swing between being troubled by suffering",
        "155": "And being overjoyed by meaningless pleasure.\nNot finding happiness, they suffer; and in striving to fulfil their wishes\nThey quarrel, fight and hurt each other with weapons.\nThus, they consume their lives in the commission of non-virtue.",
        "156": "From time to time, they take a fortunate rebirth\nAnd briefly enjoy some temporary happiness,\nBut soon they die and fall into the lower realms,\nWhere they experience unbearable suffering for a very long time.",
        "157": "In samsara, there are many pitfalls that lead to suffering.\nInstead of finding the path of emptiness that leads to freedom,\nWe are bound by its opposite, grasping at true existence.\nBut if, while in samsara, we do not find the path of emptiness,",
        "158": "We shall continue to experience an unending ocean of suffering\nThat is so unbearable it is beyond analogy.\nEven in fortunate rebirths, we shall have little ability to practise virtue,\nAnd our lives of freedom and endowment will quickly pass.",
        "159": "We are constantly striving to avoid sickness and death,\nFend off hunger, find some rest, or just get to sleep.\nWe receive harm from inner and outer obstacles,\nAnd waste our lives in meaningless company.",
        "160": "Thus, our life passes swiftly without any meaning,\nAnd we find it very hard to realize emptiness.\nIn such a state, where is there a method to reverse\nThe deluded wanderings of the mind, with which we are so familiar?",
        "161": "Furthermore, demonic forces are constantly striving\nTo cast us into the vast wasteland of the lower realms.\nThere are many mistaken paths to mislead us,\nAnd we find it difficult to resolve stultifying doubts.",
        "162": "It will be very hard to find the freedom and endowment of a human rebirth again.\nBuddhas rarely appear in this world, and it is difficult to find a qualified Mahayana Spiritual Guide.\nWithout these, there is no way to stop the flood of delusions \"“\nAlas, the suffering of living beings will continue without interruption!",
        "163": "Oh, surely we must feel compassion for all these poor beings\nWho are swept along in these vast rivers of suffering,\nFor, although they suffer in the extreme,\nThey do not recognize their suffering state.",
        "164": "For example, some ascetics repeatedly wash in freezing water\nAnd burn themselves with fire again and again;\nAnd, although they experience great suffering,\nThey proudly maintain that they are happy!",
        "165": "In the same way, those who live their lives\nAs if they were not going to be struck by sufferings such as ageing and death,\nWill experience horrendous suffering at the hands of the Lord of Death\nAnd then be cast into the unbearable torments of the lower realms.",
        "166": "May I be able to extinguish the fires of suffering\nThat torment all these beings,\nWith a vast rain of happiness\nDescending from the clouds of my merit;",
        "167": "And, through sincerely accumulating a collection of merit,\nWhile endowed with the wisdom realizing non-true existence,\nMay I teach emptiness to all living beings\nWho suffer because of their self-grasping.\nThis concludes the ninth chapter of Guide to the Bodhisattva's Way of Life, entitled 'The Perfection of Wisdom'."
      }
    },
    "10": {
      "title": "Dedication",
      "verses": {
        "1": "Joyful Path of Good Fortune \"“ we gain the ability to put all Buddha's teachings of both Sutra and Tantra into practice. We can easily make progress on, and complete, the stages of the path to the supreme happiness of enlightenment. From a practical point of view, Lamrim is the main body of Buddha's teachings, and the other teachings are like its limbs.",
        "2": "and (3) Universal Compassion and The New Eight Steps to Happiness \"“ we gain the ability to integrate Buddha's teachings into our daily life and solve all our human problems.",
        "3": "For as long as they remain in samsara,\nMay their temporary happiness never decline;\nAnd may they all eventually experience\nThe everlasting joy of Buddhahood.",
        "4": "The New Heart of Wisdom \"“ we gain a realization of the ultimate nature of reality. By gaining this realization, we can eliminate the ignorance of self-grasping, which is the root of all our suffering.",
        "5": "Meaningful to Behold \"“ we transform our daily activities into the Bodhisattva's way of life, thereby making every moment of our human life meaningful.",
        "6": "How to Understand the Mind \"“ we understand the relationship between our mind and its external objects. If we understand that objects depend upon the subjective mind, we can change the way objects appear to us by changing our own mind. Gradually, we will gain the ability to control our mind and in this way solve all our problems.\nTEACHER TRAINING PROGRAMME\nThe Teacher Training Programme is designed for people who wish to train as authentic Dharma Teachers. In addition to completing the study of fourteen texts of Sutra and Tantra, which include the six texts mentioned above, the student is required to observe certain commitments with regard to behaviour and way of life, and to complete a number of meditation retreats.\nA Special Teacher Training Programme is also held at Manjushri Kadampa Meditation Centre, Ulverston, England, and can be studied either by attending the classes at the centre or by correspondence. This special meditation and study programme consists of twelve courses based on the books of Venerable Geshe Kelsang Gyatso Rinpoche: How to Understand the Mind; Modern Buddhism; The New Heart of Wisdom; Tantric Grounds and Paths; Shantideva's Guide to the Bodhisattva's Way of Life and its commentary, Meaningful to Behold; Ocean of Nectar; The New Guide to Dakini Land; The Oral Instructions of Mahamudra; The New Eight Steps to Happiness; The Mirror of Dharma with Additions; Essence of Vajrayana; and Joyful Path of Good Fortune.\nAll Kadampa Buddhist Centres are open to the public. Every year we celebrate Festivals in the USA and Europe, including two in England, where people gather from around the world to receive special teachings and empowerments and to enjoy a spiritual holiday. Please feel free to visit us at any time!\nFor further information about NKT-IKBU study programmes or to find your nearest centre, visit www.kadampa.org, or please contact:\nNKT-IKBU Central Office\nConishead Priory, Ulverston,\nCumbria LA12 9QQ, UK\nTel: 01229-588533\nEmail: info@kadampa.org\nWebsite: www.kadampa.org\nor\nKMC New York\n47 Sweeney Road\nGlen Spey, NY 12737, USA\nTel: +1 845-856-9000\nor 877-523-2672 (toll-free)\nFax: +1 845-856-2110\nEmail: info@kadampanewyork.org\nWebsite: www.kadampanewyork.org\nTharpa Offices Worldwide\nTharpa books are currently published in English (UK and US), Chinese, French, German, Italian, Japanese, Portuguese and Spanish. Most languages are available from any Tharpa office listed below.\nTharpa UK\nConishead Priory\nULVERSTON\nCumbria,\nLA12 9QQ, UK\nTel: +44 (0)1229-588599\nWeb: tharpa.com/uk\nE-mail: info.uk@tharpa.com\nTharpa US\n47 Sweeney Road\nGLEN SPEY,\nNY 12737, USA\nTel: +1 845-856-5102\nToll-free: 888-741-3475\nFax: +1 845-856-2110\nWeb: tharpa.com/us\nE-mail: info.us@tharpa.com\nTharpa Asia\n1st Floor Causeway Tower,\n16-22 Causeway Road,\nCauseway Bay,\nHONG KONG\nTel: +(852) 2507 2237\nWeb: tharpa.com/hk-en\nE-mail: info.asia@tharpa.com\nTharpa Australia\n25 McCarthy Road,\nMONBULK VIC 3793, AU\nTel: +61 (0)3 9756 7203\nWeb: tharpa.com/au\nE-mail: info.au@tharpa.com\nTharpa Brazil\nRua Artur de Azevedo 1360\nPinheiros, SÃƒO PAULO - SP, 05404-003, BR\nTel: +55 (11) 3476-2328\nWeb: tharpa.com.br\nE-mail: info.br@tharpa.com\nTharpa Canada (English)\n631 Crawford St.,\nTORONTO, ON M6G 3K1, CA\nTel: (+1) 416-762-8710\nFax: (+1) 416-762-2267\nWeb: tharpa.com/ca\nE-mail: info.ca@tharpa.com\nTharpa Canada (FranÃ§ais)\n835 Laurier est Montréal, QC, H2J 1G2, CA\nTél: (+1) 514-521-1313\nWeb: tharpa.com/ca-fr\nE-mail: info.ca-fr@tharpa.com\nTharpa Chile\nAv. Seminario 589, Providencia,\nSANTIAGO, CL\nTél: +56 91297091/+56 22 9935053\nWeb: tharpa.com/cl\nEmail: info.cl@tharpa.com\nTharpa Deutschland (Germany)\nChausseestraÃŸe 108,\n10115 BERLIN, DE\nTel: +49 (030) 430 55 666\nWeb: tharpa.com/de\nEmail: info.de@tharpa.com\nTharpa EspaÃ±a (Spain)\nCalle La FÃ¡brica 8, Majadahonda,\nMADRID, 28221, ES\nTel: +34 911 124 914\nWeb: tharpa.com/es\nEmail: info.es@tharpa.com\nTharpa France\nChÃ¢teau de Segrais\n72220 SAINT-MARS-D'OUTILLÃ‰, FR\nTél/Fax : +33 (0)2 52 36 03 89\nWeb: tharpa.com/fr\nEmail: info.fr@tharpa.com\nTharpa Japan\nKMC TOKYO, JAPAN\n2F Vogue Daikanyama II,\n13-4 Daikanyama-cho,\nShibuya-ku, TOKYO,\n150-0034, JP\nWeb: tharpa.jp\nEmail: info@kadampa.jp\nTharpa México\nEnrique Rébsamen No 406\nCol. Narvate Poniente,\nCUIDAD DE MÃ‰XICO,\nCDMX, C.P. 03020, MX\nTel & Fax: +52 (55) 56 39 61 80;\nTel: +52 (55) 56 39 61 86\nWeb: tharpa.com/mx\nE-mail: info.mx@tharpa.com\nTharpa New Zealand\n2 Stokes Road, Mount Eden,\nAUCKLAND, 1024, NZ\nTel: +64 09 631 5400\nDD Mobile: +64 21 583351\nWeb: tharpa.com/nz\nEmail: info.nz@tharpa.com\nTharpa Portugal\nRua Moinho do Gato, 5\nVÃ¡rzea de Sintra\nSINTRA, 2710-661, PT\nTel: +351 219 231 064\nWeb: tharpa.pt\nEmail: info@tharpa.pt\nTharpa Schweiz (Switzerland)\nMirabellenstrasse 1\nCH-8048 ZÃœRICH, CH\nTel: +41 44 461 36 88\nWeb: tharpa.com/ch\nEmail: info.ch@tharpa.com\nTharpa South Africa\n26 Menston Rd., Westville,\nDURBAN, 3629, KZN,\nREP. OF SOUTH AFRICA\nTel: +27 31 266 0096\nWeb: tharpa.com/za\nE-mail: info.za@tharpa.com\nTharpa Sverige (Sweden)\nc/o KMC Sweden\nUpplandsgatan 18, 113 60\nTel: +46 (0) 72 251 4090\nEmail: info.se@tharpa.com\nIndex\nThe letter 'g' indicates an entry in the glossary\nA\nAbbot 89\nablution 17\"“18\nabsorption\nactual 51\nof close preparation 51\nwithout discrimination\n165, g\nactions and effects 170.\nSee also karma\nageing 191\naggregates 170, 177\nAkashagarbha 23. See also\neight Great Sons\nAkashagarbha Sutra 66\nalertness 49\"“66, 102, 147\ndefining characteristic 67\nfaults of lacking 53\nanalogies\nactor 168\nbattle 42\"“45, 74\nbee and pollen 120\nboat 61, 101\nbodhichitta 7, 33\"“34\ncotton 113\ndoctor, medicine and\nnurses vii, 24, 30, 45, 64,\n67, 103, 163\ndry grass 83\nelephant 49, 55, 111\nelixir 7\nfather and son 168, 180\nfire of aeon 8\nfish 101\nfoot and hand 135\nhoney on razor's edge 111\nhorse and cart 132\ninexhaustible treasury 33\njar with oil 112\nking's minister 94\"“95\nleaky pot 53\nleather 51\nlightning 6\nlimbs of body 137\nlion and foxes 110\nlotus 107\nnewly-wed 147\nplantain tree 7, 171\nquintessential butter 34\nrising moon 33\nsandcastle 87\nself-cognizers 157\"“158\nshady tree 33\nsnake and crows 109\nsnake in lap 113\nstick 78\nstork, cat and thief 61\nsupreme medicine 33\nsupreme nectar 33\nturtle 40\nuniversal bridge 33\nvast sun 34\nwild goose 136\nwishfulfilling jewel 161\nwish-granting tree 161\nwood 55, 57\nwound 52\nanger vii, 42, 149, g\nabandoning 51, 57, 72\"“83\ndependent on causes 74\"“76\nfaults of 71\"“72\nanimals 63, 102, 198\nappearance 154\nArhat 164\"“165, g\nArya 17, g\nascetics 73, 191\naspiration, power of 105\"“108\naspiring bodhichitta 8, 37, g\nAtisha 233\natoms 173\nattachment vii, g\nabandoning 56, 57,\n117\"“123, 148\nextreme of 165, g\nfaults of 118, 120, 124\"“132\nto body 59\"“60, 80, 123,\n124\"“131, 139, 148\"“150\nto causes of suffering 79\nto friends 57, 83, 118\"“120\nto illusory woman 160\nto reputation 117\nto sexual partner 124\"“131\nto sleep 99\nto worldly life 117, 132\nto worldly pleasures 25,\n99, 120\nAvalokiteshvara 17, 23, 138,\n198, g. See also eight Great\nSons\nawareness. See mind\nB\nbasis of imputation 178, g\nbeggar 89\nbeginningless time 19, 132,\n182, g\nBiography of Shri Sambhava 66\nbirth 123\nblame vii, 79\nblessings 6, 89, 107, 138, g\nbodhichitta 63, 85, 124, g\nanalogies for 7, 33\"“34\nbenefits of 6\"“11, 33, 104\nfaults of abandoning 37\"“38\nmaintaining 15\"“32\nreasons for benefits 9\ntypes 8, 37. See also\nengaging bodhichitta\nBodhisattva 7, 33, 136, 161, g\nobject of praise 10\"“11\nobstructing 38\nBodhisattva downfalls 38, 39\nBodhisattva's way of life\nviii, 63, 65\"“67, 102, 156\nBodhisattva vow 39, 67, 80.\nSee also vow\ntaking 32\"“33\nbodily conduct 55, 57, 61,\n63\"“64\nbody 53, 78, 80. See also\nattachment, to body\nabandoning attachment to\n59\"“61, 122, 148\"“149\nboat-like 61, 101\ncherishing 139\ndream-like 174\nessenceless 60\ngiving 31, 63, 102, 103\nimpermanence of 40, 122\nimpure 7, 60, 124\"“128, 154\noffering 16, 23\nparts of 172\"“173\ntruly-existent 172\nBrahma 9, g\nBrahmin 161\nBuddha 6, 65, 121, 156, g\nbeseeching to remain 30\ncountless 39\ndoctor 24, 103, 163\nform of 7, 161\ngood qualities of 54, 91, 140\nillusion-like 155, 162\nlineage of 33\nnature of living beings 94\nNavigator 7\nno conceptual mind 161\"“162\nomniscient 54, 63\npleasing 93\nquotations of 11, 50, 52, 91,\n106, 157\nrarity of 39, 190\nrefuge in 23, 105\nrepaying kindness of 92\"“94\nrequesting to teach 30\nteachings of. See also\nteachings, of Buddha\nBuddhahood. See\nenlightenment\nburial ground 122, 128, 130\nC\ncause and effect 155\"“156,\n181\"“188, 182, 185. See also\nkarma\nillusion-like 76, 187\ncessation 188\"“190\nchakravatin king 95\"“97, g\nChekhawa, Bodhisattva vi, g\ncherishing others vi, 62,\n92, 137, 139\"“141. See also\nequalizing self and\nothers; exchanging self\nwith others\nchildish beings 58, 77, 79,\n119, 121, 140\nChittamatra 179\nrefutation of 156\"“160\nclose placement of\nmindfulness of body\n172\"“174\nclose placement of\nmindfulness of feelings\n174\"“177\nclose placement of\nmindfulness of mind 177\ncollection 135, 176\nof merit 99, 104, 161, 192, g\nof wisdom 99, 104, 161, g\ncompassion 58, 136, 191, g\nnominally existent 171\nCompendium of Trainings 67\ncompetitiveness 119\nmeditation on 142, 144\"“145\nconcentration 56, 117\"“148, g\nof the actual absorption 51\nperfection of 52\nCondensed Compendium of\nSutras 67\nconfession 20\"“21, 26, 93, g.\nSee also purification\nconfusion 41, 53\nnon-deluded 165\nconscientiousness 37, 55,\n113, 150, g\nin abandoning delusion\n42\"“45\nin abandoning non-virtue\n40\"“42\nwith respect to bodhichitta\n37\"“39\nconsciousness. See also\nmental consciousness;\nmind; sense\nconsciousness\nobject of 167, 176, 177, 180\npermanent 167\ntruly existent 180\ncontact 176, g\ncontentment 148\ncontinuum 135, 156\nof person 170\nof suffering 76\nconventional truth 153, 178, g\ncraving 78, 165, 176\ncriticism 121\nD\ndaughter of a childless\nperson 158\ndeath 25, 59, 120, 191. See\nalso Lord of Death\ntime of 20\"“21, 41, 80,\n100\"“101, 123\ndedication 30, 66, 107,\n195\"“204\ndelusion-obstructions 166.\nSee also obstructions, to\nliberation\ndelusions vii, 117, 190\nabandoning 42\"“44, 74, 108, 110, 164\ndiseases of 24\nenemy 42\"“45, 112\nfaults of 42\"“43\nfishermen of 87\nillusion-like 45\nmanifest 164\"“165\nopponents to 58\nsecondary 56\nthieves of 53\nweapons of 112\ndemi-gods 34, 42, g\ndemonic forces 190\nDharma 82, 90, 163, 233, g.\nSee also teachings\nholders of 164\njoy of 102, 111\nmedicine 24, 64, 67, 163,\n205\nrefuge in 19, 23\nroot of 106\nvast and profound 64\nDharma activities 63, 108\nDharma Jewel 18. See also\nThree Jewels\nDharma practice vii, 41,\n105, 107, 108, 113\nbasis for 39, 60\ndirectional parts 173\ndiscouragement 102\"“104\ndistractions 52, 102, 117, g\novercoming 54\"“56\ndivisive speech 57\ndoubt 190\ndownfalls 53, 109\nBodhisattva 38, 39\ndream 21, 81, 176, 186, 188\ndualistic appearance 153, g\ndullness 150\nE\neffort 43, 53, 99\"“113, 150\ndefinition 99\neight Great Sons 23, g\nEight Verses of Training the\nMind vi, g\neight worldly concerns 188, g\nelements 32, 181\nemployer example 141\nemptiness 104, 118, 124,\n155, 162. See also lack\nof inherent existence;\nlack of true existence;\nselflessness\ncorrect view of 150. See\nalso wisdom realizing\nemptiness\nfear of 166\nno true existence 186\nof body 171\"“173\nof emptiness 160\nof mind 176, 177, 180\npath of 189\nenemy 73, 76, 86, 119\ncause of patience 88\"“90\ncherishing body as 139\ndestroying 45, 51\nimpermanence of 25\nof anger 72\nof self-cherishing 139\nof the delusions 42\"“45, 112\nof the self-important view\n110\nengaging bodhichitta 8,\n29\"“34, 37, 67, g\nenlightened one 139. See also\nBuddha\nenlightenment viii, 102, g\ncause of 6, 91, 95\nnominally existent 171\npath to vi\nsmall 162\nequalizing self and others\nvi, 102, 133\"“137\nevil 19, 40, 50. See also\nnon-virtue\nabandoning 6, 8\nexchanging self with others\nvi, 102, 137\"“149\ncompleting by means of\naction 144\"“150\ncompleting by means of\nreflection 142\"“144\nholy secret 139\nof Buddha 94\nexpression of worship 5\nexternal object 156\nextreme of attachment 165, g\nextreme of fear 165, g\nF\nfaith 6, 39, 53, 58, 63, 86, 105, g\nresults of 11, 162\nfalse 169, 186\nfalsely existent 135, 154\nfame 87\"“88\nfamiliarity 73\"“74, 137, 138\nfather 9, 20, 139, 168\nfaults 146\nof others 57\nfear 23, 50, 105\nabandoning 7, 24, 49\ncause of 106, 138\nextreme of 165, g\nof emptiness 166\nof hell 52, 101, 112\nof lower realms 54\nfeelings vii, g\ncause of 175\"“176, 184\npleasant 165\nrefuting permanence of\n184\"“185\nrefuting true existence of\n174\"“177\nfield of enlightened beings\n91\nfield of holy beings 62\nfield of living beings 62, 91\nfield of merit 91\nFoe Destroyer. See Arhat\nform\nand consciousness 176, 179\nillusion-like 154, 156, 159\ntruly existent 159, 179\nform realm 51, g\nfour noble truths 162, g\nfour opponent powers 19\"“24,\ng. See also purification\nfour powers 104. See also\nindividual ones\nfour unrealistic wishes 101\nfriends 72, 73, 76, 82, 88, 189\nimpermanent 20\"“21, 25,\n118, 123\nunreliable 119\nfunctioning thing 185, 188, g.\nSee also thing\nfuture lives 62, 64, 108, 189,\n204\nG\nGaruda 161\ngeneral principle 169, 183\nrefutation of 183\"“185\ngiving 56, 71, 89, 139\nfood 11, 63, 103\nhappiness 146\none's body 31, 64, 102, 103\nperfection of 50, 63\ntraining in 31\"“32\ngod 9, 34, 42, g\nlong-life 101\nof first form realm 51\ngood qualities\nof a Bodhisattva 105\nof Buddha 91\nof others 62, 85\nof suffering 73, 74\nour own 62, 85, 86, 146\ngrasping at true existence\n160, 189. See also\nself-grasping\nguardians of hell 43, 50, 79,\n87, 94, 147\nguarding the mind with\nalertness 49\"“66\ndefining characteristic 67\nH\nhappiness 140, 188\ncauses of 62, 73, 106, 140,\n182, 235\ndestroying 10, 39\nfrom Dharma 102, 111\ngiving 146\nimpermanent 81\nof others 44, 62, 85, 133,\n140, 142\nphysical 104\nwish for 52, 134, 148, 189\nhardships, enduring 43\"“44,\n52, 84, 103, 132, 136.\nSee also patience, of\nvoluntarily enduring\nsuffering\nharm 77, 78, 141\nharmful speech 57, 73, 80\nharmful thoughts 86\nhatred 56. See also anger\nHearer 104, 204, g\nhell 24, 41, 79, 92, 136, 195\"“\n198. See also guardians of\nhell\ncauses of 11, 40, 42, 79, 95,\n139\ncreator of 50\nfear of 52, 101, 112\nhot hells 101, 107\nsufferings of 45, 49, 84,\n101, 112, 132\nhero 74, 110\nhigher rebirth 189, 190. See\nalso precious human life\ncause of 140\nHinayana 163\nscriptures 163\"“164\nhuman realm 84. See also\nprecious human life;\nsuffering, of humans\nhumility 61, 204, g\nhungry spirit 38, 139, 198, g\nI\nI. See self\nignorance 20, 78. See also\nself-grasping\nillusion 76, 159, 176, 187\ncauses of 155\nillusory woman 160\nimpermanence 20\"“21, 81,\n118, 132, 155, 184\nof body 40, 122\nof enemies 25\nof friends 21\"“22, 25, 119\nof pleasures 87\nof possessions 81, 121\nof relationships 123\nimputation 159, 168, 170,\n173, 175, 178, g\nindependent creator of all\n75, 168, 169, 183\nindependent permanent self\n75\"“76\ninherent existence 154, g\nintention 106, 107. See also\naspiration\nIshvara g\nrefutation of 181\"“183\nJ\njealousy 84\"“85, 119, 125, 146\nmeditation on 142\"“143\nJe Tsongkhapa vi, g\njoy, power of 111\"“112\nK\nKadampa vi, g\nKadampa Buddhism\n233\"“234\nKadampa Tradition g\nKapila 185\nkarma 78, 83, 106, 170, 182,\ng\nkarmic obstacles 39\nKarnapa, people of 73\nKashyapa 164\nkilling 51, 139\nan illusion 155\nKsitigarbha 23. See also eight\nGreat Sons\nL\nlack of inherent existence 76,\n155. See also emptiness;\nlack of true existence\nof body 124\nof feelings 175\nlack of true existence\n159, 165, 179. See also\nemptiness; lack of\ninherent existence\nof nirvana 156, 188\nof samsara 188\nLamrim 233, g\nLangri Tangpa vi, g\nlaziness 109, 113\nof being attracted to non-\nvirtuous actions 101\nof discouragement\n102\"“103\nof indolence 41, 99\"“101\nliberation 38, 89, 153, 162, g.\nSee also nirvana\nself/solitary 137, 162\nlineage of Buddha 33\nliving beings 10, 121, 134,\n178, g\nas limbs 137\ncause of enlightenment 62,\n91\ndeceiving 38, 44\nfield of 62, 91\nguests 34, 38\nillusion-like 45, 155, 171,\n188\nmother 31\nnature of Buddha 94\nrelieving fear of 138\nsuffering of 171\nLord of Death 20\"“21, 60,\n100\"“101, 191, g\nmessengers of 22, 23\nlower realms 40, 54, 132,\n189, 190, g\ncause of 39, 53, 140\nlower rebirth 38. See also\nlower realms\nM\nMadhyamika 154, 186, g\nmagician 160, 187\nMahayana 163, 190, g\nscriptures 163\"“164\nSutras 66\"“67\nMaitreya 8, g. See also eight\nGreat Sons\nmale/female 174\nManjushri 17, 18, 23, 198,\n204, g. See also eight Great\nSons\nmantra 52, g\nname, of Avalokiteshvara\n138\nmaterialists, refutation of\n169\"“170\nMayadevi 198\nMeaningful to Behold viii\nmeditation g\nmemory 21, 158\nmental consciousness 177\nmental factor g\nmental stabilization 117\"“148, g\nmere appearance 154\nmerit 16, 22, 66, 107, 161, g\ncollection of 161, 192\ndestroying 53, 71, 83, 86\nfield of 91\nillusion-like 155, 162\nmethod practices 153, g\nmind 127, g. See also\nconsciousness\nanalytical 179\nconceptual 161, 178, g\ncontrolling 51\ngrasping at true existence\n160, 178\nguarding the 49\"“66\nillusion-like 156\nmistaken 153, 178\nnature of 156\"“160\nnot the self 170\nperfections depends upon\n50\"“52\nsource of all fear and\nsuffering 50\ntruly existent 158, 176\nmindfulness 53, 102, 112,\n147, g\nbenefits of 49\"“50\nfaults of lacking 53\nrope of 49\nmiserliness 38, g\nmoral discipline 49\"“66, 203\nof benefiting others 63\"“65\nof gathering virtue 58\"“62\nof restraint 54\"“58\nperfection of 51\nmother 9, 20, 93, 106, 139,\n186\nliving beings 31\nof Buddha 198\nMount Meru 42, 59, g\nN\nNagarjuna 67, g\nnatural state of nirvana 177,\n179\nnature of mind 156\"“160\nnegative phenomenon g\nNew Kadampa Tradition\n234. See also Kadampa\nTradition\nnirvana 29, 31. See also\nliberation\nlacks true existence 156,\n188\nnon-affirming negative 153\nnon-alertness 56, g\nnon-conscientiousness 22,\n147, g\nnon-existent 187, g\nnon-thing 187\"“188\nnon-virtuous actions/non-\nvirtues 6, 81, 189, 235. See\nalso evil\nabandoning 25, 51\ncauses of 75\nresults of 40, 79, 84, 105,\n106, 107, 182\nO\nobject condition 178\nobject of negation 186, g\nobstructions\nto liberation 150, g. See also\ndelusion-obstructions\nto omniscience 150, 166, g\nofferings 15\"“18, 71, 155, 162,\n203\nmentally transformed\n17\"“19\none's body 16, 23\nunowned 15\"“16\nomniscient wisdom 38, 54\nopponent force, power of 24\nordained people 63, 203, 204\nP\npain vii, 74. See also suffering\ncauses of mental pain 104,\n106\ncauses of physical pain 78,\n104, 106\nparinirvana 30, 65\npartless particles 175, 183\npatience 71\"“93, g. See also\npatience of not retaliating\nbenefits of 72, 94\nobjects of 79\nof definitely thinking\nabout Dharma 74\"“75\nof voluntarily enduring\nsuffering 73\"“74. See also\nhardships, enduring\nperfection of 51\npatience of not retaliating\n76\"“92\nby contemplating our own\nfaults 78\nby developing compassion\n77\"“78\nby overcoming cause of\nanger 77\"“78\nobjections to 80\npeace 234\nPemapani 197\nperfection of concentration 52\nperfection of effort 51\nperfection of giving 50, 63\nperfection of moral\ndiscipline 51\nperfection of wisdom 153\nPerfection of Wisdom Sutras\n164, g\npermanent 188, g\nfeelings 184\nmind 167\nphenomenon 188\nself 75, 167\"“170, 181\nperson. See self\npleasure. See worldly\npleasures\npossessions 130\"“132, 139\nlosing 81, 121\npraise 10, 87\"“88, 119, 121,\n146, 188\nof holy beings 10\"“11, 19\nof others 61, 84\nseeking 57\nPrasangika 154, g\nprayer 52, 107, 161\nprecepts 45\nprecious human life 6, 59,\n87, 102\nbrevity of 20, 39\nmeaning of viii\nrarity of 40\"“42, 190\nwasting 40, 105, 132, 141,\n190\npretension 137, 138\nprevious lives 25\npride 43, 109, 119, 120, g\nabandoning 62, 137, 138\nmeditation on 142, 144\nprimary mind g\nproblems vii, 131, 147. See\nalso suffering\nproduction\nfrom no cause 181, 187\nof existents and non-\nexistents 187\"“188\npromise 38, 39, 44\nof composition 5\npower of 26\nproponents of things 154,\n164, g\nrefutation of 154\"“156\nprostration 5, 11, 19, 26, g\nPure Land 107, 195\npurification 15\"“24, 40, 65,\n79, 104, 105, g\nfour opponent powers\n19\"“24, g. See also\nindividual ones\nR\nrainbow 188\nreason for composition 5\nrebirth 155\nrefuge 11, 19, 22\"“24, g\nin Buddha 23, 105\nrefutation of Chittamatrins\n156\"“160\nrefutation of general\nprinciple 183\"“185\nrefutation of Ishvara 181\"“183\nrefutation of materialists\n169\"“170\nrefutation of permanent\nfeelings 184\"“185\nrefutation of permanent\npartless particles 175,\n183\nrefutation of permanent self\n167\"“171\nrefutation of production\nfrom no cause 181\nrefutation of proponents of\nthings 154\"“156\nrefutation of Samkhyas 167,\n181\"“186\nrefutation of self-cognizers\n157\"“158\nrefutation of truly existent\nfeelings 174\"“177\nregret 41\npower of 20\"“22\nrejection, power of 112\"“114\nrejoicing 29, 61, 84\"“85\nreliance, power of 22\"“23, 65\nreliquary 161\nremaining as impassive as\nwood 55, 57\nrenunciation 73, 118, g\nreputation 87\"“88, 121, 188\nlosing 53\nrespect 54, 56, 58, 85\nS\nSamantabhadra 17, 18, 23,\n198, g. See also eight Great\nSons\nSamkhyas g\nrefutation of 167\"“169,\n181\"“186\nsamsara 39, 43, 73, 74, 118,\n131, 159, g\nabodes of 165\nconventionally existent 156\nlacks true existence 188\nsufferings of 99, 189\nSangha 105, 203, g\nseed and sprout 180, 186\nself g\ncontinuum of 170\nillusion-like 58\nmaterial 169\"“170\nmerely imputed 170\npermanent 75\"“76,\n167\"“171, 181\ntruly existent 166\nunfindable 171\nself-cherishing vii, 77, 133, g\nabandoning 139\"“141,\n145\"“151\nfaults of 137, 139\"“141, 144,\n148\nfearful spirit 141\nself-cognizer 157\"“158, g\nself-confidence 107\"“110\nself-grasping vii, 159, 192, g.\nSee also grasping at true\nexistence\nabandoning 122, 135, 171\nof body 60, 139\nof self 137\"“138, 149\nself-important view 57, 108,\n109\nselflessness of persons\n166\"“171, 176, 177\nselflessness of phenomena\n171\"“176\nsense awareness 178\nsense of shame 54, 58, g\nsense power 175. See also six\npowers\nservant 16, 60, 93, 146\nsexual partner 77, 124\"“131\nShantideva vi\nsickness 40, 53, 73, 74, 139,\n190\nsix perfections 50, 63, 107, g.\nSee also individual ones\nsix powers 175, 177, g\nskill 63\nslander 80\nsleep 65, 99, 113, 150\nSolitary Realizers 204, g\nsolitude 117, 120, 204\nbenefits of 121\"“123\nsound 167\"“169\nspiritual ground 39\nSpiritual Guide 20, 25, 54,\n66, 82, 190, 205, g\nstages of the path. See\nLamrim\nsteadfastness 58\npower of 108\"“111\nstealing 139\nstupa 18, 82\nSudhana 8\nsuffering vii, 78, 81, 101,\n140. See hell, sufferings of\ncaused by delusions 43,\n124, 141, 159\ncaused by mind 50\ncaused by non-virtue 78,\n105, 182\ngood qualities of 73, 74\nillusion-like 76\nno choice 75, 76\nno independent possessor\n135\nof hell. See hell, sufferings\nof\nof humans 78, 84, 106\nof others 189\nof samsara 99, 189\nof worldly beings 132\nrelieving others' 73, 94,\n133\"“136, 141, 171\ntaking others' 146, 205\nunending 189\"“191\nwish to be free from vii,\n10, 52, 153\nSugata 11, 32, 196\nsuicide 77\nSukhavati 195\nsuperior seeing 117, 175\nsuppleness 113\nSupushpachandra 136\nSutra 66\nSutra of the Three Heaps 65\nSutra Requested by Subahu 9\nT\ntaking and giving vi, 146, 205\nTathagata 39, 102, g\nteachings. See also Dharma\nof Buddha vi, 66, 145,\n163\"“164, 233\"“234\nof Shantideva 192\nrequesting 30\nten directions 19, 44, g\nthing 154, 155, 181,\n184, 187\"“188. See also\nfunctioning thing\nthirty-six impure substances\n128\nthree higher trainings 163, g\nThree Jewels 20, 65, 82, g\nthree worlds 50, 92, g\ntraining the mind 52, g\nTraining the Mind in Seven Points vi, g\ntranquil abiding 117, 158,\n175, g\ntrue 159\ntrue existence 186, g. See also\ntruly existent\ngrasping at 160, 189\ntrue-grasping g. See true\nexistence, grasping at\ntruly existent\nbases 159\nbody 172\ncessation 188\nform 159, 179\nmind 158, 176, 178, 179\nproduction 187\nself 166\nthings 160, 184\nTruth Body 5, g\ntwo truths 153\"“154, 178\"“179\nU\nultimate truth 153, 234. See\nalso emptiness\nunhappiness 72, 188. See also\nsuffering\nV\nVaibhashika 163, 164, g\nVajradotsa Sutra 107\nVajrapani 23, 197, g. See also\neight Great Sons\nvalid cognizer 178, 184, 186, g\nconventional 155\nvast and profound Dharma\n64\nvirtuous actions/virtue 6,\n40, 58, 62\naccumulating 49\ninexhaustible 7\nresults of 107, 111\nvow 52, g. See also\nBodhisattva vow\nW\nwealth 57, 81, 87\"“88, 131, 148\nlosing 53\nwheel of Dharma 233\nwisdom viii, 74, 104, 234.\nSee also omniscient\nwisdom; wisdom\nrealizing emptiness\ncollection of 99, 104, 161, g\nfrom listening,\ncontemplating, and\nmeditating 53\nperfection of 153\nwisdom realizing emptiness\n153, 165\"“166. See also\nemptiness, correct view\nof\nwishfulfilling jewel 61, g\nworldly beings 43, 108, 119,\n121\nperceptions of 155, 186\nsufferings of 132\nworldly life 117\nworldly pleasures 25, 99,\n111, 132, 185\ndeceptive 87\nwrong views 106\nY\nYogi/Yogini 154, 175, g\nThe International Temples Project\nUK Kadampa World Peace Temple At Manjushri Kadampa Meditation Centre, Ulverston One of many Kadampa Temples established by the author\nThe International Temples Project was founded by Venerable Geshe Kelsang Gyatso with the aim to introduce the Buddhist faith and practice of the New Kadampa Tradition publicly, and to exemplify contemporary Buddhist practice through public service.\nIt achieves this through building traditional and non-traditional Temples, meditation centres and retreat centres, and through the activities of Kadampa Schools, World Peace Cafés and Tharpa Publications.\nFor more information on the International Temples Project, visit kadampa.org/temples.\nThis book is published under the auspices of the\nNKT-IKBU International Temples Project\nand the profit from its sale is designated for public benefit through this fund.\n[Reg. Charity number 1015054 (England)]\nFind out more:\ntharpa.com/benefit-all-world-peace\nFinding Your Nearest Kadampa Meditation Centre\nTo deepen your understanding of this book, and other books published by Tharpa Publications, and its application to everyday life you can receive support and inspiration from qualified Teachers and practitioners.\nTharpa Publications is part of the wider spiritual community of the New Kadampa Tradition. This tradition has a growing number of centres and branches in over 40 countries around the world. Each centre offers special study programmes in modern Buddhism and meditation, taught by qualified Teachers. For more details, see Study Programmes of Kadampa Buddhism (see here).\nThese programmes are based on the study of books by Venerable Geshe Kelsang Gyatso Rinpoche and are designed to fit comfortably with a modern way of life.\nTo find your local Kadampa centre visit: tharpa.com/centres",
        "7": "May the regions of hell become joyful lands\nAdorned with vast and fragrant lotus pools\nResounding with the enchanting calls\nOf wild geese, ducks and swans.",
        "8": "May the heaps of burning coals become piles of various jewels,\nMay the red-hot iron ground become a soothing crystal floor,\nAnd may the mountains of the crushing hells\nBecome celestial palaces of worship filled with Sugatas.",
        "9": "May the hail of lava, blazing stones and weapons\nHenceforth become a rain of flowers,\nAnd may all attacks with weapons\nFrom now on become a playful exchange of flowers.",
        "10": "May those drowning in the fiery torrents of acid \"“\nTheir flesh eaten away to reveal their lily-white bones \"“\nAttain the bodies of celestial beings\nAnd sport with consorts in gently flowing streams.",
        "11": "'Why are the henchmen of the Lord of Death and the unbearable buzzards and vultures so afraid?\nBy whose noble power is the darkness of our suffering dispelled and joy bestowed upon us?'\nLooking above them, those in hell will behold the radiant form of Vajrapani, the Holder of the Vajra.\nThrough the force of their new-found faith and joy, may they be freed from past evil and come to abide with him.",
        "12": "When they see the lava fires of hell extinguished by a rain of flowers moist with scented waters,\nAnd are immediately satiated with bliss,\nThey will wonder by whose hand this was brought about\nAnd behold Pemapani, the Holder of the Lotus.",
        "13": "'Friends, cast away your fears and quickly gather here,\nFor above us is the youthful Manjushri, whose radiant topknot dispels all fears.\nEndowed with great compassion and bodhichitta, he protects all living beings,\nAnd through his power dispels all suffering and bestows perfect joy.",
        "14": "'Behold him in his enchanting palace resounding with the songs of a thousand celestial beings,\nWith hundreds of gods bowing before him, their tiaras touching his lotus feet,\nAnd a vast rain of flowers falling upon his gracious head, his eyes moist with compassion.'\nThus, upon seeing Manjushri, may all beings in hell cry out with joy.",
        "15": "Likewise, when through my roots of virtue all beings in hell\nFeel the cool, sweet-smelling rain descending from miraculous clouds\nCreated by Bodhisattvas such as Samantabhadra,\nMay they experience perfect happiness.",
        "16": "May all animals be freed from the fears\nOf being preyed upon by one another,\nAnd may all hungry spirits be as happy\nAs the inhabitants of the northern continent.",
        "17": "May they be satiated by a stream of milk\nFlowing from the compassionate hands\nOf Arya Avalokiteshvara\nAnd, by bathing in it, may they be constantly refreshed.",
        "18": "May the blind see forms,\nMay the deaf hear sounds,\nAnd just as it was with Mayadevi, the mother of Buddha,\nMay all pregnant women give birth without pain.",
        "19": "May the naked find clothing,\nMay the hungry find food,\nAnd may the thirsty find pure water\nAnd delicious drinks.",
        "20": "May the poor find wealth,\nMay those weak with sorrow find joy,\nAnd may those whose fortunes have declined\nFind replenishment and long-lasting good fortune.",
        "21": "May everyone who is sick\nBe swiftly healed,\nAnd may every disease that affects living beings\nBe permanently eradicated.",
        "22": "May the frightened be released from their fears,\nMay those in captivity be freed,\nMay the powerless be endowed with power\nAnd may people think only of benefiting one another.",
        "23": "May travellers on the road\nFind happiness wherever they go,\nAnd without any effort\nAccomplish whatever they set out to do.",
        "24": "May those who sail by ship or boat\nObtain whatever they seek\nAnd, returning safely to the shore,\nJoyfully reunite with their friends and relatives.",
        "25": "May those distressed because they have lost their way\nMeet with fellow travellers\nAnd, without any fear of thieves or other dangers,\nProceed comfortably without fatigue.",
        "26": "May those in dangerous and fearful places,\nChildren, the aged and the unprotected,\nAs well as the bewildered and the insane,\nBe guarded by benevolent celestials.",
        "27": "May all humans be freed from all the unfree states,\nMay they be endowed with faith, wisdom and compassion,\nAnd may they have the very best food, follow pure conduct\nAnd always be concerned for their future lives.",
        "28": "May they have inexhaustible joy and copious resources,\nJust like the supreme treasury;\nAnd may they enjoy freedom,\nWith no disputes, interferences or injury.",
        "29": "May those who possess little splendour\nBe endowed with majesty,\nAnd may those whose bodies are worn through asceticism\nAttain magnificent and noble forms.",
        "30": "May all beings everywhere\nTake rebirth in a gender of their choice,\nAnd may the lowly and downcast attain grandeur\nWithout ever displaying pride.",
        "31": "By the power of the merit I have accumulated,\nMay all living beings without exception\nAbandon all forms of evil\nAnd always engage in virtue.",
        "32": "May they never be separated from bodhichitta\nAnd always follow the Bodhisattva's way of life.\nMay they be cared for by Buddhas and Spiritual Guides\nAnd forsake all demonic activity.",
        "33": "While in samsara, may they be reborn in fortunate realms\nAnd enjoy inconceivably long lives,\nAbiding always in contentment\nWithout ever hearing the word 'death'.",
        "34": "May all places throughout the world\nBecome gardens of wishfulfilling trees,\nResounding with the sound of Dharma\nProclaimed by Buddhas and Bodhisattvas.",
        "35": "May the whole ground\nBecome completely pure,\nAs level as the palm of a hand,\nAnd as smooth as lapis lazuli.",
        "36": "And in every land may there appear,\nFor the sake of all disciples,\nMultitudes of Bodhisattvas\nPossessed of excellent qualities.",
        "37": "May all living beings uninterruptedly hear\nThe sweet sound of Dharma\nIssuing forth from birds and trees,\nBeams of light and even space itself.",
        "38": "May they always meet with Buddhas\nAnd their Sons and Daughters, the Bodhisattvas;\nAnd may the Spiritual Guides of the world\nBe venerated with clouds of offerings.",
        "39": "May celestial beings bring timely rains,\nAnd may harvests always be plentiful.\nMay governments rule in accordance with Dharma,\nAnd may the people of the world prosper.",
        "40": "May all medicines be effective,\nMay the recitation of mantras fulfil all wishes,\nAnd may all spirits and animals who have influence over us\nBe endowed with great compassion.",
        "41": "May no one ever experience physical pain,\nMental anguish or sickness.\nMay they be free from all forms of unhappiness,\nAnd may no one ever be afraid or belittled.",
        "42": "In all temples and Dharma centres,\nMay recitation and meditation flourish forever.\nMay the Sangha always be in harmony,\nAnd may their wish to benefit others be fulfilled.",
        "43": "May Sangha who wish to practise purely\nFind the right conditions to do so\nAnd, abandoning all distractions,\nMeditate with mental suppleness.",
        "44": "May the ordained be materially provided for\nAnd always be free from harm.\nMay no one who has taken ordination\nEver allow their moral discipline to degenerate.",
        "45": "May all those who have broken their moral discipline\nCompletely purify their downfalls.\nMay they attain a fortunate rebirth\nAnd never allow their morality to decline again.",
        "46": "May those who are learned in Dharma be respected\nAnd receive material support.\nMay their minds be pure and peaceful,\nAnd may their good qualities be proclaimed in all directions.",
        "47": "May they never experience the sufferings of the lower realms\nOr meet with hardships of body, speech or mind.\nMay they have forms superior to those of the gods\nAnd quickly attain the state of a Buddha.",
        "48": "May all living beings again and again\nMake offerings to the Buddhas.\nMay they become endowed with the eternal bliss\nOf a fully enlightened being.",
        "49": "May the Bodhisattvas fulfil the welfare of the world\nIn the very manner they have intended,\nAnd may all living beings receive\nEverything the Buddhas have intended for them.",
        "50": "Likewise, may all Solitary Realizers and Hearers\nAttain the happiness of nirvana.",
        "51": "And until I attain the level of the Joyous One,\nThrough the blessings of Manjushri,\nMay I be concerned for all my future lives\nAnd always receive ordination.",
        "52": "May I always live humbly, sustained by simple food.\nThroughout all my lives, may I abide in solitude\nAnd always find ideal conditions\nFor achieving my spiritual goals.",
        "53": "Whenever I wish to see a scripture\nOr compose even a single verse,\nMay I behold without obstruction\nProtector Manjushri.",
        "54": "To fulfil the needs of all living beings\nReaching to the ends of space,\nMay my way of life always resemble\nThat of Manjushri.",
        "55": "For as long as space exists\nAnd for as long as living beings remain in samsara,\nMay I abide among them\nTo dispel all their suffering.",
        "56": "May all the suffering of all living beings\nRipen solely upon me;\nAnd by the power of the Bodhisattvas' virtue and aspirations\nMay all beings experience happiness.",
        "57": "May the Buddhadharma, the sole medicine for all suffering\nAnd the source of all happiness,\nBe materially supported and honoured,\nAnd remain for a very long time.",
        "58": "I prostrate to Manjushri,\nThrough whose kindness my virtuous intentions arise;\nAnd I prostrate to my Spiritual Guide,\nThrough whose kindness my virtuous qualities increase.\nThis concludes the tenth chapter of Guide to the Bodhisattva's Way of Life, entitled 'Dedication'.\nThis concludes Guide to the Bodhisattva's Way of Life, composed by the Buddhist Master Shantideva.\nGlossary\nMost of these terms are explained in detail in Venerable Geshe Kelsang Gyatso Rinpoche's commentary, entitled Meaningful to Behold. Where more detail can be found in Venerable Geshe Kelsang Gyatso Rinpoche's other books, this is indicated in the glossary entry.\nAbsorption without discrimination A concentration of the fourth form realm that observes nothingness and that is attained by stopping gross feelings and gross discriminations. See Ocean of Nectar.\nAggregates In general, all functioning things are aggregates because they are an aggregation of their parts. In particular, a person of the desire realm or form realm has five aggregates: the aggregates of form, feeling, discrimination, compositional factors and consciousness. A being of the formless realm lacks the aggregate of form but has the other four. A person's form aggregate is his or her body. The remaining four aggregates are aspects of his mind. See The New Heart of Wisdom.\nAnger A deluded mental factor that observes its contaminated object, exaggerates its bad qualities, considers it to be undesirable and wishes to harm it. See How to Solve Our Human Problems.\nArhat Sanskrit for 'Foe Destroyer'. A practitioner who has abandoned all delusions and their seeds by training on the spiritual paths, and who will never again be reborn in samsara. In this context, the term 'Foe' refers to the delusions.\nArya Sanskrit for 'Superior being'. Someone who has a direct, or non-conceptual, realization of emptiness. There are Hinayana Superiors and Mahayana Superiors.\nAspiring bodhichitta A mind that aspires to attain enlightenment for the benefit of all living beings but that does not yet engage in the actual practices of the Bodhisattva's training. It is like someone intending to go somewhere but not yet setting out on the journey.\nAttachment A deluded mental factor that observes a contaminated object, regards it as a cause of happiness, and wishes for it.\nAvalokiteshvara 'Chenrezig' in Tibetan. The embodiment of the compassion of all the Buddhas.\nBasis of imputation All phenomena are imputed upon their parts; therefore, any of the individual parts, or the entire collection of the parts, of any phenomenon is its basis of imputation. A phenomenon is imputed by mind in dependence upon its basis of imputation appearing to that mind. See The New Heart of Wisdom.\nBeginningless time According to the Buddhist world view, there is no beginning to mind, and so no beginning to time. Therefore, all living beings have taken countless previous rebirths.\nBlessings The transformation of our mind from a negative state to a positive state, from an unhappy state to a happy state, or from a state of weakness to a state of strength, through the inspiration of holy beings such as our Spiritual Guide, Buddhas and Bodhisattvas.\nBodhichitta Sanskrit for 'mind of enlightenment'. 'Bodhi' means 'enlightenment', and 'chitta' means 'mind'. There are two types of bodhichitta \"“ conventional bodhichitta and ultimate bodhichitta. Generally speaking, the term 'bodhichitta' refers to conventional bodhichitta, which is a primary mind motivated by great compassion that spontaneously seeks enlightenment to benefit all living beings. There are two types of conventional bodhichitta \"“ ­aspiring bodhichitta and engaging bodhichitta. Ultimate bodhichitta is a wisdom motivated by conventional bodhichitta that directly realizes emptiness, the ultimate nature of phenomena. See also Aspiring bodhichitta and Engaging bodhichitta.\nBodhisattva A person who has generated spontaneous bodhichitta but who has not yet become a Buddha.\nBrahma A worldly god, who resides in the first form realm.\nBuddha A being who has completely abandoned all delusions and their imprints. Every living being has the potential to become a Buddha.\nChakravatin king An extremely fortunate being who has accumulated a vast amount of merit and as a result has taken rebirth as a king with dominion over all the four continents as described in Buddhist cosmology, or, at the very least, over one of the four continents. At present there are no chakravatin kings in our world, and there is no one who has complete dominion over our continent, Jambudipa. See Great Treasury of Merit.\nChekhawa, Bodhisattva (AD 1102-1176) A great Kadampa Bodhisattva who composed the text Training the Mind in Seven Points, a commentary to Bodhisattva Langri Tangpa's Eight Verses of Training the Mind. He spread the study and practice of training the mind throughout Tibet. See Universal Compassion.\nChittamatra The lower of the two schools of Mahayana tenets. 'Chittamatra' means 'mind only'. They are so called because they assert that all phenomena are merely the nature of mind. A Chittamatrin is a proponent of Chittamatra tenets. See Ocean of Nectar.\nCollection of merit A virtuous action motivated by bodhichitta that is a main cause of attaining the Form Body of a Buddha. Examples are: making offerings and prostrations to holy beings with bodhichitta motivation, and the practice of the perfections of giving, moral discipline and patience.\nCollection of wisdom A virtuous mental action motivated by bodhichitta that is a main cause of attaining the Truth Body of a Buddha. Examples are: listening to, contemplating and meditating on emptiness with bodhichitta motivation.\nCompassion A virtuous mind that wishes others to be free from suffering. See The New Eight Steps to Happiness, Universal Compassion and Modern Buddhism.\nConcentration A mental factor that makes its primary mind remain on its object single-pointedly.\nConceptual mind A thought that apprehends its object through a generic, or mental, image. See How to Understand the Mind.\nConfession Purification of negative karma by means of the four opponent powers. See The Bodhisattva Vow.\nConscientiousness A mental factor that, in dependence upon effort, cherishes what is virtuous and guards the mind from delusion and non-virtue. See How to Understand the Mind.\nContact A mental factor that functions to perceive its object as pleasant, unpleasant, or neutral. See How to Understand the Mind.\nContentment A happy mind that functions to prevent the problem of discontent.\nConventional truth Any phenomenon other than emptiness. Conventional truths are true with respect to the minds of ordinary beings, but in reality they are false. See The New Heart of Wisdom.\nDedication Dedication is by nature a virtuous mental factor; it is the virtuous intention that functions both to prevent accumulated virtue from degenerating and to cause its increase. See Joyful Path of Good Fortune.\nDelusion A mental factor that arises from inappropriate attention and functions to make the mind unpeaceful and uncontrolled. There are three main delusions: ignorance, attachment and anger. From these arise all the other delusions, such as jealousy, pride and deluded doubt. See How to Understand the Mind.\nDemi-god A being of the demi-god realm, the second highest of the six realms of samsara. Demi-gods are similar to gods, but their bodies, possessions, and environments are inferior. See Joyful Path of Good Fortune.\nDharma Buddha's teachings and the inner realizations that are attained in dependence upon practising them. 'Dharma' means 'protection'. By practising Buddha's teachings, we protect ourself from suffering and problems.\nDistraction A deluded mental factor that wanders to any object of delusion.\nDualistic appearance The appearance to mind of an object together with the inherent existence of that object. See The New Heart of Wisdom.\nEight Great Sons The eight principal Mahayana disciples of Buddha Shakyamuni: Avalokiteshvara, Manjushri, Vajrapani, Maitreya, Samantabhadra, Ksitigarbha, Sarvanivaranaviskambini and Akashagarbha. At the time of Buddha, they appeared in the aspect of Bodhisattvas, demonstrating the correct manner of practising the Mahayana paths and helping to spread Buddha's teachings extensively for the benefit of others.\nEight Verses of Training the Mind Composed by Bodhisattva Langri Tangpa in the eleventh century, this text reveals the essence of the Mahayana Buddhist path to enlightenment. For a translation and full commentary, see The New Eight Steps to Happiness.\nEight worldly concerns The objects of the eight worldly concerns are happiness and suffering, wealth and poverty, praise and criticism, and good reputation and bad reputation. These are called 'worldly concerns' because worldly people are constantly concerned with them, wanting some and trying to avoid others.\nEngaging bodhichitta After we have taken the Bodhisattva vows, our aspiring bodhichitta transforms into engaging bodhichitta, which is a mind that actually engages in the practices that lead to enlightenment.\nEnlightenment Omniscient wisdom whose nature is the permanent cessation of mistaken appearance, and whose function is to bestow mental peace on all living beings. See Joyful Path of Good Fortune, Mahamudra Tantra and Modern Buddhism.\nExtreme of attachment Also known as 'extreme of samsara', this refers to being attached to the true existence of phenomena, and thus remaining in samsara due to delusion and karma.\nExtreme of fear Also known as 'extreme of solitary peace', this refers to being afraid of the sufferings of samsara, and as a result seeking liberation for oneself alone.\nFaith A naturally virtuous mind that functions mainly to oppose the perception of faults in its observed object. There are three types of faith: believing faith, admiring faith and wishing faith. See Joyful Path of Good Fortune, Modern Buddhism and How to Transform Your Life.\nFeeling A mental factor that functions to experience pleasant, unpleasant or neutral objects. See How to Understand the Mind.\nForm realm The environment of the gods who possess form.\nFour noble truths True sufferings, true origins, true cessations and true paths. They are called 'noble' truths because they are supreme objects of meditation. They are sometimes referred to as the 'four truths of Superiors'. Through meditation on the four noble truths, we can realize ultimate truth directly and thus become a noble, or Superior, being. See How to Solve Our Human Problems and Joyful Path of Good Fortune.\nFour opponent powers Four powers that are essential for successful purification: the power of reliance, the power of regret, the power of the opponent force and the power of promise. See The Bodhisattva Vow.\nFunctioning thing A phenomenon that is produced and disintegrates within a moment. Synonymous with impermanent phenomenon, thing and product.\nGod 'Deva' in Sanskrit. A being of the god realm, the highest of the six realms of samsara. There are many different types of god. Some are desire realm gods, while others are form or formless realm gods. See Joyful Path of Good Fortune.\nHearer One of two types of Hinayana practitioner. Both Hearers and Solitary Realizers are Hinayanists, but they differ in their motivation, behaviour, merit, and wisdom. In all these respects, Solitary Realizers are superior to Hearers. See Ocean of Nectar.\nHell realm The lowest of the six realms of samsara. See Joyful Path of Good Fortune.\nHinayana Sanskrit term for 'Lesser Vehicle'. The Hinayana goal is to attain merely one's own liberation from suffering by completely abandoning delusions. See Joyful Path of Good Fortune.\nHumility A virtuous mental factor whose main function is to reduce deluded pride. See The New Eight Steps to Happiness.\nHungry spirit A being of the hungry spirit realm, the second lowest of the six realms of samsara. See Joyful Path of Good Fortune.\nImputation According to the Madhyamika-Prasangika school, all phenomena are merely imputed by conception in dependence upon their basis of imputation. Therefore, they are mere imputation and do not exist from their own side. See The New Heart of Wisdom.\nInherent existence An imagined mode of existence whereby phenomena are held to exist from their own side, independent of other phenomena. In reality, all phenomena lack, or are empty of, inherent existence because they depend upon their parts. See Modern Buddhism and The New Heart of Wisdom.\nIshvara A god who abides in the Land of Controlling Emanations, the highest state of existence within the desire realm. Ishvara has limited, contaminated miracle powers that make him more powerful than other beings in the desire realm.\nJe Tsongkhapa (AD 1357-1419) An emanation of the Wisdom Buddha Manjushri, whose appearance in fourteenth-century Tibet as a monk, and the holder of the lineage of pure view and pure deeds, was prophesied by Buddha. He spread a very pure Buddhadharma throughout Tibet, showing how to combine the practices of Sutra and Tantra, and how to practise pure Dharma during degenerate times. His tradition later became known as the 'Gelug', or 'Ganden Tradition'. See Heart Jewel and Great Treasury of Merit.\nKadampa A Tibetan word in which 'Ka' means 'word' and refers to all Buddha's teachings, 'dam' refers to Atisha's special Lamrim instructions known as the 'stages of the path to enlightenment', and 'pa' refers to a follower of Kadampa Buddhism who integrates all the teachings of Buddha that they know into their Lamrim practice. See also Kadampa Buddhism and Kadampa Tradition.\nKadampa Buddhism A Mahayana Buddhist school founded by the great Indian Buddhist Master Atisha (AD 982-1054). See also Kadampa and Kadampa Tradition.\nKadampa Tradition The pure tradition of Buddhism established by Atisha. Followers of this tradition up to the time of Je Tsongkhapa are known as 'Old Kadampas', and those after the time of Je Tsongkhapa are known as 'New Kadampas'. See also Kadampa and Kadampa Buddhism. See Modern Buddhism.\nKarma Sanskrit word meaning 'action'. Through the force of intention, we perform actions with our body, speech and mind, and all of these actions produce effects. The effect of virtuous actions is happiness and the effect of negative actions is suffering. See Joyful Path of Good Fortune.\nLamrim A Tibetan term, literally meaning 'stages of the path'. A special arrangement of all Buddha's teachings that is easy to understand and put into practice. It reveals all the stages of the path to enlightenment. For a full commentary, see Joyful Path of Good Fortune.\nLangri Tangpa, Bodhisattva (AD 1054-1123) A great Kadampa Teacher who was famous for his realization of exchanging self with others. He composed Eight Verses of Training the Mind. See The New Eight Steps to Happiness.\nLiberation 'Nirvana' in Sanskrit. Complete freedom from samsara and its cause, the delusions. See Joyful Path of Good Fortune.\nLiving being Any being who possesses a mind that is contaminated by delusions or their imprints. Both 'living being' and 'sentient being' are terms used to distinguish beings whose minds are contaminated by either of these two obstructions from Buddhas, whose minds are completely free from these obstructions.\nLord of Death Although the mara, or demon, of uncontrolled death is not a living being, it is personified as the Lord of Death, or 'Yama'. The Lord of Death is depicted in the diagram of the Wheel of Life clutching the wheel between his claws and teeth. See Joyful Path of Good Fortune.\nLower realms The hell realm, hungry spirit realm and animal realm. See also Samsara.\nMadhyamika A Sanskrit term, literally meaning 'Middle Way'. The higher of the two schools of Mahayana tenets. The Madhyamika view was taught by Buddha in the Perfection of Wisdom Sutras during the second turning of the Wheel of Dharma and was subsequently elucidated by Nagarjuna and his followers. There are two divisions of this school, Madhyamika-Svatantrika and Madhyamika-Prasangika, of which the latter is Buddha's final view. See Ocean of Nectar.\nMahayana Sanskrit term for 'Great Vehicle', the spiritual path to great enlightenment. The Mahayana goal is to attain Buddhahood for the benefit of all living beings by completely abandoning delusions and their imprints. See Joyful Path of Good Fortune.\nMaitreya The embodiment of the loving kindness of all the Buddhas. At the time of Buddha Shakyamuni he manifested as a Bodhisattva disciple. In the future, he will manifest as the fifth founding Buddha.\nManjushri The embodiment of the wisdom of all the Buddhas.\nMantra A Sanskrit word, literally meaning 'mind protection'. Mantra protects the mind from ordinary appearances and conceptions. There are four types of mantra: mantras that are mind, mantras that are inner wind, mantras that are sound and mantras that are form. In general, there are three types of mantra recitation: verbal recitation, mental recitation and vajra recitation. See Tantric Grounds and Paths.\nMeditation Meditation is a mind that concentrates on a virtuous object, and is a mental action that is the main cause of mental peace. There are two types of meditation \"“ analytical meditation and placement meditation. When we use our imagination, mindfulness, and powers of reasoning to find our object of meditation, this is analytical meditation. When we find our object and hold it single-pointedly, this is placement meditation. There are different types of object. Some, such as impermanence or emptiness, are objects apprehended by the mind. Others, such as love, compassion, and renunciation, are actual states of mind. We engage in analytical meditation until the specific object that we seek appears clearly to our mind or until the particular state of mind that we wish to generate arises. This object or state of mind is our object of placement meditation. See The New Meditation Handbook.\nMental factor A cognizer that principally apprehends a particular attribute of an object. Each moment of mind comprises a primary mind and various mental factors. See How to Understand the Mind.\nMental stabilization Generally, the terms 'mental stabilization' and 'concentration' are interchangeable. More specifically, the term 'concentration' is used to refer to the nature of concentration, which is single-pointedness, and the term 'mental stabilization' is used to refer to the function of concentration, which is stability.\nMerit The good fortune created by virtuous actions. It is the potential power to increase our good qualities and produce happiness.\nMethod practic Any spiritual path that functions to ripen our Buddha lineage. Training in renunciation, compassion and bodhichitta are examples of method practices.\nMind That which is clarity and cognizes. Mind is clarity because it always lacks form and because it possesses the actual power to perceive objects. Mind cognizes because its function is to know or perceive objects. See Clear Light of Bliss, How to Understand the Mind and Mahamudra Tantra.\nMindfulness A mental factor that functions not to forget the object realized by the primary mind. See How to Understand the Mind.\nMiserliness A deluded mental factor that, motivated by desirous attachment, holds onto things tightly and does not want to part with them. See How to Understand the Mind.\nMount Meru According to Buddhist cosmology, a divine mountain that stands at the centre of the universe.\nNagarjuna A great Indian Buddhist scholar and meditation master who revived the Mahayana in the first century AD by bringing to light the teachings on the Perfection of Wisdom Sutras. See Modern Buddhism and Ocean of Nectar.\nNegative phenomenon An object that is realized through the mind explicitly eliminating a negated object. There are two types of negative phenomena: affirming negatives and non-affirming negatives. An affirming negative is a negative phenomenon realized by a mind that eliminates its negated object while realizing another phenomenon. A non-affirming negative is a negative phenomenon realized by a mind that merely eliminates its negated object without realizing another phenomenon. See Ocean of Nectar.\nNon-alertness A deluded mental factor that, being unable to distinguish faults from non-faults, causes us to develop faults.\nNon-conscientiousness A deluded mental factor that wishes to engage in non-virtuous actions without restraint.\nNon-existent Traditional examples of non-existents are a horn on a rabbit's head and a child of a barren woman. A horn on a rabbit's head, for example, is not established by any valid mind and is consequently a non-existent rather than a conventional (or ultimate) truth. See The New Heart of Wisdom.\nObject of negation An object explicitly negated by a mind realizing a negative phenomenon. In meditation on emptiness, or lack of inherent existence, it refers to inherent existence. Also known as 'negated object'. See Modern Buddhism.\nObstructions to liberation Obstructions that prevent the attainment of liberation. All delusions, such as ignorance, attachment and anger, together with their seeds, are obstructions to liberation. Also called 'delusion-obstructions'.\nObstructions to omniscience The imprints of delusions, which prevent simultaneous and direct realization of all phenomena. Only Buddhas have overcome these obstructions. Also called 'obstructions to knowing'.\nPatience A virtuous determination to forbear harm, suffering, or profound Dharma. See How to Solve Our Human Problems.\nPerfection of Wisdom Sutras Sutras of the second turning of the Wheel of Dharma, in which Buddha revealed his final view of the ultimate nature of all phenomena \"“ emptiness of inherent existence. See The New Heart of Wisdom and Ocean of Nectar.\nPermanent phenomenon Phenomena are either permanent or impermanent. A permanent phenomenon is a phenomenon that does not depend upon causes and that does not disintegrate moment by moment.\nPrasangika See Madhyamika.\nPretension A deluded mental factor that, motivated by attachment to wealth or reputation, wishes to pretend that we possess qualities that we do not possess.\nPride A deluded mental factor that, through considering and exaggerating one's own good qualities or possessions, feels arrogant.\nPrimary mind A cognizer that principally apprehends the mere entity of an object. Synonymous with consciousness. There are six primary minds: eye consciousness, ear consciousness, nose consciousness, tongue consciousness, body consciousness and mental consciousness. Each moment of mind comprises a primary mind and various mental factors. A primary mind and its accompanying mental factors are the same entity but have different functions. See How to Understand the Mind.\nProponents of things The Vaibhashika, Sautrantika and Chittamatra Buddhist schools are known as 'proponents of things' because they assert that things are truly existent. See Ocean of Nectar.\nProstration An action of showing respect with body, speech or mind. See The Bodhisattva Vow.\nPure Land A pure environment in which there are no true sufferings. There are many Pure Lands. For example, Tushita is the Pure Land of Buddha Maitreya, Sukhavati is the Pure Land of Buddha Amitabha, and Keajra is the Pure Land of Buddha Vajrayogini and Buddha Heruka. See Living Meaningfully, Dying Joyfully.\nPurification Generally, any practice that leads to the attainment of a pure body, speech or mind. More specifically, a practice for purifying negative karma by means of the four opponent powers. See The Bodhisattva Vow.\nRefuge Actual protection. To go for refuge to Buddha, Dharma, and Sangha means to have faith in these Three Jewels and to rely upon them for protection from all fears and suffering. See Joyful Path of Good Fortune.\nRenunciation The wish to be released from samsara. See Joyful Path of Good Fortune.\nSamantabhadra Sanskrit name for 'All Good One', a Bodhisattva renowned for his extensive offerings. See Great Treasury of Merit.\nSamkhya A non-Buddhist school, the oldest of the Brahmaic schools. See Ocean of Nectar.\nSamsara This can be understood in two ways \"“ as uninterrupted rebirth without freedom or control, or as the aggregates of a being who has taken such a rebirth. Samsara, sometimes known as 'cyclic existence', is characterized by suffering and dissatisfaction. There are six realms of samsara. Listed in ascending order according to the type of karma that causes rebirth in them, they are the realms of the hell beings, hungry spirits, animals, human beings, demi-gods and gods. The first three are lower realms or unhappy migrations, and the second three are higher realms or happy migrations. Although from the point of view of the karma that causes rebirth there, the god realm is the highest realm in samsara, the human realm is said to be the most fortunate realm because it provides the best conditions for attaining liberation and enlightenment. See Joyful Path of Good Fortune.\nSangha According to the Vinaya tradition, any community of four or more fully ordained monks or nuns. In general, ordained or lay people who take Bodhisattva vows or Tantric vows can also be said to be Sangha. See Joyful Path of Good Fortune.\nSelf An I imputed in dependence upon any of the five aggregates. Person, being, self and I are synonyms. See How to Understand the Mind.\nSelf-cherishing A mental attitude that considers oneself to be supremely important and precious. See The New Eight Steps to Happiness.\nSelf-cognizer A consciousness that experiences itself.\nSelf-grasping A conceptual mind that holds any phenomenon to be inherently existent. The mind of self-grasping gives rise to all other delusions, such as anger and attachment. It is the root cause of all suffering and dissatisfaction. See The New Heart of Wisdom and Modern Buddhism.\nSense of shame A mental factor that functions to avoid inappropriate actions for reasons that concern oneself. See How to Understand the Mind.\nSix perfections The perfections of giving, moral discipline, patience, effort, mental stabilization and wisdom. They are called 'perfections' because they are motivated by bodhichitta.\nSix powers The five sense powers and the mental power. A sense power is an inner power located in the very centre of a sense organ that functions directly to produce a sense awareness. There are five sense powers, one for each type of sense awareness. A mental power is a mind that principally functions directly to produce the uncommon aspect of a mental awareness. See How to Understand the Mind.\nSolitary Realizer One of two types of Hinayana practitioner. See also Hearer. See Ocean of Nectar.\nSpiritual Guide 'Guru' in Sanskrit, 'Lama' in Tibetan. A Teacher who guides us along the spiritual path. See Joyful Path of Good Fortune and Great Treasury of Merit.\nStupa A symbolic representation of Buddha's mind.\nSugata Another Sanskrit term for a Buddha. It indicates that Buddhas have attained a state of immaculate and indestructible bliss.\nSukhavati Sanskrit term for 'Pure Land of Bliss' or 'Blissful Land' \"“ the Pure Land of Buddha Amitabha.\nSuperior seeing A special wisdom that sees its object clearly, and that is maintained by tranquil abiding and the special suppleness that is induced by investigation. See Joyful Path of Good Fortune.\nTathagata Sanskrit term for 'A Being Gone Beyond', which is another term for Buddha.\nTen directions The four cardinal directions, the four intermediate directions, and the directions above and below.\nThree higher trainings Training in moral discipline, concentration and wisdom motivated by renunciation or bodhichitta.\nThree Jewels The three objects of refuge: Buddha Jewel, Dharma Jewel, and Sangha Jewel. They are called 'Jewels' because they are both rare and precious. See Joyful Path of Good Fortune.\nThree worlds In the context of this text, 'worlds' refers to 'realms'. The 'three worlds' are therefore the desire realm, the form realm and the formless realm, which are the three levels within samsara. The desire realm is the environment of hell beings, hungry spirits, animals, human beings, demi-gods and the gods who enjoy the five objects of desire. The form realm is the environment of the gods who possess form. The formless realm is the environment of the gods who do not possess form.\nTraining the mind 'Lojong' in Tibetan. A special lineage of instructions that came from Buddha Shakyamuni through Manjushri and Shantideva to Atisha and the Kadampa Teachers, which emphasizes the generation of bodhichitta through the practices of equalizing and exchanging self with others combined with taking and giving. See Universal Compassion and The New Eight Steps to Happiness.\nTraining the Mind in Seven Points A commentary to Eight Verses of Training the Mind, composed by Bodhisattva Chekhawa. For a translation and full commentary, see Universal Compassion.\nTranquil abiding A concentration that possesses the special bliss of physical and mental suppleness that is attained in dependence upon completing the nine mental abidings. See Joyful Path of Good Fortune.\nTrue existence Existence in any way independent of conceptual imputation.\nTrue-grasping A conceptual mind that apprehends true existence.\nTruth Body 'Dharmakaya' in Sanskrit. The Wisdom Truth Body and the Nature Body of a Buddha. The first is Buddha's omniscient mind, and the second is the emptiness, or ultimate nature, of his or her mind. See Joyful Path of Good Fortune.\nVaibhashika The lower of the two schools of Hinayana tenets. This school does not accept self-cognizers and asserts external objects to be truly existent. See Ocean of Nectar.\nVajrapani The embodiment of the power of all the Buddhas. He appears in a wrathful aspect, displaying his power to overcome outer, inner and secret obstacles. At the time of Buddha Shakyamuni, he manifested as a Bodhisattva disciple.\nValid cognizer A cognizer that is non-deceptive with respect to its engaged object. There are two types: inferential valid cognizers and direct valid cognizers. See How to Understand the Mind.\nVow A virtuous determination to abandon particular faults that is generated in conjunction with a traditional ritual. The three sets of vows are the Pratimoksha vows of individual liberation, the Bodhisattva vows, and the Secret Mantra or Tantric vows. See The Bodhisattva Vow and Tantric Grounds and Paths.\nWishfulfilling jewel A legendary jewel that grants all wishes.\nYogi/Yogini Sanskrit words usually referring to a male or a female meditator who has attained the union of tranquil abiding and superior seeing.\nBibliography\nVenerable Geshe Kelsang Gyatso Rinpoche is a highly respected meditation master and scholar of the Mahayana Buddhist tradition founded by Je Tsongkhapa. Since arriving in the West in 1977, Venerable Geshe Kelsang Gyatso Rinpoche has worked tirelessly to establish pure Buddhadharma throughout the world. Over this period he has given extensive teachings on the major scriptures of the Mahayana. These teachings provide a comprehensive presentation of the essential Sutra and Tantra practices of Mahayana Buddhism.\nBooks\nThe following books by Venerable Geshe Kelsang Gyatso Rinpoche are all published by Tharpa Publications.\nThe Bodhisattva Vow A practical guide to helping others. (2nd. edn., 1995)\nClear Light of Bliss A Tantric meditation manual. (3rd. edn., 2014)\nEssence of Vajrayana The Highest Yoga Tantra practice of Heruka body mandala. (2nd. edn., 2017)\nGreat Treasury of Merit How to rely upon a Spiritual Guide. (2nd. edn., 2015)\nGuide to the Bodhisattva's Way of Life How to enjoy a life of great meaning and altruism. (A translation of Shantideva's famous verse masterpiece.) (2nd. edn., 2018)\nHeart Jewel The essential practices of Kadampa Buddhism. (2nd. edn., 1997)\nHow to Solve Our Human Problems The four noble truths. (2005)\nHow to Transform Your Life A blissful journey. (3rd. edn., 2016)\nHow to Understand the Mind The nature and power of the mind. (4th. edn., 2014)\nIntroduction to Buddhism An explanation of the Buddhist way of life. (2nd. edn., 2001)\nJoyful Path of Good Fortune The path to the supreme happiness of enlightenment. (4th. edn., 2018)\nLiving Meaningfully, Dying Joyfully The profound practice of transference of consciousness. (1999)\nMahamudra Tantra The supreme Heart Jewel nectar. (2005)\nMeaningful to Behold Becoming a friend of the world. (6th. edn., 2016)\nThe Mirror of Dharma with Additions How to find the real meaning of human life. (2nd. edn., 2019)\nModern Buddhism The Path of Compassion and Wisdom. (2nd. edn., 2013)\nThe New Eight Steps to Happiness The Buddhist way of loving kindness. (3rd. edn., 2016)\nThe New Guide to Dakini Land The Highest Yoga Tantra practice of Buddha Vajrayogini. (3rd. edn., 2012)\nThe New Heart of Wisdom Profound teachings from Buddha's heart (An explanation of the Heart Sutra). (5th. edn., 2012)\nThe New Meditation Handbook Meditations to make our life happy and meaningful. (5th. edn., 2013)\nOcean of Nectar The true nature of all things. (2nd. edn., 2017)\nThe Oral Instructions of Mahamudra (2nd. edn., 2016)\nTantric Grounds and Paths How to enter, progress on, and complete the Vajrayana path. (2nd. edn., 2016)\nUniversal Compassion Inspiring solutions for difficult times. (4th. edn., 2002)\nSadhanas and Other Booklets\nVenerable Geshe Kelsang Rinpoche has also supervised the translation of a collection of essential sadhanas, or ritual prayers for spiritual attainments, available in booklet or audio formats.\nAvalokiteshvara Sadhana Prayers and requests to the Buddha of Compassion.\nThe Blissful Path The condensed self-generation sadhana of Vajrayogini.\nThe Bodhisattva's Confession of Moral Downfalls The purification practice of the Mahayana Sutra of the Three Superior Heaps.\nCondensed Long Life Practice of Buddha Amitayus.\nDakini Yoga The middling self-generation sadhana of Vajrayogini.\nDrop of Essential Nectar A special fasting and purification practice in conjunction with Eleven-faced Avalokiteshvara.\nEssence of Good Fortune Prayers for the six preparatory practices for meditation on the stages of the path to enlightenment.\nEssence of Vajrayana Heruka body mandala self-generation sadhana according to the system of Mahasiddha Ghantapa.\nFeast of Great Bliss Vajrayogini self-initiation sadhana.\nGreat Liberation of the Father Preliminary prayers for Mahamudra meditation in conjunction with Heruka practice.\nGreat Liberation of the Mother Preliminary prayers for Mahamudra meditation in conjunction with Vajrayogini practice.\nThe Great Mother A method to overcome hindrances and obstacles by reciting the Essence of Wisdom Sutra (the Heart Sutra).\nA Handbook for the Daily Practice of Bodhisattva and Tantric Vows.\nHeart Jewel The Guru yoga of Je Tsongkhapa combined with the condensed sadhana of his Dharma Protector.\nHeartfelt Prayers Funeral service for cremations and burials.\nThe Hundreds of Deities of the Joyful Land According to Highest Yoga Tantra The Guru Yoga of Je Tsongkhapa as a Preliminary Practice for Mahamudra.\nThe Kadampa Way of Life The essential practice of Kadam Lamrim.\nKeajra Heaven The essential commentary to the practice of The Uncommon Yoga of Inconceivability.\nLay Pratimoksha Vow Ceremony.\nLiberating Prayer Praise to Buddha Shakyamuni.\nLiberation from Sorrow Praises and requests to the Twenty-one Taras.\nMahayana Refuge Ceremony and Bodhisattva Vow Ceremony.\nMedicine Buddha Prayer A method for benefiting others.\nMedicine Buddha Sadhana A method for accomplishing the attainments of Medicine Buddha.\nMeditation and Recitation of Solitary Vajrasattva.\nMelodious Drum Victorious in all Directions The extensive fulfilling and restoring ritual of the Dharma Protector, the great king Dorje Shugden, in conjunction with Mahakala, Kalarupa, Kalindewi and other Dharma Protectors.\nThe New Essence of Vajrayana Heruka body mandala self-generation practice, an instruction of the Ganden Oral Lineage.\nOffering to the Spiritual Guide (Lama Chopa) A special way of relying upon a Spiritual Guide.\nPath of Compassion for the Deceased Powa sadhana for the benefit of the deceased.\nPathway to the Pure Land Training in powa \"“ the transference of consciousness.\nPowa Ceremony Transference of consciousness for the deceased.\nPrayers for Meditation Brief preparatory prayers for meditation.\nPrayers for World Peace.\nA Pure Life The practice of taking and keeping the eight Mahayana precepts.\nQuick Path to Great Bliss The extensive self-generation sadhana of Vajrayogini.\nRequest to the Holy Spiritual Guide Venerable Geshe Kelsang Gyatso from his Faithful Disciples.\nThe Root Tantra of Heruka and Vajrayogini Chapters One & Fifty-one of the Condensed Heruka Root Tantra.\nThe Root Text: Eight Verses of Training the Mind.\nTreasury of Wisdom The sadhana of Venerable Manjushri.\nThe Uncommon Yoga of Inconceivability The special instruction of how to reach the Pure Land of Keajra with this human body.\nUnion of No More Learning Heruka body mandala self-initiation sadhana.\nThe Vows and Commitments of Kadampa Buddhism.\nWishfulfilling Jewel The Guru yoga of Je Tsongkhapa combined with the sadhana of his Dharma Protector.\nThe Yoga of Buddha Amitayus A special method for increasing lifespan, wisdom and merit.\nThe Yoga of Buddha Heruka The essential self-generation sadhana of Heruka body mandala & Condensed six-session yoga.\nThe Yoga of Buddha Maitreya Self-generation sadhana.\nThe Yoga of Buddha Vajrapani Self-generation sadhana.\nThe Yoga of Enlightened Mother Arya Tara Self-generation sadhana.\nThe Yoga of Great Mother Prajnaparamita Self-generation sadhana.\nThe Yoga of Thousand-armed Avalokiteshvara Self-generation sadhana.\nThe Yoga of White Tara, Buddha of Long Life.\nTo order any of our publications, or to receive a catalogue, please visit www.tharpa.com or contact your nearest Tharpa Office listed here.\nStudy Programmes of Kadampa Buddhism\nKadampa Buddhism is a Mahayana Buddhist school founded by the great Indian Buddhist Master Atisha (AD 982-1054). His followers are known as 'Kadampas'. 'Ka' means 'word' and refers to Buddha's teachings, and 'dam' refers to Atisha's special Lamrim instructions known as 'the stages of the path to enlightenment'. By integrating their knowledge of all Buddha's teachings into their practice of Lamrim, and by integrating this into their everyday lives, Kadampa Buddhists are encouraged to use Buddha's teachings as practical methods for transforming daily activities into the path to enlightenment. The great Kadampa Teachers are famous not only for being great scholars, but also for being spiritual practitioners of immense purity and sincerity.\nThe lineage of these teachings, both their oral transmission and blessings, was then passed from Teacher to disciple, spreading throughout much of Asia, and now to many countries throughout the world. Buddha's teachings, which are known as 'Dharma', are likened to a wheel that moves from country to country in accordance with changing conditions and people's karmic inclinations. The external forms of presenting Buddhism may change as it meets with different cultures and societies, but its essential authenticity is ensured through the continuation of an unbroken lineage of realized practitioners.\nKadampa Buddhism was first introduced to the modern world in 1977 by the renowned Buddhist Master, Venerable Geshe Kelsang Gyatso Rinpoche. Since that time, he has worked tirelessly to spread Kadampa Buddhism throughout the world by giving extensive teachings, writing many profound texts on Kadampa Buddhism, and founding the New Kadampa Tradition \"“ International Kadampa Buddhist Union (NKT-IKBU), which now has over a thousand Kadampa Buddhist Centres worldwide. Each Centre offers study programmes on Buddhist psychology, philosophy and meditation instruction, as well as retreats for all levels of practitioner. The emphasis is on integrating Buddha's teachings into daily life to solve our human problems and to spread lasting peace and happiness throughout the world.\nThe Kadampa Buddhism of the NKT-IKBU is an entirely independent Buddhist tradition and has no political affiliations. It is an association of Buddhist Centres and practitioners that derive their inspiration and guidance from the example of the ancient Kadampa Buddhist Masters and their teachings, as presented by Venerable Geshe Kelsang Gyatso Rinpoche.\nThere are three reasons why we need to study and practise the teachings of Buddha: to develop our wisdom, to cultivate a good heart and to maintain a peaceful state of mind. If we do not strive to develop our wisdom, we will always remain ignorant of ultimate truth \"“ the true nature of reality. Although we wish for happiness, our ignorance leads us to engage in non-virtuous actions, which are the main cause of all our suffering. If we do not cultivate a good heart, our selfish motivation destroys harmony and good relationships with others. We have no peace, and no chance to gain pure happiness. Without inner peace, outer peace is impossible. If we do not maintain a peaceful state of mind, we are not happy even if we have ideal conditions. On the other hand, when our mind is peaceful, we are happy, even if our external conditions are unpleasant. Therefore, the development of these qualities is of utmost importance for our daily happiness.\nVenerable Geshe Kelsang Gyatso Rinpoche, or 'Venerable Geshe-la' as he is affectionately called by his students, has designed three special spiritual programmes for the systematic study and practice of Kadampa Buddhism that are especially suited to the modern world \"“ the General Programme (GP), the Foundation Programme (FP) and the Teacher Training Programme (TTP).\nGENERAL PROGRAMME\nThe General Programme provides a basic introduction to Buddhist view, meditation and practice that is suitable for beginners. It also includes advanced teachings and practice from both Sutra and Tantra.\nFOUNDATION PROGRAMME\nThe Foundation Programme provides an opportunity to deepen our understanding and experience of Buddhism through a systematic study of six texts:\n1 Joyful Path of Good Fortune \"“ a commentary to Atisha's Lamrim instructions, the stages of the path to enlightenment.\n2 Universal Compassion \"“ a commentary to Bodhisattva Chekhawa's Training the Mind in Seven Points.\n3 The New Eight Steps to Happiness \"“ a commentary to Bodhisattva Langri Tangpa's Eight Verses of Training the Mind.\n4 The New Heart of Wisdom \"“ a commentary to the Heart Sutra.\n5 Meaningful to Behold \"“ a commentary to Venerable Shantideva's Guide to the Bodhisattva's Way of Life.\n6 How to Understand the Mind \"“ a detailed explanation of the mind, based on the works of the Buddhist scholars Dharmakirti and Dignaga.\nThe benefits of studying and practising these texts are as follows:"
      }
    }
  }
}