{
  "id": "2025-11-30",
  "date": "Nov 30",
  "year": "2025",
  "topic": "Benefits of Bodhicitta",
  "recording": "https://drive.google.com/file/d/1avRjDRiqgFxvezWqWpL__N4LV4nBVolz/view?usp=share_link",
  "practice": {
    "title": "Contemplate the Ten Benefits",
    "steps": [
      "Learn the ten benefits: CAWN-I-VIP-SS (Conquest, Attainment, Wish-fulfillment, Name & meaning, Inferior transformed, Value, Increasing benefits, Protection, Swift destruction, Scriptural citations)",
      "Do one benefit per day — really milk it until it touches your heart",
      "Or match benefits to your six sessions — one per session",
      "Do the postcard experiment: Go to three places (one comfortable, one neutral, one you think will reject you) and offer a meditation postcard. Notice your mind.",
      "Bring benefits of bodhicitta into your Six-Session practice — let admiring faith grow"
    ],
    "quote": "We're basically always wishing for something. What we're trying to do is raise our wish for bodhicitta to a critical mass greater than our worldly concerns."
  },
  "commentary": [
    {
      "title": "The Ten Benefits — CAWN-I-VIP-SS",
      "content": [
        "Conquest of all great evils. Attainment of most sublime happiness. Wish fulfillment. Special Name and meaning.",
        "Transformation of the Inferior into the supreme. Value of supreme bodhicitta (so hard to find). Increasing and inexhaustible benefits.",
        "Power of Protection from great fear. Swift and easy destruction of great evil. Scriptural citations.",
        "These ten are ten individual meditations. Get a special feeling for all ten — you need to milk them a little bit."
      ]
    },
    {
      "title": "One Benefit Per Day",
      "content": [
        "Try one benefit a day and keep it in mind throughout the day. Bring it into your Six-Session practice.",
        "Sometimes the first few shots, you're not there yet — you're just getting your mind around it. By the third or fourth session, you start to feel what's really being talked about.",
        "For example: 'Bodhicitta carries with it a special name and meaning.' Does that touch your heart at first? Maybe not. But there's this lineage of Buddhahood... I'm in this lineage. Ah, that's why it's so special."
      ],
      "quote": "I've found personally, one a day is a nice way to do it."
    },
    {
      "title": "Faith → Aspiration → Effort",
      "content": [
        "The way to develop any positive state of mind is through the dependent relationship between faith, aspiration, and effort.",
        "Through admiring faith in bodhicitta, we develop wishing faith (aspiration), and then we put in joyful effort.",
        "If we have a strong, powerful wish to develop bodhicitta, we just will — very quickly and easily. Without that wish, we feel like 'I should do it, I'm supposed to' — a moralistic, dead place to live."
      ],
      "quote": "All we have to do is admire it more and more."
    },
    {
      "title": "Raise Your Wish Above Worldly Concerns",
      "content": [
        "We're basically always wishing for something. When our Dharma practice is dominated by wishes for worldly concerns — wealth, reputation, pleasure, avoiding pain — those wishes dominate everything we do.",
        "It's like owning 51% of a company — you have deciding power. We want our wish for bodhicitta to have 51%.",
        "The benefits help us see: my basic wish to be happy is being fulfilled by bodhicitta. Craving worldly things goes AGAINST my basic wishes because it makes me absolutely miserable."
      ]
    },
    {
      "title": "What Is 'Evil'?",
      "content": [
        "Mara in Sanskrit means demon — something that obstructs our liberation. The five contaminated aggregates, uncontrolled death, and especially delusions are Maras.",
        "We want to feel the gravity of it. Sometimes we don't think of delusions that way: 'Oh, it's just a little attachment.' But what does attachment do to us? It's terrifying. The effects are evil — terrible.",
        "Bodhicitta conquers all this. When the container and contents are filled with evil, transform adverse conditions into the path to enlightenment."
      ],
      "quote": "The only thing to hold onto when we feel like we're drowning is compassion for others."
    },
    {
      "title": "The Postcard Experiment",
      "content": [
        "Take three postcards from the center. Go to three places: one where people will be open, one neutral, one where you think they'll reject you.",
        "Just say: 'Hey, I've got a postcard for a meditation class.' Oppose your fear and nervousness. See what happens.",
        "The point is to look at our mind that wants to connect to others — or wants to isolate. Start learning about it."
      ],
      "quote": "I don't think we want to put anyone in a box. Meditation is just about overcoming delusions and increasing virtues. That's for everyone."
    },
    {
      "title": "Don't Isolate Your Practice",
      "content": [
        "We want to explore: what is this tendency towards isolation in our practice and life? Do we conceptualize our practice as something private, alone, isolated?",
        "Bodhicitta is about reaching out, connecting to others, benefiting others. We oppose our fear and nervousness.",
        "Even places you think won't be interested — you might be surprised. One student went to a barbershop with religious garb and they said: 'Meditation? Fantastic! Put it right there!'"
      ]
    }
  ],
  "mtb": {
    "startParagraph": 106,
    "endParagraph": 113
  },
  "shantideva": {
    "chapter": 1,
    "startVerse": 1,
    "endVerse": 14
  },
  "preview": {
    "startParagraph": 114,
    "endParagraph": 136
  }
}