{
  "id": "2025-11-02",
  "date": "Nov 2",
  "year": "2025",
  "topic": "Six-Session Foundations",
  "recording": "https://drive.google.com/file/d/1M1zkSADuLYCYyy7fFpWT2LsK2v4tN5Ev/view?usp=share_link",
  "practice": {
    "title": "Set Up Your Six-Session Practice",
    "steps": [
      "Identify your six times — based on your schedule (9-to-5, meal-oriented, every 3 hours, or variable by theme)",
      "Match sessions to pain points — the tough parts of your day (commute, afternoon slump, loneliness at night)",
      "Make a list of people most angry at you and practice being okay with that",
      "Pick one benefit of bodhicitta from MTB to contemplate, to 'tether us to the book'",
      "Plan for disruptions — anticipate schedule changes (vacations, family time) and create alternative anchors",
      "Give your sessions names — it makes them more fun and personal"
    ],
    "quote": "The six sessions are like pillars that hold up the palace of our mindfulness in the day."
  },
  "commentary": [
    {
      "title": "Break the 'One Daily Practice' Myth",
      "content": [
        "There's a wrong conception that meditation is about doing one formal practice and then riding that through the day. That's a made-up concept — nothing to do with Kadampa Buddhism.",
        "As Geshe-la says in Modern Buddhism, Kadampa Buddhism cannot be separated from daily life. We want our whole day to be a sadhana.",
        "The meditation break is more important than the meditation session, because it's longer. The six sessions support a meditation break practice that continues all day."
      ],
      "quote": "We have to break out of the concept of the one daily practice behemoth that we do, check off a box, and then go live our life."
    },
    {
      "title": "Pillars of Mindfulness",
      "content": [
        "It's difficult to have perfect mindfulness all day. So the six sessions become pillars that hold up the palace of our mindfulness.",
        "They're like outposts where we connect to a powerful, positive, virtuous feeling — even if just for 30 seconds or a minute. That feeling then slowly leaks out into the time in between.",
        "If you do this for a month in a way you really like — not rigid or rote — these cognitive structures will just be there. They'll start to function on their own, like an engine that runs itself."
      ],
      "quote": "These six sessions are like pillars that hold up the palace of our mindfulness in the day."
    },
    {
      "title": "Schedule Options",
      "content": [
        "The 9-to-5 version: Wake up, beginning of workday, beginning of afternoon, getting home, bedtime — plus one more.",
        "The meal-oriented version: Wake up, breakfast, lunch, dinner, bedtime, plus a seated practice somewhere.",
        "The every-3-hours version: Great for retirees or unstructured days. Those hours become sacred — you know exactly what you do at 12, at 3, at 6.",
        "The variable version: For those whose days are all different. Batch by themes — match sessions to pain points like commutes or difficult transitions."
      ]
    },
    {
      "title": "Six Mini-Days",
      "content": [
        "Think of each session as a mini-day. Ask: what do I need for my practice in this little three-hour day?",
        "For example, if you get irritable in the afternoon, what practices will oppose that? Maybe wishing love, or guarding speech, or something to make you lighter and less intense.",
        "The end of day is totally different — it's about reflecting on how the day went and getting ready for the yoga of sleep."
      ],
      "quote": "We actually start to see that each day we live many different days. There are lots of different energies in one day."
    },
    {
      "title": "The Middle Sessions Are Most Important",
      "content": [
        "For people with typical working lives, the mid-morning and mid-afternoon sessions are the most important of the whole day.",
        "You can start off strong, but if you don't get those middle two, you just slowly descend all day. Then at the end, you try to pick up from where you got to.",
        "It's a cool feeling to break through the habit of letting everything fall away and get tired and grumpy. This practice can snap us out of that."
      ],
      "quote": "Those middle sessions are like the bridge. They're the most important ones of the whole day."
    },
    {
      "title": "Breaking the Stillness Myth",
      "content": [
        "We'll break down the correlation between meditation and stillness, eyes closed, being physically still. Meditation is a mental action.",
        "The goal is to be in the mandala 24/7 — walking, talking, running, whatever. Our mind is in the Pure Land all the time.",
        "Study the Mahasiddhas — these great yogis were all working people, running around, doing tons of stuff. They are the exemplary practitioners of tantra."
      ],
      "quote": "If our private seated practice feels uniquely more holy than taking out the trash, we've actually created a delusion."
    },
    {
      "title": "The Repeater Analogy",
      "content": [
        "When sending a telecommunications signal across the country, you don't send one huge powerful signal and let it degrade. You send an average one and have it repeated, reinvigorated along the way.",
        "Our six sessions are like repeaters. They maintain where we're at spiritually throughout the day.",
        "One teacher said doing just bodhicitta for one minute, six times a day, was the deepest meditation he'd done in a decade — because he was really bringing it into daily life."
      ],
      "quote": "The successions become like repeaters that maintain where we're at."
    },
    {
      "title": "Give Them Names",
      "content": [
        "You can give your sessions names — it makes them more fun. Sun time, song time, wish time, tea time, wind time, moon time.",
        "One student named hers after aspects of Dorje Shugden: morning is the mongoose (spitting out jewels with coffee), danger zone midday is the dragon warrior guarding speech, subway home as a snow lion.",
        "Now you're like: 'Ooh, I'm in this part of the day. I love this one.'"
      ]
    }
  ],
  "mtb": {},
  "shantideva": {},
  "preview": {
    "startParagraph": 15,
    "endParagraph": 57
  }
}