{
  "id": "2025-11-09",
  "date": "Nov 9",
  "year": "2025",
  "topic": "Expecting Difficulties",
  "recording": "https://drive.google.com/file/d/1goPpvis392K-jRAmX3lE-V2qcdRJx6gv/view?usp=sharing",
  "practice": {
    "title": "Expect Things to Go Wrong",
    "steps": [
      "In one of your early sessions, acknowledge: things are definitely going to go wrong today. Expect it.",
      "Look for ways to accumulate merit throughout the day — this gives you strength to fight delusions",
      "Choose ONE delusion to focus on reducing through studying this text (not all of them at once)",
      "Use the six perfections as a diagnostic: giving, moral discipline, patience, effort, concentration, wisdom — which is deficient right now?",
      "Incorporate offerings practice — remember to offer your food and activities"
    ],
    "quote": "My first week when I came here, the center flooded. We had a hole in the ceiling for three months. It was just fantastic — a smack right in the face, day one."
  },
  "commentary": [
    {
      "title": "Don't Waste Your Time",
      "content": [
        "Geshe-la writes: if upon completion of this text we're unable to recall what's in each chapter, 'we should be ashamed of ourselves.' Guns blazing from the start!",
        "If we don't change by the end of the book, it kind of is a waste of time. TTP is three and a half hours a week, plus study and practice.",
        "We want to get to the end and feel: I'm a changed person. I don't even know the person who started that book."
      ],
      "quote": "Let's not make it a complete waste of time."
    },
    {
      "title": "Choose a Specific Delusion",
      "content": [
        "Don't try to work on 'attachment as a whole' — that's too broad. Choose a specific iteration, like discontentment.",
        "When working with delusions, there are many ways they manifest. Being patient with yourself is different from being patient with others, or with sickness.",
        "Choose an area that's very practical and relevant to what YOU need. Then figure out how to make this book work for that."
      ],
      "quote": "It's quite nice to choose an area or nuance that's very practical and relevant to what we need."
    },
    {
      "title": "Reading Practically",
      "content": [
        "Every book can teach us any dharma object. You could extract meanings on generation stage from How to Solve Our Human Problems if you wanted to.",
        "All dharma is connected — it's all linked in a system. We can get any dharma from any other dharma.",
        "The question is: what are the delusions I want to change? How is studying Meaningful to Behold going to help with those specific delusions?"
      ]
    },
    {
      "title": "The Six Perfections as a Daily Diagnostic",
      "content": [
        "When you're in a bad mood, run through the six perfections like a quick diagnostic — giving, moral discipline, patience, effort, concentration, wisdom.",
        "You'll almost always find one that's highly deficient. It's like a doctor checking blood pressure and heartbeat — quick things that give a broad overview.",
        "Maybe you're letting your mind wander to past and future on autopilot — oh, that's why I'm unhappy! Simple fix.",
        "Or maybe you're too intense — you need to live more lightly, feel yourself like an actor in a dream."
      ],
      "quote": "If I'm in a bad mood and I do a six perfection checklist, I will almost always find one that is highly deficient."
    },
    {
      "title": "Make Six Sessions Come Alive",
      "content": [
        "If your six sessions feel dead and uninspired, try making each one about a different perfection: giving hours, moral discipline hours, patience hours...",
        "Or in each session, think through the next three hours: How will I bring giving? Maybe being generous with time for someone difficult. Moral discipline? Opposing self-cherishing in that boring meeting.",
        "Patience when that one person talks in the meeting and you want to scream — welcome it, thinking: that's my karma from all the times I bored people."
      ]
    },
    {
      "title": "Why Shantideva Starts with Benefits",
      "content": [
        "From faith comes aspiration, from aspiration comes effort. This is Buddhist psychology.",
        "So what else would you do in the first chapter of a book about developing bodhicitta? Talk about its benefits! Anything else would be unwise.",
        "We need effort — joyful effort. To get effort, we need a wish. To get a wish, we need to appreciate the benefits. We need faith."
      ],
      "quote": "It would make no sense to do anything other than start with the benefits, if one understood how psychology works."
    },
    {
      "title": "The Brooklyn Welcome",
      "content": [
        "My first week at KMC Brooklyn, the center flooded. Me and Byron cleaned the basement with a mop that broke within one minute.",
        "Water poured through the ceiling like a waterfall during my classes. The hole didn't get fixed until December — squirrels could come in.",
        "I thought Brooklyn was going to be classy. Day one: this is a dump. And it's just gotten better since. Accepting the dump of Brooklyn."
      ],
      "quote": "It's a great early-day practice: expect things to go wrong."
    }
  ],
  "mtb": {
    "startParagraph": 15,
    "endParagraph": 57
  },
  "shantideva": {},
  "preview": {
    "startParagraph": 58,
    "endParagraph": 105
  }
}