{
  "id": "2025-11-16",
  "date": "Nov 16",
  "year": "2025",
  "topic": "Merit & Faith",
  "recording": "https://drive.google.com/file/d/1WDgZTgtGkNdKNSlJDAI1gs5QeBBbuJtJ/view?usp=share_link",
  "practice": {
    "title": "Be a Merit Hog",
    "steps": [
      "Imagine all the people you'll help when you're enlightened — bring this into your Six-Session practice",
      "Be a 'merit hog' like Shantideva — do everything for spiritual growth and accumulating merit. No limit on how much merit you're allowed to create!",
      "Observe your faith in karma — notice when you're happy or sad about not seeing results. Remember: karma is planting seeds, not instant results",
      "Repeal expectations before meditation: 'I'm in samsara. I have delusions. My butt is getting kicked. Oh, I'm just normal. Cool.'",
      "Don't turn anger on yourself when you get deluded — be patient with your samsaric mind"
    ],
    "quote": "If that's good enough for Shantideva, it's good enough for me. I need to be like a merit hog for a couple weeks."
  },
  "commentary": [
    {
      "title": "Repeal Expectations Before You Begin",
      "content": [
        "Before any meditation, remember: I'm in samsara, bound by chains of karma, in the pitch black darkness of ignorance, getting chucked down the rivers of birth, aging, sickness and death.",
        "My mind is enmeshed in delusions. Sometimes it's going to be an absolute train wreck mess. That's not a problem if we don't expect it to be otherwise.",
        "If we expect our samsaric minds to be perfect and always good at meditating, we're going to be miserable. Take the pressure off."
      ],
      "quote": "I'm in samsara. My butt's getting kicked by a lot of delusions. Oh, I'm just normal. Cool."
    },
    {
      "title": "Don't Turn the Anger Inward",
      "content": [
        "One student noticed she'd get annoyed at a situation, then get annoyed at herself for getting annoyed. Double delusion!",
        "As long as we're samsaric beings, we're going to keep getting deluded. We can't be in samsara AND not be deluded — those are contradictory states.",
        "We don't want to turn the anger on the self we normally see. Just recognize: as long as I stay ordinary, this cycle continues. Be patient with yourself."
      ]
    },
    {
      "title": "This Is People Doing Their Best",
      "content": [
        "When someone controlled by delusions behaves badly, remember: this is this person doing their best in samsara.",
        "If they could have done better, they would have. They don't know another way. It's not fun for them either.",
        "This person is a spiritual teacher for me, really showing me samsara's face. That's kind — I needed someone to show me eventually, because I keep thinking it's going to work out."
      ],
      "quote": "This is this person doing their best."
    },
    {
      "title": "The Fine China Problem",
      "content": [
        "If we relate to seated practice as 'fine china' — something we wait for the right moment to use, very formal, a bit uncomfortable — it gets weird.",
        "It can become an attachment: 'I need that time. If I don't have that time, what I'm doing isn't okay.' That's an unhealthy cycle.",
        "When you hit your six sessions, think: Fantastic, I did my job for today. One teacher said in less than a minute, you can tap into something very precious."
      ],
      "quote": "If you do the six sessions, just let it be that for the day. You did your job."
    },
    {
      "title": "The Precious Human Life Jackpot",
      "content": [
        "Each condition that makes up a precious human life is like a board in an ocean. We need many boards to make a raft. In most past lives, we got a few boards but not all at once.",
        "Some past version of us did actions specifically with the intention to create a bodily vehicle for spiritual growth — free of the eight worldly concerns. That's incredibly rare.",
        "When we ponder this improbability, we feel: wow, I've hit the jackpot. I've got to make something of this shot."
      ]
    },
    {
      "title": "Yogis in Your Lineage",
      "content": [
        "In your karmic lineage, there are amazing, beautiful spiritual people. You don't know them, but they gave you these conditions.",
        "It's like ancestors who went through immigration hardships or the Depression so you could have this life. There's gratitude for those people.",
        "They were like: 'Maybe in this life I'm not going to make it spiritually, but I really hope future me does. I'm rooting for them.'"
      ],
      "quote": "There are serious practitioners in my mindstream. Or else this wouldn't have appeared the way it did."
    },
    {
      "title": "Enlightenment Is Simple",
      "content": [
        "Enlightenment is just moving the thought 'I' from a body and mind that suffers to a Buddha's body and mind. That's all it is.",
        "We were going around imputing 'I' on a suffering body and mind, trying to make that one happy. That's why it's complicated.",
        "Stop thinking of the ordinary body and mind as us. Start thinking of a Buddha's body and mind as us. When we do that and don't stop — that's enlightenment."
      ],
      "quote": "You're just identifying with a losing team of losers. You can just change what team you identify with."
    }
  ],
  "mtb": {
    "startParagraph": 58,
    "endParagraph": 105
  },
  "shantideva": {},
  "preview": {
    "startParagraph": 106,
    "endParagraph": 113
  }
}