{
  "id": "2025-11-02",
  "date": "Nov 2",
  "year": "2025",
  "topic": "Six-Session Foundations",
  "recording": "https://drive.google.com/file/d/1M1zkSADuLYCYyy7fFpWT2LsK2v4tN5Ev/view?usp=share_link",
  "practice": {
    "title": "Set Up Your Six-Session Practice",
    "steps": [
      "Identify your six times — based on your schedule (9-to-5, meal-oriented, every 3 hours, or variable by theme)",
      "Match sessions to pain points — the tough parts of your day (commute, afternoon slump, loneliness at night)",
      "Make a list of people most angry at you and practice being okay with that",
      "Pick one benefit of bodhicitta from MTB to contemplate, to 'tether us to the book'",
      "Plan for disruptions — anticipate schedule changes (vacations, family time) and create alternative anchors",
      "Give your sessions names — it makes them more fun and personal"
    ],
    "quote": "The six sessions are like pillars that hold up the palace of our mindfulness in the day."
  },
  "commentary": [
    {
      "title": "Break the 'One Daily Practice' Myth",
      "content": [
        "There's a wrong conception that meditation is about doing one formal practice and then riding that through the day. That's a made-up concept — nothing to do with Kadampa Buddhism.",
        "As Geshe-la says in Modern Buddhism, Kadampa Buddhism cannot be separated from daily life. We want our whole day to be a sadhana.",
        "The meditation break is more important than the meditation session, because it's longer. The six sessions support a meditation break practice that continues all day."
      ],
      "quote": "We have to break out of the concept of the one daily practice behemoth that we do, check off a box, and then go live our life."
    },
    {
      "title": "Pillars of Mindfulness",
      "content": [
        "It's difficult to have perfect mindfulness all day. So the six sessions become pillars that hold up the palace of our mindfulness.",
        "They're like outposts where we connect to a powerful, positive, virtuous feeling — even if just for 30 seconds or a minute. That feeling then slowly leaks out into the time in between.",
        "If you do this for a month in a way you really like — not rigid or rote — these cognitive structures will just be there. They'll start to function on their own, like an engine that runs itself."
      ],
      "quote": "These six sessions are like pillars that hold up the palace of our mindfulness in the day."
    },
    {
      "title": "Schedule Options",
      "content": [
        "The 9-to-5 version: Wake up, beginning of workday, beginning of afternoon, getting home, bedtime — plus one more.",
        "The meal-oriented version: Wake up, breakfast, lunch, dinner, bedtime, plus a seated practice somewhere.",
        "The every-3-hours version: Great for retirees or unstructured days. Those hours become sacred — you know exactly what you do at 12, at 3, at 6.",
        "The variable version: For those whose days are all different. Batch by themes — match sessions to pain points like commutes or difficult transitions."
      ]
    },
    {
      "title": "Six Mini-Days",
      "content": [
        "Think of each session as a mini-day. Ask: what do I need for my practice in this little three-hour day?",
        "For example, if you get irritable in the afternoon, what practices will oppose that? Maybe wishing love, or guarding speech, or something to make you lighter and less intense.",
        "The end of day is totally different — it's about reflecting on how the day went and getting ready for the yoga of sleep."
      ],
      "quote": "We actually start to see that each day we live many different days. There are lots of different energies in one day."
    },
    {
      "title": "The Middle Sessions Are Most Important",
      "content": [
        "For people with typical working lives, the mid-morning and mid-afternoon sessions are the most important of the whole day.",
        "You can start off strong, but if you don't get those middle two, you just slowly descend all day. Then at the end, you try to pick up from where you got to.",
        "It's a cool feeling to break through the habit of letting everything fall away and get tired and grumpy. This practice can snap us out of that."
      ],
      "quote": "Those middle sessions are like the bridge. They're the most important ones of the whole day."
    },
    {
      "title": "Breaking the Stillness Myth",
      "content": [
        "We'll break down the correlation between meditation and stillness, eyes closed, being physically still. Meditation is a mental action.",
        "The goal is to be in the mandala 24/7 — walking, talking, running, whatever. Our mind is in the Pure Land all the time.",
        "Study the Mahasiddhas — these great yogis were all working people, running around, doing tons of stuff. They are the exemplary practitioners of tantra."
      ],
      "quote": "If our private seated practice feels uniquely more holy than taking out the trash, we've actually created a delusion."
    },
    {
      "title": "The Repeater Analogy",
      "content": [
        "When sending a telecommunications signal across the country, you don't send one huge powerful signal and let it degrade. You send an average one and have it repeated, reinvigorated along the way.",
        "Our six sessions are like repeaters. They maintain where we're at spiritually throughout the day.",
        "One teacher said doing just bodhicitta for one minute, six times a day, was the deepest meditation he'd done in a decade — because he was really bringing it into daily life."
      ],
      "quote": "The successions become like repeaters that maintain where we're at."
    },
    {
      "title": "Give Them Names",
      "content": [
        "You can give your sessions names — it makes them more fun. Sun time, song time, wish time, tea time, wind time, moon time.",
        "One student named hers after aspects of Dorje Shugden: morning is the mongoose (spitting out jewels with coffee), danger zone midday is the dragon warrior guarding speech, subway home as a snow lion.",
        "Now you're like: 'Ooh, I'm in this part of the day. I love this one.'"
      ]
    }
  ],
  "mtb": {
    "title": "Foreword; The Pre-eminent Qualities of the Author",
    "content": [
      "The excellent expounder, the great Spiritual Master Kelsang Gyatso, studied myriad Buddhist scriptures at the famous Je College of the great monastic university of Sera, Tegchen Ling, practised the meaning of the teachings he received, and became a wise, serious and realized Teacher. From the rain of profound and extensive Dharma that he has bestowed upon his fortunate disciples, he has recently given comprehensive instruction on the great Bodhisattvacharyavatara (Guide to the Bodhisattva's Way of Life). This commentary has now been made available in English with the title Meaningful to Behold, known in Tibetan as 'tong pa don den'.",
      "This text is the heart essence of all the Sugatas of the three times and is the unsurpassed practice of the great Sons of the Conquerors. It explains clearly the mind of bodhichitta developed through equalizing and exchanging self with others -- the foundation of the Bodhisattva's way of life. It also explains the benefits of this Mahayana mind, the way we should guard this mind, and how we should practise the great waves of the six perfections once bodhichitta has been cultivated. As a great gathering of the paths of the Mahayana tradition, it is therefore worthy to receive many flowers of praise bestowed with appreciation.",
      "I pray and dedicate that all sentient beings may practise sincerely the meaning of the instructions explained in this text and may thereby accomplish effortlessly the purposes of both themselves and others. May they all swiftly reach the enlightened state of the four bodies [of a Buddha] by accomplishing all the stages of the spiritual grounds and paths.",
      "Vajradhara Trijang Rinpoche",
      "Acknowledgements",
      "The teachings contained in this book were originally delivered as a series of lectures to students at Manjushri Kadampa Meditation Centre in England, by Venerable Geshe Kelsang Gyatso Rinpoche. For more than three months, beginning in late 1977, Venerable Geshe Kelsang gave a verse by verse oral commentary to Shantideva's eighth-century masterpiece, Guide to the Bodhisattva's Way of Life, one of the most famous and important texts studied in Mahayana Buddhism.",
      "From the depths of our hearts, we thank the author for his inconceivable kindness in composing this book. Throughout the presentation and revision of these teachings, Venerable Geshe Kelsang has demonstrated by his compassion, wisdom and inexhaustible patience that the Bodhisattva path to enlightenment is still being followed 1,200 years after Shantideva and 2,500 years after the passing away of Buddha Shakyamuni. There can be no greater proof of the immense value of the Bodhisattva's way of life than the living example of such a realized Master.",
      "We also thank all the dedicated, senior Dharma students who assisted the author with the rendering of the English and who prepared the final manuscript for publication.",
      "Please note that numbers in squared brackets throughout the text refer to verse numbers in Shantideva's root text, Guide to the Bodhisattva's Way of Life, a full translation of which is available separately. See Bibliography.",
      "Roy Tyson,",
      "Administrative Director",
      "Manjushri Kadampa Meditation Centre,",
      "November 1993.",
      "Buddha Shakyamuni",
      "Introduction",
      "This present text is a commentary to Shantideva's Guide to the Bodhisattva's Way of Life (Skt. Bodhisattvacharyavatara) and is divided into three parts:",
      "1\tThe pre-eminent qualities of the author",
      "2\tAn introduction to the text",
      "3\tThe explanation of the actual text",
      "THE PRE-EMINENT QUALITIES OF THE AUTHOR",
      "It is customary at the beginning of commentaries such as this to give a biography of the author, in this case the great Indian Pandit Shantideva (687-763 CE). There now follows a very brief account drawn from traditional sources.",
      "Shantideva was born the crown prince of a royal family in Gujarat, a kingdom in western India. His father was King Kushalavarmana (Armour of Virtue) and his mother was recognized as an emanation of the Tantric Deity Vajrayogini. At his birth the prince received the name Shantivarmana (Armour of Peace).",
      "Even as a very young boy Shantivarmana showed great ability in spiritual matters and by the age of seven was already highly skilled in the inner science of religion. His principal Teacher at that time was a Yogi who had so fully developed penetrating wisdom that it is said he achieved unity with Manjushri, the Buddha embodying the wisdom of all enlightened beings. When Shantivarmana himself engaged in a meditation retreat, he too received a direct vision of Manjushri and many prophetic omens as well.",
      "Shortly afterwards King Kushalavarmana died, leaving Shantivarmana to inherit the throne. The night before his intended coronation, however, Manjushri appeared to him in a dream. He told the prince that he should renounce his kingdom and become a celibate monk. Immediately upon waking, Shantivarmana fled the palace and disappeared into the forest to meditate. Once again he received a vision of Manjushri, who handed him a symbolic wooden sword. Upon taking it Shantivarmana attained eight perfect realizations. He then travelled to the great monastic university of Nalanda where he took ordination from the Abbot Jayadeva (God of Victory) and was given the ordination name of Shantideva (God of Peace).",
      "At Nalanda Shantideva's spiritual development progressed rapidly, especially as the result of his training in the profound and demanding methods of Tantra. However, because he did all his practices secretly at night and rested during the day, it appeared to others that he performed only three activities: eating, sleeping and defecating. For this reason, the other monks sarcastically referred to him as the 'Three Realizations'. Feeling he was a very irresponsible monk and a discredit to their illustrious university, they devised a plan to get rid of him. Incorrectly believing him to be deficient in meditational ability and ignorant of doctrinal theory, they arranged for Shantideva to deliver a discourse before the entire monastery. Their idea was that he would be so humiliated by this exposure of his ignorance that he would be shamed into leaving.",
      "When the day of the scheduled public humiliation arrived, Shantideva mounted the teaching throne and, much to the amazement of those assembled, delivered a discourse which, when written down, became known as Guide to the Bodhisattva's Way of Life, still considered the best set of instructions ever written for becoming a Bodhisattva -- a being bound for full enlightenment. As he was expounding the ninth chapter dealing with the wisdom apprehending the true nature of reality he uttered the words, 'Everything is like space.' At this point he began to rise into the sky, flying higher and higher until he could no longer be seen although his voice could still be clearly heard. It was in this miraculous manner that the remainder of the ninth chapter and the entirety of the tenth were delivered.",
      "Having no desire to return to Nalanda, Shantideva left for South India. Needless to say, the monks he left behind were profoundly impressed and somewhat bewildered by Shantideva's teachings and his display of miracle powers. Shortly thereafter a dispute arose about these teachings. The Kashmiri Pandits claimed that Shantideva taught only nine chapters, while some of the scholars from Magadha, who possessed great powers of memorization, argued that he had in fact taught ten. It was decided that the only way to resolve this disagreement would be to hear the teachings once again, so several monks left Nalanda in search of the one they had once despised and requested him to repeat his discourse. This he did, and he also gave them the text of his Compendium of Trainings (Skt. Shikshasamuchchaya), which also explains the practices of a Bodhisattva. From that time onwards the study and practice of Shantideva's works flourished widely throughout India and other Mahayana Buddhist lands.",
      "As Shantideva's fame spread farther and farther, many non-Buddhists became jealous. One of their greatest teachers, Shankadeva, challenged Shantideva to a debate on the condition that the loser forsake his own doctrine for that of the winner. By the use of miracle powers and impeccable logic, Shantideva emerged victorious, thereby bringing Shankadeva and all of his disciples into the Buddhist fold.",
      "On another occasion, when there was great famine in South India, Shantideva announced that he would perform an act of generosity. The next day many people gathered to see what he would do. Shantideva then proceeded to satisfy the hunger of the entire mass of people with a single bowl of rice! Because of this the local people all developed great faith in Shantideva and adopted the Buddhist way of life as their own.",
      "This has been only a brief biography of the great Bodhisattva Shantideva, who throughout his entire life performed countless deeds for the sake of spreading Buddha's teachings, the Dharma, and helping sentient beings. Even today those who are fortunate enough to read, study and meditate on his outstanding texts can find them a source of great insight and benefit.",
      "AN INTRODUCTION TO THE TEXT"
    ]
  },
  "shantideva": {},
  "preview": {
    "startParagraph": 15,
    "endParagraph": 57
  }
}