{
  "id": "2025-12-07",
  "date": "Dec 7",
  "year": "2025",
  "topic": "Intention & Karma",
  "recording": "https://drive.google.com/file/d/17Urnv-qko31RpKz8UCMtdIW8snHrYEj8/view?usp=share_link",
  "practice": {
    "title": "Set Bodhicitta Intention and Relax",
    "steps": [
      "Set a bodhicitta intention, then relax — the relaxing part is what makes the practice really work",
      "Beseech your spiritual guide to help you break through your particular bedrock: 'Help me jackhammer through this!'",
      "Evaluate your trust in karma — look at situations and notice your faith",
      "When you pray for someone, delight in your virtuous action and ignore whether 'the things you normally see' look better. Believe your prayer came true.",
      "Laugh at your delusions — it's like poking a bully in the eye. They lose all power."
    ],
    "quote": "Set a bodhicitta intention and relax. That relaxing part actually makes the practice really work."
  },
  "commentary": [
    {
      "title": "Laugh at Your Delusions",
      "content": [
        "When you laugh at your delusions, it's like poking a schoolyard bully in the eye. They come up looking tough, you poke them right in the eyeball, and they cry and run away.",
        "Their power is in your fear. Once you stop being afraid, they have no power. They have no arms and legs and courage or skill.",
        "We're not laughing at ourselves — we're laughing at the delusions. When we do that, they completely get disempowered."
      ],
      "quote": "Ha ha ha ha ha, you dumb little self-cherishing."
    },
    {
      "title": "Don't Take Delusions Seriously",
      "content": [
        "When we catch ourselves in a delusion, it's very easy to start taking it super seriously. That's often our self-cherishing — another delusion!",
        "Now we have two delusions: the initial one (anger, attachment) plus self-cherishing of taking ourselves so seriously, thinking how bad we are.",
        "If we just get at it right away and laugh at its ridiculousness, it loses its grip over us immediately."
      ]
    },
    {
      "title": "Ignore the Things You Normally See",
      "content": [
        "When praying for people, we often evaluate 'the things we normally see' as evidence of whether it's working. If they still seem to suffer, we get discouraged.",
        "Geshe-la said: when he makes prayers and dedications, trying to envision them as true, even if things don't look that way, 'I ignore the things I normally see. I believe they have come true.'",
        "We can hold the beneficial belief that our prayer came true, and our mind is still just hallucinating the things we normally see."
      ],
      "quote": "I ignore the things I normally see. I believe they have come true."
    },
    {
      "title": "Your Relationship with Your Guru Is Personal",
      "content": [
        "Our relationship with our spiritual guide is completely personal and intimate. It's dynamic. It's no one else's relationship.",
        "It goes back many lives and will continue into future lives. Every other relationship basically disappears when we die.",
        "If something's not working, have a chat. 'Hey, can you help guide me? Your job is to guide me. What's my next step? Help me here, please.'"
      ],
      "quote": "Our spiritual life is our choice. The way we approach it is our choice."
    },
    {
      "title": "Relax After Setting Intention",
      "content": [
        "When setting a bodhicitta intention, the relaxing part is really important — it's a sign that we're actually setting an intention.",
        "If we really are setting that intention, we just relax, because it's enough. Sometimes: step one, generate the intention. Step two, now I relax.",
        "It's a lovely mindfulness practice to do throughout the day."
      ]
    },
    {
      "title": "Princess of the Buddhas",
      "content": [
        "Anyone who develops bodhicitta becomes a son or daughter of the Buddhas — an object worthy to be venerated by worldly gods and all humanity.",
        "It doesn't matter if you're a poor, shabbily dressed beggar. Upon generating the mind of enlightenment, you become worthy of the highest veneration.",
        "There's nothing in Buddhism that has any preference for gender, nationality, etc. We're not our body. We've been millions of bodies — male, female, cockroaches, shrimp, formless gods."
      ],
      "quote": "It's very nice to be the princess of the Buddhas."
    },
    {
      "title": "Beware Cultural Infiltration",
      "content": [
        "It's easy for cultural norms to infiltrate the Dharma. People can think something cultural is actually part of the Dharma.",
        "We have to be careful: often we feel a cultural norm IS the truth, when it's just a norm that fits for right now.",
        "Appreciate Geshe-la for clearly making Gen-la Dekyong the head of our tradition — that's not normal in many Buddhist traditions. He didn't have limited ways of thinking."
      ]
    }
  ],
  "mtb": {
    "startParagraph": 114,
    "endParagraph": 136
  },
  "shantideva": {
    "chapter": 1,
    "startVerse": 1,
    "endVerse": 14
  },
  "preview": {
    "startParagraph": 137,
    "endParagraph": 147
  }
}