{
  "id": "2025-12-14",
  "date": "Dec 14",
  "year": "2025",
  "topic": "Year-End Reflection",
  "recording": "https://drive.google.com/file/d/1V8ivOuqnPga3Ixs0RfeJXOi8v-VIBPbc/view?usp=sharing",
  "practice": {
    "title": "Diagnose Your Practice Phase",
    "steps": [
      "Use the airplane analogy to diagnose where you are: Reading the handbook? Taking off? Soaring? Losing steam? Free-falling? Crash-landed? Purposefully landing?",
      "Identify YOUR specific obstacles to bodhicitta — go through faith issues, effort issues, distraction issues, renunciation issues",
      "Work on distraction through spiritual guide reliance — when distracted, the only escape seems like more distraction. Break the cycle.",
      "Practice 'boatman-like' bodhicitta — going to enlightenment together with all beings, not shepherd-like (leading them there first)",
      "Practice in low-stakes situations — wholeheartedly accept the red light, the cold, the unshoveled sidewalk. Build a reservoir of peace."
    ],
    "quote": "If we're not doing it, there's an obstacle — or two, or ten. We want to figure out what these are for us."
  },
  "commentary": [
    {
      "title": "Set Intention and Be Peaceful (Not Passive)",
      "content": [
        "When we say 'set bodhicitta intention and relax,' relaxed doesn't mean passive or low-energy. It means deeply peaceful.",
        "You can be totally vigilant AND totally peaceful. You can be totally engaged and energetic AND totally peaceful.",
        "Can you envision a relaxed vigilance? A relaxed activity? Maybe 'peaceful' is a better word than 'relaxed.'"
      ],
      "quote": "That relaxing part is what makes the practice really work."
    },
    {
      "title": "Inputs vs. Outputs",
      "content": [
        "Unpeacefulness about any output is always attachment. We have to label that over and over.",
        "There's a way to do our best, not get a certain output, but feel deeply peaceful. But first we must identify worry as attachment.",
        "When you set your intention and focus on the input (your action), let go of evaluating the output."
      ]
    },
    {
      "title": "Practice in Low-Stakes Situations",
      "content": [
        "We often pull out Dharma tools in the fires of our day, but go on autopilot in the easier moments — walking down the street, shopping, hanging out with friends.",
        "It's often the opposite that works better: practice in times of relative calm. That's where we get a feeling for the tools and build up a reservoir of peace.",
        "Walking to the Dharma Center — were you wholeheartedly accepting the way things are? Or was there 'ugh, it's cold' or 'why is the light red'? Those are moments of non-acceptance."
      ],
      "quote": "If we're not even doing it in the easy moments, that's actually our level of practice right now. And that's not small — it's big."
    },
    {
      "title": "Everything as a Test",
      "content": [
        "See everything that happens as a test from your spiritual guide. 'Maybe this is one of those tests.' All of a sudden, it's no problem at all.",
        "It becomes a little game: how much can I accept this situation? There's a purification that happens when you accept something you wouldn't have previously accepted.",
        "It's like putting out little fires in your mind. It feels really nice."
      ]
    },
    {
      "title": "Obstacles to Bodhicitta: Faith",
      "content": [
        "Start with faith issues: Do I really believe in bodhicitta? Do I admire it the same way I admire other realizations? Is there a powerful desire to cultivate it?",
        "Without believing faith, we think 'Yeah, good idea' but don't really wish for it strongly.",
        "Go through the three types of faith: believing, admiring, wishing. Which is missing?"
      ]
    },
    {
      "title": "Obstacles to Bodhicitta: Effort (The Four Laziness)",
      "content": [
        "Laziness of discouragement: We don't feel we could change, or something is too high for us, or things haven't been going well.",
        "Laziness of procrastination: 'I'll do it later. I've got more important things to do right now. I've got to make cash.'",
        "Laziness of being attached to what's meaningless: 'I just like other stuff more than bodhicitta. I like TV more.'",
        "Laziness of indolence: Being attached to immobility, sleep, inactivity."
      ],
      "quote": "Ugh, I've got to generate bodhicitta. Ugh, it's getting in the way of all the fun things I'm doing as I lock myself into my little prison cell for millions more lives."
    },
    {
      "title": "The Distraction Trap",
      "content": [
        "Distraction makes all Dharma uninteresting. Our mind can't absorb long enough to taste the magic.",
        "In a distracted mindset, our mind becomes so agitated that the only escape seems like MORE distraction. It's self-reinforcing.",
        "We keep upping the dose until catastrophe. There's only one way that goes — down hard."
      ],
      "quote": "Sitting down to meditate is hanging out with a madman — just rapid, deluded thoughts. It's painful. So we escape into more distraction."
    },
    {
      "title": "Gold or Bodhicitta?",
      "content": [
        "If someone looked at the download of your thoughts for the day, would they say you're more interested in gold or bodhicitta?",
        "Tally up: How many thoughts were scheming to grow bodhicitta? How many were scheming to grow one of the eight worldly concerns?",
        "While gold is easily obtained, no amount of money can buy bodhicitta. The only way to obtain it is to develop it yourself through long meditation."
      ]
    }
  ],
  "mtb": {
    "startParagraph": 137,
    "endParagraph": 147
  },
  "shantideva": {
    "chapter": 1,
    "startVerse": 15,
    "endVerse": 25
  },
  "preview": {
    "startParagraph": 148,
    "endParagraph": 169
  }
}