{
  "id": "2026-01-11",
  "date": "Jan 11",
  "year": "2026",
  "topic": "Traveler Practice",
  "recording": "https://drive.google.com/file/d/13kp6l_jb7QP_wEM2yuDscSXp_byQtuVp/view?usp=share_link",
  "practice": {
    "title": "I Am Like a Traveler",
    "steps": [
      "Meditate: 'I am like a traveler bound for future lives' — take a long-term view of your very subtle mind going endlessly into the future",
      "Watch how people switch categories: enemy to friend to stranger. If they can appear as all three, they're completely empty.",
      "Notice that restraint counts: Not gossiping, not snapping back — these are virtuous actions too. Celebrate them!",
      "Student practice: Use an 'enemy spreadsheet' — list people you have aversion toward, write 3 good things about each.",
      "Student practice: Track your mind with tokens — count 'meat' thoughts (this life only) vs 'heart' thoughts (future lives)."
    ],
    "quote": "We cast the characters, and then we get mad at the characters we cast."
  },
  "commentary": [
    {
      "title": "Casting Characters",
      "content": [
        "We cast the characters, and then we get mad at the characters we cast. It's incredibly freeing to see this.",
        "My mind created this image of an unpleasant person by paying attention to certain things and ignoring others. Now I'm marching around yelling at this person I created.",
        "Samsara can make us laugh or cry. Laughing at the absurdity, or crying at the horror. These situations are both."
      ],
      "quote": "I need to start reverse engineering some of these parts that I've cast."
    },
    {
      "title": "Seeing Categories Switch — Therefore Empty",
      "content": [
        "If they can appear as enemy, friend, and stranger to you — they're completely empty. If they were inherently any of those, they couldn't appear as the others.",
        "Everyone knows 'it's perspective.' But 'therefore it's empty' is the unusual insight. That's the breakthrough people don't get.",
        "Since they're empty, we might as well discriminate them in a more useful way — like as our mother, or as a Buddha."
      ]
    },
    {
      "title": "Moral Discipline of Restraint",
      "content": [
        "If you hold back from an action due to a spiritual view, that's a virtuous action. Notice these and rejoice in them!",
        "We didn't need to restrain ourselves. There were times in our life when we didn't. So really celebrate when we do.",
        "It only counts if we restrain due to a spiritual view — not wanting to create negative karma, wanting to cherish this person, etc."
      ],
      "quote": "Stopping negativity is a positive action."
    },
    {
      "title": "Beneficial Believing vs. Relativism",
      "content": [
        "Everything is empty, but things have a relative degree of validity. We figure out what to do based on the effect on our mind.",
        "Buddhism is NOT relativist ('we're all right, just different views') — that leads to nihilism, which leads to depression or hedonism.",
        "There are correct ways of thinking and wrong ways of thinking. It has to do with the function — does it reduce delusions and increase happiness?"
      ],
      "quote": "Regarding everyone as mother is true and verifiable, and provides immediate experience of happiness and well-being."
    },
    {
      "title": "The Levels of Affectionate Love",
      "content": [
        "Affectionate love has many levels — it's not monolithic. It's a category for a warm, close feeling that grows deeper as we go.",
        "Basic equanimity gives the lowest grade affectionate love. Viewing people as mother is higher. Viewing all beings as supreme goes even further.",
        "When we view someone as necessary for our spiritual development, we feel really warm toward them — 'I need you for my spiritual life.'"
      ]
    },
    {
      "title": "Student Share: The Enemy Spreadsheet",
      "content": [
        "One student made a Google spreadsheet listing everyone they had any aversion toward — not just anger, but avoidance mind.",
        "For each person, write 3 good things about them. Sometimes it's hard: 'They drink water.' But feel it and mean it.",
        "It took about 30 minutes but felt like a decade of spiritual work."
      ]
    },
    {
      "title": "Student Share: Steak and Heart Tracking",
      "content": [
        "A student tracked her mind with little steaks (concerned with present meat body) and hearts (working toward future lives).",
        "The samsaric thoughts are like a million little ones. But the thoughts about future lives are usually big and powerful.",
        "Surprising finding: many 'hearts' came from restraint — not saying the gossip, letting the grumpy person go."
      ]
    }
  ],
  "mtb": {
    "startParagraph": 170,
    "endParagraph": 183
  },
  "shantideva": {
    "chapter": 1,
    "startVerse": 15,
    "endVerse": 25
  },
  "preview": {
    "startParagraph": 184,
    "endParagraph": 188
  }
}