{
  "id": "2026-01-18",
  "date": "Jan 18",
  "year": "2026",
  "topic": "Love in Action",
  "recording": "https://drive.google.com/file/d/1V_CCJv-rDCeXv23wLurq2loXiVMlzMkq/view?usp=share_link",
  "practice": {
    "title": "Do Everything with Love",
    "steps": [
      "Make decisions from a mind of love — stop trying to figure things out from self-grasping. Let love make the decision.",
      "Do all actions with love, or don't do them at all (Kadam Morten quote)",
      "Identify your 'target' — overthinking? Laziness? Anxiety-driven motivation? Taking yourself too seriously? Let love solve it.",
      "Look at what contaminated motive originally drew you to Dharma — wanting to feel special? Escapism? Loneliness? Gently examine it.",
      "Radically non-identify with your patterns — they're storms blowing through, not who you are"
    ],
    "quote": "What would it be like to 100% stop trying to figure out what's going on, and instead put all energy into getting a mind of love going — and then let that make the decision?"
  },
  "commentary": [
    {
      "title": "Being Guided by Love",
      "content": [
        "How often do we make a decision with an overt, intense love guiding us? Not just verbally ('may this benefit others') but really letting love compel us to action.",
        "It's like being possessed by something forcing you to act. Like seeing a toddler fall and you just can't help but run to help — something is guiding you, not intellectual, almost compelled.",
        "This is what changing our intention really means. Not verbalizing a good intention, but having something overt and powerful compelling us into action."
      ],
      "quote": "It's almost a sense that you're being possessed by something that's forcing you to do something."
    },
    {
      "title": "Love Solves Your Problems",
      "content": [
        "If you're an overthinker: Love makes the decision, you act wholeheartedly. The only reason we overthink is we're mired in a bog of delusions with awful options.",
        "If you're lazy and can't motivate yourself: Love provides almost limitless energy from a non-contaminated source.",
        "If you're anxiety-motivated (driven but by crippling anxiety): Love gives you drive without the contamination.",
        "If you take yourself too seriously: Love makes you light as a fairy — no egocentric mind weighing you down."
      ]
    },
    {
      "title": "The Arch Enemy Hug",
      "content": [
        "One student had a neighbor who said 'I have enough friends' 30 years ago. She hated her for decades.",
        "Recently, seeing her alone and struggling, she spontaneously hugged her. 'That was Buddha coming out in me.'",
        "Every time this happens, we prove to ourselves: I can shift how I view anyone. This arch enemy became someone I tenderly hugged."
      ],
      "quote": "I felt that was Buddha working through me."
    },
    {
      "title": "What Contaminated Motive Drew You to Dharma?",
      "content": [
        "Our mind is pervaded by delusions, so we don't get into Dharma for completely pure reasons. There are often other motives.",
        "Examples: wanting to feel special, escapism from pain you couldn't accept, loneliness seeking companionship, needing to control anxiety.",
        "Look at your practice: where does this motive show up? How much does it contaminate your practice? Use love to oppose it."
      ],
      "quote": "For me, it took a long time to realize: there's this contaminated motive to want to feel special. I've had it since I was a little kid."
    },
    {
      "title": "Radically Non-Identify with Patterns",
      "content": [
        "Modern psychology might say these drives are your psychological DNA, just who you are. Buddhism says: not true at all. It's just a karmic pattern, a storm blowing through.",
        "If we identify with these patterns, the whole thing feels awful — discovering this wretched, inalienable part of us. That's damaging.",
        "See them like weather patterns: you can be aware of them without identifying with them. Then you can respond and work with them without being afraid."
      ],
      "quote": "You don't identify with the storms in the sky, but you can be aware of a weather pattern."
    },
    {
      "title": "Who's Actually Running the Show?",
      "content": [
        "When we work with our mind, we learn the tools. But who's actually running the show of working with our mind? Often it's self-cherishing.",
        "Example: 'I'll use Dharma to not be hard on myself so I can cherish myself more.' That's self-protection, which is self-cherishing.",
        "When truly guided by love, we won't be hard on ourselves because there's almost no self appearing to even cherish. Love forgets the self."
      ]
    },
    {
      "title": "Student Share: The Traveler Mindset with Bodhicitta",
      "content": [
        "One student reflected on the 'traveler' mindset: Previously she used impermanence to dismiss things — 'don't get upset, you're just passing through.'",
        "But with bodhicitta applied, everything matters. It's not that things don't matter — it's that we need to learn how to use each moment.",
        "Without the mind of bodhicitta, even if we call ourselves Mahayana Buddhists, we're not really on the Mahayana path."
      ]
    }
  ],
  "mtb": {
    "startParagraph": 184,
    "endParagraph": 188
  },
  "shantideva": {
    "chapter": 1,
    "startVerse": 15,
    "endVerse": 25
  },
  "preview": {
    "startParagraph": 189,
    "endParagraph": 217
  }
}