{
  "id": "2026-01-04",
  "date": "Jan 4",
  "year": "2026",
  "topic": "Equanimity",
  "recording": "https://drive.google.com/file/d/1tSrG4vHOCdzcOK-pvOwiwy_szGVPzs8T/view?usp=share_link",
  "practice": {
    "title": "Practice Equanimity",
    "steps": [
      "View people as avatars — behind every person is an infinite history, countless lives, unlimited potential. We have no idea what we're actually looking at.",
      "Make a list of people you view as 'enemies' and write three good things about each one, to grow your love for them.",
      "Play with what it's like to reduce self-interest, or even have zero self-interest — like making a beautiful cozy bed knowing you'll sleep in the street.",
      "Focus on people's very subtle mind (their Buddha nature) rather than their physical appearance — it makes everyone feel more equal.",
      "When grumbling about someone, throw away their body mentally and try to get mad at just their very subtle mind floating about. It's hard to stay angry."
    ],
    "quote": "Let's work on our equanimity in some of these different myriad ways."
  },
  "commentary": [
    {
      "title": "The Avatar Perspective",
      "content": [
        "When we look at someone, we're just seeing their 'avatar' — a tiny projection. Behind every person is an infinite history, countless lives, and unlimited potential. We have no idea what we're actually looking at.",
        "The possibilities are endless — you don't know what's going to come out of that person. Just be open to anything."
      ],
      "quote": "There's so much more, a whole universal, infinite number of beings behind what we're looking at."
    },
    {
      "title": "Our Biases Run Deep",
      "content": [
        "Most people, unless they've trained in perfect equanimity, have biases. We prefer certain kinds of people over others, even based on superficial things we're not proud of.",
        "Even as you walk down the street, notice: who do we like? Who do we not like? Who do we not care about? We're instantaneously preferring people and projecting prejudices onto people we know nothing about.",
        "What are the dividing lines your mind makes? Gender? Ethnicity? Class? Nationality? Religion? Behavior? Hobbies? We want to look at these because we're trying to become a Bodhisattva — a friend of the world."
      ],
      "quote": "It's like looking at the beautiful blue sky. You don't think that part of the blue sky is better than this part. You feel equal towards each. That's what we want to get to."
    },
    {
      "title": "Focus on the Very Subtle Mind",
      "content": [
        "One of the simplest things to help with equanimity: focus on people's very subtle mind — their root mind, their Buddha nature. That's people's real mind.",
        "When we get stuck in physicality, people seem quite different. But if we move past the physical — which is just a sheath, completely ephemeral, actually not related to that person at all — everyone starts to feel more equal.",
        "As Geshe-la says, if all our past bodies were piled together, they'd be greater than Mount Meru. The body has nothing to do with who that person really is."
      ],
      "quote": "Sometimes you can close your eyes, throw the body away, and try to get mad at their very subtle mind. Just a little mind floating about. It's hard to get mad at a mind."
    },
    {
      "title": "The Pointlessness of 'Enemy'",
      "content": [
        "The label 'enemy' only functions to disturb our mind. It's a completely purposeless label. The only enemies are delusions — no people are enemies.",
        "Often we call someone an enemy because we get something out of it — but it's something maladaptive. For example, a distraction from our own pain. It's much easier to blame others than to look at what's going on in our own mind.",
        "That's why people love obsessing over the news and how much they hate this person or that group. It's an incredibly effective way to escape from your own pain."
      ],
      "quote": "What am I getting out of calling someone an enemy? Whatever reason is going on there is completely maladaptive and unhealthy and only functions to harm us."
    },
    {
      "title": "You're Mad at Your Own Image",
      "content": [
        "When we think about someone we don't like, we're engaging with a generic image — a mental projection. The person isn't actually in our mind.",
        "It's like a 2D version, often a complete exaggeration. Maybe it's from 20 years ago — that person is gone. We're sitting there getting mad at our own image of the person.",
        "Since we're just getting mad at an image, why not create a different mental image? This isn't even the person themselves."
      ],
      "quote": "Often it's just propaganda — a completely warped view created in our mind."
    },
    {
      "title": "Condition-Dependent Views",
      "content": [
        "Ask yourself: would a single kind word from this 'enemy' change how I see them? If so, the category of 'enemy' is completely condition-dependent — it's not a stable truth.",
        "We want to develop views that are condition-independent — bedrocks of truth that can withstand any circumstance. Dharma views are designed to be like this.",
        "One of the beautiful things about Dharma: it becomes MORE true the worse things get. It's built on axioms like impermanence, inner peace being the real source of happiness, delusions always leading to suffering."
      ],
      "quote": "A lot of positive thinking falls apart when life falls apart. But the more life falls apart, the more Dharma becomes true."
    },
    {
      "title": "The Grocery Store Thought Experiment",
      "content": [
        "Imagine living the same few hours in a grocery store thousands of times, like Groundhog Day. At some point, you'd start talking to everyone. You'd discover something beautiful about each person.",
        "Inside each person there's a whole incredible never-ending universe. It's very strange that we just walk around in our little siloed universes.",
        "If we lived that grocery store day 5,000 times, we would become best friends with every person there. We'd learn something about them that we would admire."
      ],
      "quote": "Inside each person there's so much to be discovered. These views — 'you're this, you're that' — they're just short-sighted, superficial categories that come from not really knowing someone's heart."
    },
    {
      "title": "Love vs. Attachment: Where Does the Good Feeling Come From?",
      "content": [
        "Both love and attachment can produce a good feeling. You can't tell which is which by how someone 'makes you feel.'",
        "The simplest distinction: Love is 'I want you to be happy.' Attachment is 'I want you to make me happy.'",
        "If the good feeling comes from thinking 'I want you to be happy,' that's love. If it comes from thinking 'you are making me happy,' that's attachment."
      ],
      "quote": "Is the good feeling coming from within or from without? That's often the simplest way to think about it."
    }
  ],
  "mtb": {
    "startParagraph": 148,
    "endParagraph": 169
  },
  "shantideva": {
    "chapter": 1,
    "startVerse": 15,
    "endVerse": 25
  },
  "preview": {
    "startParagraph": 170,
    "endParagraph": 183
  }
}