{
  "classId": "nov30",
  "date": "November 30, 2025",
  "session1": {
    "chantedPrayers": {
      "time": "0:27",
      "text": "LIBERATING PRAYER\n\nO Blessed One, Shakyamuni Buddha,\nPrecious treasury of compassion,\nBestower of supreme inner peace,\nYou, who love all beings without exception,\nAre the source of happiness and goodness;\nAnd you guide us to the liberating path.\n\nYour body is a wishfulfilling jewel,\nYour speech is supreme, purifying nectar,\nAnd your mind is refuge for all living beings.\n\nWith folded hands I turn to you,\nSupreme unchanging friend,\nI request from the depths of my heart:\n\nPlease give me the light of your wisdom\nTo dispel the darkness of my mind\nAnd to heal my mental continuum.\n\nPlease nourish me with your goodness,\nThat I in turn may nourish all beings\nWith an unceasing banquet of delight.\n\nThrough your compassionate intention,\nYour blessings and virtuous deeds,\nAnd my strong wish to rely upon you,\nMay all suffering quickly cease\nAnd all happiness and joy be fulfilled;\nAnd may holy Dharma flourish for evermore.\n\nGOING FOR REFUGE\n\nI and all sentient beings, until we achieve enlightenment,\nGo for refuge to Buddha, Dharma and Sangha. (3x)\n\nGENERATING BODHICHITTA\n\nThrough the virtues I collect by giving and other perfections,\nMay I become a Buddha for the benefit of all. (3x)\n\nGENERATING THE FOUR IMMEASURABLES\n\nMay everyone be happy,\nMay everyone be free from misery,\nMay no one ever be separated from their happiness,\nMay everyone have equanimity, free from hatred and attachment.\n\nVISUALIZING THE FIELD FOR ACCUMULATING MERIT\n\nIn the space before me is the living Buddha Shakyamuni surrounded by all the Buddhas and Bodhisattvas, like the full moon surrounded by stars.\n\nPRAYER OF SEVEN LIMBS\n\nWith my body, speech and mind, humbly I prostrate,\nAnd make offerings both set out and imagined.\nI confess my wrong deeds from all time,\nAnd rejoice in the virtues of all.\nPlease stay until samsara ceases,\nAnd turn the Wheel of Dharma for us.\nI dedicate all virtues to great enlightenment.\n\nOFFERING THE MANDALA\n\nThe ground sprinkled with perfume and spread with flowers,\nThe Great Mountain, four lands, sun and moon,\nSeen as a Buddha Land and offered thus,\nMay all beings enjoy such Pure Lands.\n\nI offer without any sense of loss\nThe objects that give rise to my attachment, hatred and confusion,\nMy friends, enemies and strangers, our bodies and enjoyments;\nPlease accept these and bless me to be released directly from the three poisons.\n\nIDAM GURU RATNA MANDALAKAM NIRYATAYAMI\n\nPRAYER OF THE STAGES OF THE PATH\n\nThe path begins with strong reliance\nOn my kind Teacher, source of all good;\nO Bless me with this understanding\nTo follow him with great devotion.\n\nThis human life with all its freedoms,\nExtremely rare, with so much meaning;\nO Bless me with this understanding\nAll day and night to seize its essence.\n\nMy body, like a water bubble,\nDecays and dies so very quickly;\nAfter death come results of karma,\nJust like the shadow of a body.\n\nWith this firm knowledge and remembrance\nBless me to be extremely cautious,\nAlways avoiding harmful actions\nAnd gathering abundant virtue.\n\nSamsara's pleasures are deceptive,\nGive no contentment, only torment;\nSo please bless me to strive sincerely\nTo gain the bliss of perfect freedom.\n\nO Bless me so that from this pure thought\nCome mindfulness and greatest caution,\nTo keep as my essential practice\nThe doctrine's root, the Pratimoksha.\n\nJust like myself all my kind mothers\nAre drowning in samsara's ocean;\nO So that I may soon release them,\nBless me to train in bodhichitta.\n\nBut I cannot become a Buddha\nBy this alone without three ethics;\nSo bless me with the strength to practice\nThe Bodhisattva's ordination.\n\nBy pacifying my distractions\nAnd analyzing perfect meanings,\nBless me to quickly gain the union\nOf special insight and quiescence.\n\nWhen I become a pure container\nThrough common paths, bless me to enter\nThe essence practice of good fortune,\nThe supreme vehicle, Vajrayana.\n\nThe two attainments both depend on\nMy sacred vows and my commitments;\nBless me to understand this clearly\nAnd keep them at the cost of my life.\n\nBy constant practice in four sessions,\nThe way explained by holy Teachers,\nO Bless me to gain both the stages,\nWhich are the essence of the Tantras.\n\nMay those who guide me on the good path,\nAnd my companions all have long lives;\nBless me to pacify completely\nAll obstacles, outer and inner.\n\nMay I always find perfect Teachers,\nAnd take delight in holy Dharma,\nAccomplish all grounds and paths swiftly,\nAnd gain the state of Vajradhara.\n\nRECEIVING BLESSINGS AND PURIFYING\n\nFrom the hearts of all the holy beings, streams of light and nectar flow down, granting blessings and purifying."
    },
    "guidedMeditation": [
      {
        "speaker": "Kadam Kyle",
        "time": "12:53",
        "text": "Just feel inspiring, purifying blessings pour down into our body and mind. And then we can begin our meditation by asking ourselves, what does the experience of having a precious human life feel like? What does the meditation object on precious human life really feel like from the inside?\n\nReally imagine what this beautiful virtuous mind is like and stay with that experience for a little while. To support this feeling, we can reflect as follows."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "20:28",
        "text": "Why is our present state of existence considered to be so rare and so difficult to attain?"
      },
      {
        "speaker": "Kadam Kyle",
        "time": "20:44",
        "text": "Every effect has a cause. And our present existence as human beings and as specially endowed human beings is a result of a number of specific and hard to create causes. In general, birth as a human depends upon having previously practiced pure moral discipline and giving.\n\nSpecifically, each aspect of a fully endowed human life has its own appropriate cause. Furthermore, in order to have attained this life, we must have generated pure thoughts or prayers to receive a bodily vehicle with which we would have the leisure and ability to improve our mind through the continued practice of Dharma or spiritual teachings. To be effective, such prayers have to be unpolluted by attachment to temporal comforts and happiness as it is rare that we create even one of these causes.\n\nIt follows that the fruit resulting from a combination of them must be extremely rare to find."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "22:47",
        "text": "Our fully endowed human life has so many unique hard to create effects all occurring at one time where in most lives we have zero of them or just maybe one. Let's marvel at this miracle of this precious human life even developing gratitude for those in the spiritual lineage who created these causes we are now experiencing. The people in our past lives who are reflecting on these points can transform our mind into a determination thinking like this, precious human life and these freedoms and endowments I must practice Dharma just hold this determination single pointedly for the final couple of minutes and then in our own time we can gradually arise more practice."
      }
    ],
    "postMeditation": [
      {
        "speaker": "Kadam Kyle",
        "time": "29:09",
        "text": "Okay, welcome back everyone. Let's see who we've got here. We've got Ryan, Fran, Ann, Smit, Marianne, myself in person.\n\nAnd online we've got Adriana, Grady, Ben, Dale, David, Mimi, Suzanne, Kristen. Ooh, David in the car, I love that. Are you driving?"
      },
      {
        "speaker": "Kadam Kyle",
        "time": "29:37",
        "text": "Okay, not as cool, but oh nice. Say hi to Lisa for us. Okay, so yeah, thanks everyone for being here.\n\nI do apologize if it is inconvenient because it is a holiday weekend. I think we did vote, but maybe we shouldn't have had class on this weekend. I don't know, but anyway, I'm happy to be here.\n\nYeah, I'm happy, anyway. Yeah, that's right. We're happy to be here, but hope it's not too inconveniencing for anyone who had family commitments.\n\nWe are going to start by reading The Guide to Bodhisattva's Way of Life, as I mentioned last class. And we'll principally use this as the root text for the book. For the first few times I'll read it, and you can join in.\n\nAnd then in future weeks we'll pass the job around to whoever's feeling feisty that day and wanting to read it."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "30:52",
        "text": "So we'll go from chapter 1, verse 1, including the homage, to verse 14."
      }
    ],
    "shantidevaReading": [
      {
        "speaker": "Kadam Kyle",
        "time": "31:08",
        "text": "Homage to the enlightened Buddhas and bodhisattvas. I prostrate to the enlightened Buddhas endowed with the truth body and to the bodhisattvas and all other objects of prostration. I'll explain briefly, in accordance with the scriptures, how to engage in the condensed practices of the bodhisattva.\n\nThere's nothing written here that has not been explained before, and I have no special skills in composition. My reason for writing this is to benefit others and to keep my mind acquainted. Thus, the strength of my faith in my virtuous realizations might for a while be increased by this, and perhaps others who are as fortunate as I might also find this meaningful to behold.\n\nThis precious human life, so hard to find, offers the ultimate goal for living beings. If we do not strive to accomplish this goal now, how will such a precious opportunity arise again? Just as on a dark and cloudy night, a flash of lightning for a moment eliminates all, so for the worldly, through the power of Buddha's blessings, a virtuous intention occasionally and briefly occurs.\n\nThus, while our virtues are mostly weak, our non-virtues are extremely strong and fearsome. Other than Bodhicitta, a compassionate mind wishing for enlightenment, what virtue can overcome the heaviest evils? The able ones, the Buddhas, who have considered this for many eons, have all seen Bodhicitta to be the most beneficial, because through it, countless masses of living beings can easily attain the supreme bliss of enlightenment.\n\nThose who wish to destroy their own suffering, those who wish to dispel the suffering of others, and those who wish to experience much happiness, should never forsake the practice of Bodhicitta. The moment Bodhicitta is generated, even in pitiful beings bound within the prison of samsara, they become bodhisattvas, the son or daughter of Buddha, and are worthy of veneration by humans and worldly gods. Just like the supreme elixir that transmutes into gold, Bodhicitta can transform this impure body we have taken into the priceless jewel of a Buddha's form.\n\nTherefore, firmly maintain Bodhicitta. Since the limitless wisdom of Buddha, the sole navigator of living beings, upon through investigation has seen its preciousness, those who wish to be free from samsara's sufferings should firmly maintain this precious mind of Bodhicitta. Whereas all other virtues are like plantain trees, in that they are exhausted once they bear fruit, the enduring celestial tree of Bodhicitta is not exhausted but increases by bearing fruit.\n\nJust as when those who are greatly afraid rely upon a courageous one, whoever relies upon Bodhicitta will immediately be freed from danger, even if they've committed unbearable evils. So why do the conscientious not rely upon it? Just like the fire at the end of the aeon, in an instant it completely consumes all great evil.\n\nIts countless benefits were explained by the wise protector Maitreya to Bodhisattva Sudhana."
      }
    ],
    "postReading": [
      {
        "speaker": "Kadam Kyle",
        "time": "35:15",
        "text": "Okay, very good. So then let's see, we have an abridged class today. We'll go to six.\n\nSo let's hear some lovely data. So a reminder that the model for sharing this is, I practiced da-da-da-da-da-da."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "35:30",
        "text": "This was the result I saw. Da-da-da-da-da-da-da. This is my conclusion.\n\nDa-da-da-da-da-da-da. Like that. So like this.\n\nOne, two, three. What I practiced, the result, and what I learned from that. Marianne, you have a hand there?"
      }
    ],
    "practiceReports": [
      {
        "speaker": "Kadam Kyle",
        "time": "37:41",
        "text": "Yeah, let's keep it moving. But then if we have some time, feel free to ask it."
      },
      {
        "speaker": "Student",
        "time": "37:48",
        "text": "Basically, it takes longer than I think, and I can't fit them all in with that in mind."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "37:54",
        "text": "Yeah, that's fantastic. Yeah, thank you. That's really good data, and it's nice to see that.\n\nAnd yeah, then the challenge or the way forward is figuring out how to like find a simpler way to do it, even if it's just very imperfectionist. And maybe having like a way to do it when we have almost no time and a way to do it when we have a little bit more time. And maybe having like, okay, this is mode one.\n\nThis is like emergency mode. And then this is mode two when I have like a little bit more space. And we can play around with it a little bit, but we can definitely do it in a minute if we need to, and it can be completely qualified and beautiful.\n\nSo it's definitely possible. Yeah, thanks so much, Mary Ann. That's great.\n\nAnn, please."
      },
      {
        "speaker": "Anne",
        "time": "38:39",
        "text": "This is similar to Mary Ann's, but I've been nailing the six things since we started, but when I was traveling for two days and with my family, it went from like six to four. And I just didn't remember to do it. And I realized that my practice depends very much upon my extremely rigid schedule.\n\nAnd I'm going to be away for 10 days over Christmas and New Year's in like four different locations. So I'm like, what am I going to do differently then? I definitely need to plan ahead, which I didn't do for Thanksgiving.\n\nAnd the other thing is, there are going to be times when I can't get away. So I think I need to come up with a little one or two-minute practice that actually takes advantage of the fact that I'm with other people, but would really give me the same experience of having a big electric Dharma kind of thing. So I need to plan ahead, like what's that going to be if I'm with my family or my friends?\n\nWhat's the practice going to be?"
      },
      {
        "speaker": "Kadam Kyle",
        "time": "39:46",
        "text": "Yeah, thanks so much, Ann. Yeah, 100% agreed. The normal schedule we have supports our practice a lot.\n\nIf we get it into a good groove, the second it's disrupted at all, the whole thing can go out the window. In this case, it didn't all go out the window, but it got really disrupted. And then this 10-day trip will be much more challenging, probably, in that sense.\n\nSo we have to make a plan ahead of time, as you mentioned. And if we do, we'll probably have a lot more success. And if we don't make a plan, we probably won't have much success at all.\n\nAnd then having that way to do it while we're with people is a skill, but it's very doable. Like I did a bunch of my sessions at a dinner table over the last week. People were just talking about whatever.\n\nAnd I just look off into the distance, and I go for refuge to the Three Jewels and confess individual negative actions, etc. I become Vajragini for a bit, while remembering all the things I normally see don't exist. I make offerings to my guru.\n\nI promise to rely on the dharmas of Sutra and Tantra, etc. I just do it in my mind, because meditation is a mental action. It's not a sensory action.\n\nSo the sensory activity actually ultimately doesn't matter at all. It's just sensory stuff. Yeah, but it's a little harder to do that at first.\n\nThen we have to become familiar with being very kind of imperfectionist to be able to do that. But we can find it really nurturing, even just being at that dinner table and just doing it in our mind. Yeah, thanks so much, Anne.\n\nSuzanne, then Sumit, and then Fran."
      },
      {
        "speaker": "Suzanne",
        "time": "41:36",
        "text": "Hi, I was wondering, this is going a little off the topic, but something really kind of incredible happened. Can I share that about my progress over the last six years? Okay.\n\nAs you know, I was going out to my family for the holidays. I haven't left New York City in six years due to the circumstances of taking care of Mia. When I first got to the train, I was very emotional going out there.\n\nWhen I first got to Atlantic Terminal, I just started sobbing because I'm like, oh, my God. All the memories came flooding back of all the past years and everything. I'm like, but everything's totally different.\n\nMy mom's sick. Things aren't the same as they were. When I got there, the samsara, the people, I went because I needed comforting, but I feel like I was there to comfort people.\n\nMy mom is in terrible condition. I had no idea. She's very disabled from this medication she's taking for cancer.\n\nA good friend who we went out with on Wednesday night just got diagnosed with cancer for the second time. I noticed what I really noticed, which was amazing, because you know how your family just irritates you or whatever. There was nothing.\n\nI just felt compassion. My mind is just totally different than it was six years ago. I don't know if anybody could have that type of measure because I think most of you have left the city in the last six years.\n\nYeah, it was kind of amazing. I was really trying to be there for my parents and help out as much as possible when I really went there thinking I needed care. Also, I noticed in my spare time, I was listening to classes.\n\nI did not do that six years ago. I was watching movies or doing other pleasures, and I just feel like most of my mind is really taken with the Dharma a lot of the time. That being said, my successions need work, but they haven't been great since Mia died, but I think today I got back on track a little bit."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "44:02",
        "text": "Yeah, thanks, Suzanne. Yeah, I think that sounds wonderful. You said you went there to be taken care of or supported, but it ended up being developing compassion for your family, but maybe that's how the Buddhas were taking care of you, right?\n\nBecause when we're in pain, actually the way to heal that pain is to develop compassion for others. That's the best healing for our mind, because it gets us out of our self-cherishing mind and so on. So it's, in a funny way, like they cared for you, in a sense, by being the objects of your compassion.\n\nThat's actually kinder than doing ordinary help, because being an object of your compassion is like the best gift. As Geshe Lengri Thangpa says, when we see unfortunate beings oppressed by evil and violent suffering, may we cherish them as if we found a rare and precious treasure. Just like the suffering being is the rare and precious treasure to the person who wants to train their mind.\n\nThat's like the best gift, because they're helping us develop the panacea of compassion in our heart. So it's lovely. Thank you so much, Suzanne.\n\nI'm really glad that that was such a success, and it's really cool to celebrate that, like six years, so much growth has happened, and so much change has happened. Thank you. Sumit, please."
      },
      {
        "speaker": "Sumit",
        "time": "45:42",
        "text": "I really try to get into the practice of imagining all the people I would help as if I was enlightened, and actually I ended up being really discouraged, because I guess in my normal life, I come here and have my classes, and honestly my friends are almost sort of like screens for people who are spiritually open, almost I'd say. And then I went home and stuff, and you're just meeting different folks, and in the interest of brevity, such folks are not, I won't go into detail, but such folks are not open to this kind of stuff, spiritual stuff, and they're not bad people, but they're oriented very differently. And I just really came across this feeling, and actually my mom talked about this a bunch too, because my mom is very religious, by the way, and her experiences too, and it was just like, man, people are just like really closed to this stuff.\n\nAnd I think about this point about how Buddha is always emanating blessings, but it's incumbent upon us to open the blinds, and Buddha's not going to open the blinds. And so I just kind of like, I walked away being like, I mean, part of it was I appreciated my folks here, but I also walked away with a little bit of like, even if I become enlightened tomorrow, so many people's blinds are closed to me. I'm not going to be helping people.\n\nI came away actually feeling very discouraged by that, as I really imagined it. So I'm kind of not in a, I don't know, I'm okay, but I obviously didn't get the practice. So I don't know."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "47:16",
        "text": "Yeah, I think it's like we're trying to imagine enlightenment from an incredibly unenlightened point of view, at least speaking for myself, like mind-bogglingly far away from actually being enlightened. Not in the sense of induration, because we're close from that point of view, but in the experience point of view. We're living in a completely opposite world than the enlightened mind.\n\nAnd so when we try to get our mind around that, that can feel discouraged, but it's principally because what we're imagining and envisioning is completely, utterly different than what our enlightenment will be like. So for example, those people that we're trying to help, that maybe we feel like, oh, it's not moving, it's not working. For most of us, those are the people we normally see.\n\nThose are inherently existent people that we're seeing. For a Buddha, inherently existent people don't appear at all. So it's like we're trying to help inherently existent people, and that's incredibly frustrating and difficult.\n\nBuddhas don't even see inherently existent people. There's not even an appearance of an inherently existent ordinary person to a Buddha's mind. So it's a very different operation going on.\n\nSo I would play around with that a little bit, with getting that sense of encouragement around benefiting others. How is thinking of them as inherent or ordinary, how is that actually where the discouragement can come from? Versus if I think about them as mere name, and helping mere name people be free of their mere name suffering, how is that actually much more encouraging?\n\nI'll try to bring the transcript next class from Geshe about this, because he's given some really crucial teachings on taking and giving about this, explaining this point. He's saying why do people have a hard time with taking and giving? It's because they're trying to take inherent suffering from inherent suffering people.\n\nBut you're actually just taking mere name suffering from mere name people. It's very helpful, I think. It's just a nice area to explore.\n\nI get what you're saying. It can be really discouraging seeing how difficult it is to benefit people. But it's also an invitation to look at our own mind and how we are viewing them, and work on that a little bit."
      },
      {
        "speaker": "Sumit",
        "time": "49:56",
        "text": "That's very helpful, thanks."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "49:57",
        "text": "Thanks to you. This is my random anecdote about the same point. I was with my dearest family people over the break.\n\nWe had a philosophical movie night, which is instituted by one of my nephews. We watched The Matrix. As we know, in The Matrix, they've never seen it before.\n\nThere's sort of a fake world created by computers, like a hallucination, and there's the real world. At the end, we were discussing, would you want to go back into The Matrix, which one of the characters does. They leave the real world and go back into the hallucination.\n\nThree of the people in my family said yes, which I couldn't believe. I honestly couldn't believe it. They weren't joking.\n\nThey were completely sincere. They were like, if I could get a good life, and not see the truth, and just live in a simulation or whatever, I'd do it. I'd just abandon all this.\n\nI was feeling kind of similar to what you're describing, which is like, oh my gosh, you would want to go away from the truth, right, to an anesthetized experience, instead of facing reality. It was very helpful, though, because I left really actually shocked after that discussion, but thinking, wow, I'm actually more inspired now to become a Buddha, because this is showing how limited I am right now in being able to help these people, because they want to go back into The Matrix. This is not even like...\n\nAnyway, sorry, this is just my own issue. But yeah, there are challenges, but they're not inherently existent challenges. Okay, Fran, please, yes, and then Mimi after that."
      },
      {
        "speaker": "Fran",
        "time": "51:51",
        "text": "I'm definitely team six times a day. I've been doing very consistently. I think since we've started, I've only missed one session on one day, and I think the only way that I keep it going is because I've learned over the years that to keep it simple, that to make things complicated so that I don't do it simple and imperfect is better than more sincere, more complicated, more extensive, and not doing it.\n\nSo I really can do... I have four steps in my six sessions, and I probably can do it all in three minutes and have it feel meaningful. My area of self-generation could be as brief as close my eyes, and I don't go through the whole dying process.\n\nI arise on the same nature as Vajrayogini. I am Vajrayogini, and that's enough for me to remember that I am Vajrayogini, and I do my bodhisattva vow, and sometimes I elaborately go through the benefits of bodhicitta. Sometimes I remember what I consider the main one for me, and I have a little six-line prayer that is for me, but it's essentially asking for blessings.\n\nSo when I do it, even if it's quickly, I get a sense of rejoicing that I did it, and it was all meaningful, and I feel it all in my heart. It's not in my brain, and what's very interesting is sometimes the feeling, that full feeling in my heart is very similar to what I feel with my anxiety. So it's just showing me that I just need...\n\nthat I can just reframe that feeling into being something blissful. What I did notice is that I've gotten very lax with keeping my little book, with planning out my day, and that that's not going well. I can see how it can easily deteriorate into cramming in three sessions before bed, and that's not good, so I need to go back to that, and then maybe that'll be helpful on the days off.\n\nAnd Sumit, I just wanted to say that you can help anybody by praying for them. We don't have to help them today for the whole process."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "54:10",
        "text": "Yeah, thank you, Fran. Lovely. Yeah, keep it simple is the key.\n\nMimi, yes?"
      },
      {
        "speaker": "Mimi",
        "time": "54:19",
        "text": "Hi. So what I practiced for the past two weeks was really interrupted. So I didn't practice all my six sessions, but what I do do is quite naturally, just before I get up, in the midst of sleep and waking, I find that I'm doing the yoga of rising very naturally.\n\nSo that part is there, but the result is a little similar to Suzanne. I think my mind has been on the Dharma for the past two weeks, like really strong, because of studying for the test and preparing for my Friday class and practicing for the Saturday class, attending brunch. So my mind has definitely been on Dharma.\n\nAnd what I learned was, I might get a little emotional, because I've been doing clarity of mind for Friday nights, and what I found was that I was doing the meditation and I was like, oh wow, this is like Mahamudra Tantra. And I don't know, I just started making these very organic connections. I don't know if they're like mini realizations or what.\n\nAnd then yesterday when I taught the class, which I practiced, practiced, practiced, and in the middle of the class, I just felt Geshe-la. She was just in my heart. I don't know, my heart right now is so open, so, so open.\n\nI feel so blessed. But I'm a little bit fearful, because I'm like, oh gosh, I've got to go to work tomorrow, and I can't be this totally open vessel. I feel very, very tender in my heart.\n\nYeah."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "57:03",
        "text": "Yeah, thanks Mimi. Yeah, I think the main takeaway there is just the benefits of studying the test and studying Dharma, which is like, as you said, you're starting to make these connections that weren't there previously, kind of organically. And I found for myself that when I really put effort into studying, like studying Dharma in general, which often happens a little bit more than normal when I have a test or something coming ahead that I'm taking, that my mind is like at its most virtuous compared to the rest of the year.\n\nIt's like the most virtuous time. Even if my other stuff is a little bit less at the forefront, it's because my mind is mixed with the Dharma so thoroughly, through memorizing or reading or reflecting, that all these beautiful things come forward. So yeah, it makes total sense that that was sort of happening in your heart.\n\nWhen we have those moments, it's very helpful to think it was because we were so mixed with the Dharma, and not think of it as a coincidence. And hopefully that can give us some encouragement in future times to stay mixed like that, not just when we have an exam or something that we're studying for. To be like, wow, that was special.\n\nHmm, I could do that more often. I don't need to wait once a year when I have an exam coming up to really mix my mind with Dharma like that. So yeah, it's lovely.\n\nThank you very much. Okay, let's take a look at the text. I think the mic's on still.\n\nThanks. Alright, so we are on The Method for Making This Precious Human Life Meaningful, page 20. It says here, this has two parts.\n\nContemplating the Benefits of Bodhicitta, How to Practice the Six Perfections Once Bodhicitta Has Been Developed. Contemplating the Benefits of Bodhicitta, this section has four parts. An Explanation of the Benefits of Bodhicitta, Recognizing Bodhicitta, The Reasons for the Benefits of Bodhicitta, Praise to the One Who Gives Birth to Bodhicitta.\n\nAn Explanation of the Benefits of Bodhicitta. As indicated before, the supreme method for making this rare and precious human rebirth meaningful is to use it as a vehicle for attaining the most perfect and complete enlightenment. To work for any lesser goal is to throw away this unique opportunity.\n\nSince the attainment of enlightenment depends upon first developing the mind of enlightenment, bodhicitta, the motivation to achieve full enlightenment in order to be most effective in helping others out of their suffering, Shantideva encourages us to develop bodhicitta and describes its many advantages. These are divided into the following ten outstanding benefits. So I sent along my little acronym that I use to remember the ten.\n\nCON-E-VIP-SUS Two S's at the end. Very helpful. Very easy to remember if you get the little acronym down.\n\nCON-QUEST is the C. ATTAINMENT is the A. WISH FULFILLMENT is the W.\n\nSPECIAL NAME AND MEANING is the N. TRANSFORMATION OF THE INFERIOR INTO THE SUPREME is the I. CON-E-VIP-SUS VALUE OF THE SUPREME BODHICITTA So hard to find.\n\nThat's the. INCREASING EXHAUSTIBLE BENEFITS OF BODHICITTA That's the second I. POWER OF PROTECTION FROM GREAT FEAR is the P.\n\nSWIFT AND EASY DESTRUCTION OF GREAT EVIL That's the first S. SCRIPTURAL CITATIONS is the second S. CON-E-VIP-SUS EASY So it's good to learn these ten off by heart.\n\nJust have them. It doesn't have to be perfectly worded, but just the gist. These ten are ten individual meditations.\n\nAnd what I would really encourage us to do over the next week at least is to try to either do one a day and just keep it as like something that you are remembering throughout the day. It could be in your succession practice or other times. So either do one a day or like match the successions with six a day.\n\nIt just depends on what you want. If you rather just think about one each day, like conquest over all evils, all great evils, and you just admire that benefit for a whole day, that's great. If you want to do that in the first session, and then the attainment of the most sublime happiness in the second session, a wish fulfillment in the third, etc., then that's great too. But what we want to do is get a special feeling for all ten. And we need to kind of milk them a little bit. You need to work them a little bit to get a special feeling for each one so that they touch your heart.\n\nSo having some kind of systematic way to do this is the way to start connecting to these. I've kind of found in my practice that one a day is the way I like to do it just because sometimes the first few shots at it, I'm not there yet, I'm just getting my mind around it. Like bodhicitta carries with it a special name and meaning.\n\nDoes that touch your heart at first? Maybe not, right? What does that even mean?\n\nIt carries with it a special name and meaning. Why is that supposed to touch my heart? Right?\n\nMaybe in that first one you're trying to remember what it even means, but you don't have tons of time, but maybe in your successions in the second, third, fourth time you kind of like start to get a sense of what's really being talked about there. For example, there's a bit about this lineage of Buddhahood. And we start to get that.\n\nThat's a big part of that benefit. I'm in this lineage of Buddhahood. Ah, that's part of why it's so special.\n\nAnyway, you get the idea. I've found personally, one a day is a nice way to do it, but feel free to approach this in any way you'd like. As we know, the way to develop any positive state of mind is through the dependent relationship between faith, aspiration, and effort.\n\nSo, through developing admiring faith in bodhicitta, we'll eventually develop wishing faith in bodhicitta, and then, which is basically the aspiration part, we'll really wish for it, and then we'll put effort, joyful effort, into its cultivation. So, the ten benefits are the way to develop admiring faith in bodhicitta itself."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:05:50",
        "text": "And so, what we're trying to do in this development of admiring faith for bodhicitta is to raise our wish for it to a kind of critical mass that's greater than our wish for, for example, our worldly concerns, or other interests. Basically, when our Dharma practice is dominated by our wishes for our worldly concerns, like wealth and reputation and pleasure and avoiding pain, things like this, then, because those wishes have so much weight, they end up basically dominating everything we do. It's like, in a company, right, if you have like 51% of the company, you have deciding power.\n\nAnd the mind is a bit like this, that it's basically a winner-take-all mechanism, that the strongest wish in any moment will always win out. So, if our interest in bodhicitta is 49%, and our interest in worldly concerns is 51%, it's basically going to win out pretty much every time. We do what we want to do.\n\nIt's Geshe's famous quote. We do what we want to do. So, a big part of making spiritual change, but especially making these benefits work, is making bodhicitta essentially more interesting to us than our worldly concerns.\n\nAnd it's like a scale. It's a little bit like a yeah, it's kind of like a zero-sum kind of situation. It's like, you only have so much wishing energy in the mind.\n\nLet's call it 100 points of wishing energy. So, if that is being used up sufficiently with the worldly concerns, right, I want to have a lot of wealth, or I want to be beautiful, or I want to be liked, or I want to have a certain status, or I just want to feel good now, then there's only so much wishing kind of energy left to go around. And if it's not a critical mass, like basically more than the worldly concern wishing energy, then essentially zero things happen.\n\nNothing happens. It's like, again, it's like having like 49% of the company. You're like, I vote for this happening!\n\nAnd the people with the 51% say, cool, you lose. We have 51%. You lose, again.\n\nIt feels like a little unfair, in a sense, but it's actually completely fair. That's how the mind works. It's a completely fair system.\n\nIt's like the winner takes all. So, the point is, when we're working these benefits, we're also simultaneously trying to work the worldly concerns down a little bit. Like, the benefits of bodhicitta will only rise if the thoughts of the worldly concerns, of being attached to the worldly concerns goes down.\n\nThey're kind of dependently related, like a seesaw or something like this. That's what Geshe-la says here in How to Understand the Mind. So, my aspiration, which is, again, this is the part of the mind we're trying to develop here.\n\nThere's a two-fold division of aspiration. Mistaken aspiration, non-mistaken aspiration. Mistaken aspiration is any wish that's not consistent with our basic aspirations, to experience happiness and avoid suffering.\n\nAnd a non-mistaken aspiration is one that is consistent with these basic aspirations. The difference between a wise person and a foolish person is their aspirations. Even if we've not studied extensively, if our aspiration is good and unmistaken, we'll naturally engage in virtuous actions which will result in happiness.\n\nBut if our aspirations are mistaken, we will not succeed in finding happiness, no matter how great our worldly intelligence. Often criminals are highly intelligent and clever, but because their aspirations are mistaken, they commit crimes from which they are sent to prison. If our wishes are not good, this is a sign that we do not possess true wisdom.\n\nSome people study Dharma for many years, but receive little benefit. And their understanding remains only intellectual. The main reason for this is that their aspirations are not pure.\n\nAlthough superficially they have some interest in Dharma, deep down their real interest is in worldly things. Other people whose aspiration is pure receive genuine experience of Dharma, even though they have not studied extensively. Their correct aspirations encourage them to engage in pure, virtuous actions, and these result in pure effects.\n\nWhat we accomplish depends primarily upon what we wish for. So if our wishes are pure, we will obtain pure results from our practice. The most important thing, therefore, is to develop and maintain correct aspirations.\n\nThe supreme aspiration is bodhicitta, the wish to attain Buddhahood for the benefit of all sentient beings. With this aspiration, all our actions become causes of attaining Buddhahood. So basically, the whole thing here is developing a wish to develop a really, really good wish.\n\nThat's what we're doing. This is how the mind works. Wishes create everything.\n\nThe best wish is bodhicitta. Therefore, we need to develop the wish to develop that wish. The thing that's getting in the way of us developing that wish is that we wish for other things that don't actually make us happy.\n\nThese are our worldly concerns. The way to develop aspiration is just so simple. We just have to follow the mechanism, which is admire the good qualities of having something, admire the bad qualities of not having that thing.\n\nThat's how you do it. It's just completely simple. The bad qualities of not having bodhicitta could be said like, this is what happens when we follow the eight worldly concerns.\n\nIt's good enough. Basically, the misery of being controlled by attachment and the incredible pain and frustration of that life, which isn't complicated to figure out. This idea of mistaken aspirations and non-mistaken aspirations, what we're trying to do is we're trying to match our basic wish, I want to be happy and free from suffering, with bodhicitta.\n\nWe're trying to see how our wish to be happy and free from suffering, that's our basic wishes, do not line up with the eight worldly concerns. Basically, the benefits of bodhicitta help us see, ah, my basic wish is being fulfilled by bodhicitta, my wish to be happy and free from suffering. Then we reflect, craving wealth, resources, being light, pleasure, avoiding pain, that goes against my basic wishes to be happy and free from suffering because it makes me absolutely miserable.\n\nAs we reflect on that, then our wish to develop bodhicitta will grow more and more and more and more. I know we know these things, but just trying to make the mechanism a little bit obvious about what we're looking at here. If we understand this, that it's a simple cause and effect dependent relationship situation, then we'll just be very interested in admiring bodhicitta.\n\nSo then, great, that's all I have to do. Admire it more and more and more and more and more and more and more and more and think about how painful attachment is. More and more and more and more and more and more and then I'll just want bodhicitta more and then I'll develop it.\n\nThat part is easy. If we have this strong, powerful wish to develop it, we just will very quickly and easily. If we don't wish to develop it, then we'll feel like, I should do it, I'm supposed to do it, I'm being very bad for not doing it.\n\nIt just gets us nowhere. It's a very boring place to live. It's just like a moralistic, dead place to live.\n\nSo all we have to do is admire it more and more. So let's get into these ten benefits. There's different ones in Joyful Path and Good Fortune.\n\nYou might find some fun ones there that you'd like. While we study this book, we'll just look at these ten here. But feel free to check out the additional ones in Joyful Path, because ultimately there's infinite benefits.\n\nThese are just like I don't know, like groups of benefits that contain many other sub-benefits. Conquest of all great evils. Just as a sudden, powerful flash of lightning on a pitch-dark night briefly illuminates the landscape, so the powerful blessings of Buddha cause worldly people to develop, at least for a short time, the intention to practice virtue.\n\nUsually the virtues of worldly people are weak, while their instincts for non-virtue are strong. We know that very well. Thus, we must constantly strive to overcome the great power this evil of non-virtue exerts upon us, replacing it with a strong practice of virtuous actions.\n\nOtherwise, if we do nothing to correct our present situation, the sufferings of samsara will be our sole experience. What is the best method for abandoning evil and creating virtue? We must strive to attain the precious bodhicitta.\n\nOnly it has the power to overcome evil and abundantly increase our virtue. Other than the boundless mind of bodhicitta, what else has the ability to subdue such great evil? By reflecting upon this well, it becomes clear that we must develop, we must definitely develop bodhicitta.\n\nHow would we take this one and make it touch our heart? Do you have a question? The people online can't hear if you just talk out loud, so it's not very kind to just yell it out."
      },
      {
        "speaker": "Ryan",
        "time": "1:18:17",
        "text": "I just want to know what evil is here. We're not talking devil or things like that, right? We're talking about just non-virtuous action."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:18:30",
        "text": "The word Mara in Sanskrit basically means demon. Demon."
      },
      {
        "speaker": "Ryan",
        "time": "1:18:37",
        "text": "Can you simplify? I don't know what demon is. Is it Satan like in Jewish country or like..."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:18:45",
        "text": "It basically means something that obstructs our liberation. So anything that obstructs our liberation is a Mara. Mara.\n\nSo there's different types. There are five aggregates. Five contaminated aggregates are Maras.\n\nUncontrolled death is a Mara. The delusions are the principle Maras or demons. And then there are living beings with bad intentions that can function like Maras for us.\n\nLike demons for us. Not inherently, but depending on our mind they can function that way. So evil basically means like something that obstructs our liberation.\n\nBut you want to get that sense of like how bad it is. That's why it's a great word actually. Because like you're mentioning the tradition you were brought up in.\n\nWhen people talk about something like demonic, they mean something really scary and bad. Like really negative. And we do want to feel like non-virtue that's not purified in our mind.\n\nAnd the delusions are like this. Not scary in the sense of we can't conquer them. We're not intimidated by them.\n\nBut scary in the sense of the destruction and pain and misery they cause is horrendous and terrible and evil. It's actually a very nice word in this book. It's not used in other books because it's a bit old fashioned.\n\nthat gravity of it is really useful. Because sometimes we don't think of our delusions in that way. We don't think of them with that gravity.\n\nLike oh, it's just a little attachment. Or something like that. Well, what does attachment do to us?\n\nIt's terrifying what it can do to us. It's absolutely horrible. And the effects are evil.\n\nThey're terrible what attachment can do to us. So anyway, the word is quite useful in this sense. But think of it more like a cause of suffering or something that's obstructing our liberation.\n\nSomething like that. So how do we mind this benefit? How could you take this benefit and go Yeah!\n\nConquest of all great evils! Like now I'm inspired about bodhicitta? Okay, great!\n\nThis is a good sign that we need to do that we need to work this a bit. Because there's a dead silence in here. Oh, Adriana, yeah."
      },
      {
        "speaker": "Adriana",
        "time": "1:21:39",
        "text": "I have one idea. I often find myself, like if I'm in a bad place, I'll say, when the container and the contents are filled with evil, transform adverse conditions in the path to enlightenment. From Geshe Chekwa.\n\nFrom Universal Compassion. And I the more I accept, yeah, it's like a mind of acceptance where basically everything happening in samsara is some form of evil. Like there is nothing good.\n\nAnd there's nothing to save. And so bodhicitta to me becomes this life raft. It's like the only thing to hold on to and the only thing to practice when we feel like we're drowning is compassion for others.\n\nThat's the only go-to. And even when we are succumbed by the evil, like if I start going down a train of anger, I can stop it with compassion and bodhicitta. So it is the most powerful, most reliable.\n\nOf course, I think it's the only thing that works."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:23:03",
        "text": "Thank you. Thank you very much, Adriana. I love that.\n\nDale? I think you're muted right now."
      },
      {
        "speaker": "Dale",
        "time": "1:23:16",
        "text": "I'll make it quick. I'm really dovetailing on what Adriana just said, but I find that the minute I feel attached to something, whether it's a person or a thought, more than a thought and a desire, it's no good. It feels bad.\n\nIt feels a lack of something. It feels a grasping. It just does not feel good.\n\nAnd the minute I say no, we're going to think about, or I'm going to think about something that's virtuous, like bodhicitta, like helping other people, like not thinking about yourself. And that helps a lot."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:24:04",
        "text": "Thank you, Dale. I think that's a really nice point about getting that sense of the pain of delusions. In this case, you're mentioning attachment, right?\n\nHow it basically makes us feel demeaned and less than the second we get attached to something. It just feels like we're less than the second we become attached. Like we're not good enough, or we don't have enough.\n\nThat feels horrible. And then when we heal that with a virtuous mind, like bodhicitta, there's this sense of incredible relief, incredible freedom. Yeah, it's a conquest over one of the evils in that moment.\n\nOne evil. In this case, attachment. Fran, yeah?"
      },
      {
        "speaker": "Fran",
        "time": "1:24:48",
        "text": "I think this is telling me that we have to be ever mindful because the virtuous side of us is so weak and that the non-virtuous is stronger and that we need to create the causes for the virtuous to be stronger. And that the only way to do that is by developing bodhicitta, by practicing compassion and all those things. That each time we do that and are mindful of the alternative, the non- virtuous alternative, that we're choosing and creating the causes to be more virtuous down the road."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:25:30",
        "text": "Yeah, so you're kind of mentioning how this does connect a little bit to one of the later benefits, but that until our virtue is strong enough, that kind of fragility can easily be conquered to the delusions. The delusions can actually wipe it completely out. I mean, obviously we still have a Buddha nature, but it can basically put an end to all of our virtuous impulses.\n\nSo one of the things that bodhicitta does is that it gets us across a threshold where we'll never turn back again in our practice. And until then, our virtue is quite fragile and weak. And we're very vulnerable.\n\nAnd it's like, okay, bodhicitta's going to help me conquer all the evils in my mind. It's going to get me over that threshold where I'll never have to redo this again. I'll conquer it.\n\nAnd for me, that's very inspiring. I'm like, oh, I want that. I don't want to keep doing this over and over again.\n\nRyan, you have a hand there?"
      },
      {
        "speaker": "Ryan",
        "time": "1:26:43",
        "text": "By meditating on destruction of attachment, and I think you said something that either by the GP class today or the Harjul this morning that really hit me. You said how destructive attachment or craving is versus people who are trying to do evil to you. You can negotiate, you can convince them, you can make them friends.\n\nBut attachment or cravings, they will not let you go until you die. Or you get liberated of that craving. That really hit me.\n\nYeah, there's no other way. That's destructive. There's no other way around.\n\nBy meditating on that, bodhicitta and refuge is the only answer."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:27:33",
        "text": "Thank you. Anne, did you have a hand there?"
      },
      {
        "speaker": "Anne",
        "time": "1:27:40",
        "text": "I'm also thinking that until I have bodhicitta, my actions are always still going to be tainted with bad intentions, no matter what. I won't be able to help it. And also, when I have bodhicitta, every action I take will just accumulate me a vast sum of merit.\n\nEverything I do will be helpful, will increase my progress on the path. And until I have bodhicitta, actually everything I do is actually taking me a little bit backward."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:28:11",
        "text": "Yeah, this is actually a big part of this benefit. And having the root text is helpful here. It's referred to in this verse 5, which is in the text.\n\nJust as a sudden, powerful flash of lightning on a pitch-dark night briefly illuminates the landscape, so the powerful blessings of Buddha cause worldly people to develop at least for a short time the intention to practice virtue. Part of this is this sense of a quick change. This is also later in the swift destruction of evil.\n\nBut there's this sense of the flash of lightning instantly illuminates everything. And so in the same way, it's like this mind of bodhicitta metaphorically instantly illuminates our spiritual path. Up until that point, we constantly have ulterior motives.\n\nWe're constantly creating karma that is to be reborn in samsara. It's a contaminated virtue. Which is like the example Geshe-la gives.\n\nGiving but out of self-grasping might get you reborn as a rich person's poodle. It's like this contaminated virtue. You get a good result of giving, which is like, I'm in a rich family, I'm really taken care of.\n\nBut it's this contaminated virtue. It's not actually for liberation. You might just end up like their poodle in their little bag that they bring around everywhere.\n\nIt didn't exactly lead to liberation. When we develop bodhicitta, there's a sense of this flash of lightning. It illuminates everything instantly, quickly.\n\nThe merit created quickly brings us to enlightenment. Very rapidly, almost instantly. Relative to how long it's taken to get to that point.\n\nIt's a nice sense to connect to. We're just getting the hang of it. Working these benefits.\n\nThere's a lot more to say, but I just want to give us a little bit of a sense of it. Mimi, you had a hand there?"
      },
      {
        "speaker": "Mimi",
        "time": "1:30:39",
        "text": "I can pass, if we need to move on. It's okay."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:30:43",
        "text": "Okay, cool. This is just like a little dipping of our toe into one benefit. Conquest of all great evils.\n\nMaybe I'll just say one from the point of view of higher sagatantra. Like the bodhicitta of tantra, is basically our self-generation practice. Viewing ourselves and others as buddhas.\n\nAnd viewing ourselves in a buddha world, buddha land. That's like our generation stage. Bodhicitta, that's what it is.\n\nAnd so it's like that's really the conquest of all great evils. Because we're perceiving a world free of evil, free of suffering. So bodhicitta from sutra is the wish to become a buddha for the benefit of all.\n\nBut the bodhicitta in generation stage tantra is envisioning ourselves as a buddha. Imagining ourselves in an enlightened world. And that bodhicitta very clearly is the conquest of all great evils.\n\nBecause we're only perceiving a world free of suffering at that point. Okay, the attainment of the most sublime happiness. In general there are many ways in which we can benefit sentient beings.\n\nBut the buddhas who have spent eons examining the best way to help others say that developing bodhicitta is the supreme method. Why is this? Because with the development of bodhicitta, we're not only able to attain the supreme happiness of buddhahood for ourself, but we're also able to lead countless masses of sentient beings to the incomparable bliss of the supreme state.\n\nRecognizing the benefits bodhicitta has for ourself and others we should strive to attain it. Okay, so this benefit is relatively clear. It's basically saying the best kind of happiness around for ourself and for others only comes through bodhicitta.\n\nSo this is nice because it's like part of the drive in the Eight Worldly Concerns is a wish to feel good. It's a wish for pleasure to have a kind of happiness, right? And so this benefit is a little bit playing on that like saying the happiness you get from bodhicitta is far more sublime than the happiness that any of the worldly concerns can provide.\n\nAny of the worldly pleasures provide a much lower grade form of happiness. And not only this, but it's the happiness for countless living beings. So for example, we can start to connect our bodhicitta with as Geshe says here, the incomparable bliss of the supreme state.\n\nSo we start to think about bodhicitta as incomparably blissful. When something seems really blissful, like something that we're ordinarily attached to, we really want it. We're like, ooh, that looks really good.\n\nYeah, I want that. That would just be amazing. Yum, yum, yum.\n\nLike that. We're like getting enticed by it. So we want the same sense like with bodhicitta.\n\nAh, that's going to give me the most incomparable bliss. Far better than any worldly happiness. And then we can take the people in our life and imagine their incomparable bliss that they'll get from our bodhicitta.\n\nAnd just like rejoice in that, and delight in that. And think how beautiful that will be for each of those people. And we can just like celebrate that from the depths of our heart.\n\nLike just thinking, yeah, I want that for them. And I want that for me."
      },
      {
        "speaker": "Sumit",
        "time": "1:35:31",
        "text": "Sumit, yeah. So I had a question about this one and the next one as well. So one of the basic qualifications of the mind of bodhicitta is that the motivation is to benefit others.\n\nAnd so when I read this, number two and number three in particular, he's talking about my, which is being filled with my bliss, etc. And I feel like the second I'm motivated by myself, motivated by good things for Sumit, I'm already outside the mind of bodhicitta. So I guess it seemed like a contradiction to me."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:36:06",
        "text": "Yeah, yeah, yeah. I know what you mean. It's like...\n\nAnd we can ask the same question, for example, when Geshe teaches on the benefits of cherishing others. Wait, cherishing others? It's supposed to be for them.\n\nWhy are you talking about the benefits for me? Isn't that a contradiction? Isn't that selfish?\n\nYeah. The reason is because we're still absolutely enmeshed in self-cherishing. So this is actually very skillful.\n\nIt's basically saying even if you're completely bound in self-cherishing and only in it for you, it's still the better thing to do. It's just like a way to trick our self-cherishing mind. It's like saying the self-cherishing mind is choosing the thing that's terrible for it.\n\nJust like all the selfish ordinary thoughts. So it's like even if you just wanted the best thing for you, bodhicitta would still be the best choice. So all the doors are closed.\n\nAll the routes of escape are closed. So it's just like a skillful way that Buddha teaches. If you're totally motivated by others, great.\n\nIt's a win for that. Even if you're motivated just for yourself, it's still the best thing to do. So you're trapped into virtue.\n\nLike that. Of course, and you're right, of course over time we want to reach a place where we're completely free of any ulterior motive. But until then, we still are motivated, incentivized by things that help us.\n\nAnd so we might as well use that for a good result. Wish fulfillment. A further benefit of developing bodhicitta is that all of our wishes will be fulfilled.\n\nIf we want to be released from the many miseries of samsara and dispel the unhappiness of others, bodhicitta can fulfill these aims. In addition, it fulfills the desire of all beings, including ourself, who long to experience limitless and immeasurable joy. Therefore, since the mind of enlightenment grants all wishes, Shantideva advises us to reflect upon its many benefits, and never cease striving to attain it.\n\nDoes anyone know that there's a different explanation of this in steps to happiness in the bodhicitta section? It goes like this. How does bodhicitta fulfill all of our wishes?\n\nAnyone know the reasoning? No? Okay.\n\nThis is a different way to approach the same reason, but it's I think it's very interesting to ponder. So, I don't have it memorized, but I have the gist, which is, when you develop bodhicitta, your wish is to become enlightened for the benefit of all. So therefore, anything that happens fits within your wishes.\n\nWhy? Because every single thing that can happen just gets folded in to your wish to become enlightened for the benefit of all. So bad things happening are part of your wish to become enlightened for the benefit of all.\n\nBecause you're like, great! Bad things means more compassion, means more bodhicitta, means more enlightened. Bring on the bad things.\n\nThe good things happening, we go, great! I wish to become enlightened for the benefit of all is being fulfilled. So basically, the mind of bodhicitta makes everything that happens a fulfillment of our own wishes.\n\nBecause it just gets folded into that mind of bodhicitta. If we compare it to the eight worldly concerns, like I wish to become I wish to have enough wealth that I don't need to work ever. Maybe that's a wish that we have.\n\nThat wish is a very narrow wish. That's somewhat hard to fulfill. Some people fulfill it, but most people don't.\n\nSo therefore, most things that occur in life are not actually helping fulfill that wish. So then your life is filled with a lot of annoying inconveniences. You have a very narrow wish.\n\nI want to have enough, so I never have to work and just hang out all day. So therefore, everything that is not that is our wish is not being fulfilled. So we've set ourselves up for living a life where we have one little narrow wish and a lot of things that are not fulfilling our wishes.\n\nAnd that's a pained, anxious life. If we have a more broad wish, for example, the wish to train our mind, now our wishes are being fulfilled a lot, because most situations help us train our mind. Most bad things that can happen make us train our mind.\n\nGood things that happen can help us train our mind. So that wish basically creates a setup where our wishes are constantly being fulfilled. So we're not as anxious, we're not as worried.\n\nWe actually feel like we're constantly getting what we want. So bodhicitta is just the like even higher grade version of that wish. It's the wish to become enlightened for the benefit of all.\n\nSo essentially every single thing that happens lines up with that. So we can just see like obviously this is a more simple way to think about it than, or this is a more approachable here and now way to think about it. The way in the text is basically saying one day we'll be a Buddha and be able to help everyone everywhere emanating everything they want that will fulfill everyone's wishes.\n\nBut we can think about it more in the here and now sense of like when I have this mind any single thing that could possibly happen just is a win for me. So therefore I'm just getting what I want no matter what. And that would be really nice.\n\nThat would be a wonderful experience. And anyway, please visit that little section in New Eight Steps. It's in the bodhicitta chapter.\n\nPretty early on. Part of this here is also again spending time reflecting on how these attachment wishes don't fulfill our basic wish. And just like spending more and more time on that.\n\nWhich we're all relatively familiar with. How we have a basic wish to be happy. But our attachment gives us the opposite of that over and over again.\n\nAnn, yeah, please."
      },
      {
        "speaker": "Anne",
        "time": "1:43:41",
        "text": "I was stumped reading this before the class and now I'm a little more clear. But just the difference between two and three is two more about the feeling and three more about particular circumstances. States of things being true or false being fulfilled.\n\nIf that makes sense."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:44:08",
        "text": "Sorry. Is your question just what's the difference between two and three? Attainment of most sublime happiness and wish fulfillment?"
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:44:31",
        "text": "There's slightly different nuances. Attainment of most sublime happiness this is just like totally rejoicing in the incredible bliss that comes from Buddhahood for ourselves and others. And what it's doing is it's undermining the bliss we're looking for in our worldly concerns.\n\nAgain, we always have to come back to this idea that our wishes are competing. It's an adversarial environment. So it's like, the more we want the worldly concerns, the less we want bodhicitta.\n\nSo it's like saying, okay, attachment's about bliss, feeling good, etc. That output that it's craving, it's incredibly bad at getting. It's just awful at getting that output.\n\nIt's all a lie. The attachment facade is a complete lie. It mostly just brings misery and deprecation.\n\nSo it's kind of like playing on that. So versus bodhicitta gives us that happiness, that bliss in the greatest sense. So it's like talking about that kind of output and therefore undermining attachment.\n\nFor me, when I reflect on wish fulfillment, this for a long time was my favorite of the ten that I first connected with. And there was a sense of the contentment that comes from wish fulfillment that really appealed to me in this benefit. Which is more just about exploring the frustration of having attachment-based desires.\n\nAnd how dissatisfying that constantly is. And to just feel like bodhicitta's going to bring an end to that dissatisfaction. Never going to essentially want something that I can't have or shouldn't have ever again.\n\nI'm going to finally reach this sense of having enough. And that kind of craving, desiring part of the mind will finally be satiated. And wouldn't that be lovely?\n\nOf course that would lead to the most sublime happiness. But it's a slightly different nuance. And that for me, when I was doing this, it was when I was being absolutely tormented by those minds of attachment.\n\nSo it was very appealing. Like, oh. Like I finally will be done with the pain of wanting something I can't have.\n\nOr don't need. Or is this going to bring me more suffering? Oh, I want that.\n\nI want that today. Yeah, so they'll always have overlaps, but it is nice to kind of discover the nuance in each of these."
      },
      {
        "speaker": "Mimi",
        "time": "1:48:07",
        "text": "Just have a question, a clarification question on wish fulfillment. Because you're saying that even the negative things that happen, the bad things that happen, are all folded in. Like it's like a lojong practice, right?\n\nLike we're even using that to propel us towards bodhicitta, right?"
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:48:41",
        "text": "It's like as Geshe-la says in one text, it says like if you want to give, you need an object of giving. So that object of giving is a necessary person to have around so that you can practice giving itself. You need like a person to give to.\n\nIf we have the wish to become enlightened for the benefit of others, then every single thing that occurs fulfills that wish. Yeah, so basically that's what it means. Like everything can be used to become more enlightened for the benefit of others.\n\nSo if our patience is weak, great. Bad situation, great, I get more patience. So now my wishes are being fulfilled by a bad thing happening that's challenging my patience, and so on.\n\nSo that's kind of the sense."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:49:51",
        "text": "Yeah, thanks. Okay, so we won't kind of keep playing through these right now so that we can all get some time reflecting on them in our own life. One other just little thing I want to mention about this nourishing of the bodhicitta mind is it's about connection.\n\nAnd it's about connecting to others. So one of the issues with realizing emptiness without bodhicitta is that we attain a state which is called solitary peace, which is like a big comfy nap where we feel really good, but we're useless to everyone. So for a Mahayana practitioner they have more fear of solitary peace than of samsara, because of its ignoring of all living beings.\n\nAnd part of this is if we reflect on this output of realizing emptiness without bodhicitta, it's not really actually realizing emptiness, but it's a deep understanding of it without bodhicitta, there's a sense of isolation there. You become isolated, actually. Which is a really interesting thing to think about, like the kind of karmic effect there.\n\nAnd creating the effect of isolation somehow. And so we can think of the flip side, which is the mind of bodhicitta is leading to the opposite effect, right? It's about connection.\n\nInstead of becoming more and more isolated, we become more and more connected as we realize emptiness. Actually, realizing emptiness with bodhicitta brings us into deeper and deeper connection with all living beings. And so it's just a chance to ask ourselves, how much do we feel connected to others, and how much are we pushed towards connecting to others with a good intention?\n\nNot out of attachment, but with a good intention. One of the difficult things about our COVID time and just digital era, is that it's very easy to be disconnected because you can be really satiated just through digital devices alone in an apartment somewhere. It's very easy to stay kind of happy enough doing that.\n\nBut it creates incredible disconnection, and it can create a little bit of an attachment to privacy, an attachment to solitude that is actually undermining our bodhicitta. Like this word outreach is like a good word to ponder. That's like the bodhicitta mind.\n\nBodhisattva mind. Outreach. Reaching out to others.\n\nIt's about others, right? Others, others, others. Not out of attachment, not because we're trying to escape our loneliness, but because we have an urge to benefit them.\n\nThat's just what our mission is in our life. It's outreach. So this is something that we're going to keep probing as we go through this text, especially in these first couple chapters, is a little bit like what is our own attachment to our privacy, to our own isolation, if any, and how can we oppose it through really moving towards a mind of connection.\n\nIt doesn't need to literally be physically with people. You can be connected in your heart and by yourself. I'm not saying physically being with people, necessarily.\n\nBut we want to explore what is this tendency towards isolation in our own practice and in our own life. Do we conceptualize our practice as something that's isolated in some way, or alone in some way, or private in some way? And how can we kind of spur on this beautiful bodhicitta to mind, which is about reaching out, connecting to others, benefiting others.\n\nSo there's a lot more to say about this right now, but I want us to all think about this a little bit. And I have a very simple little challenge that I'd like us to do sometime in the next week, if possible. And it's very simple.\n\nYou grab a postcard or two from here. You need at least three postcards to do this practice. And you go to three places.\n\nPlace one is a place you think will happily accept your postcard from the meditation center. Like a little flyer or something. Place two is a place that you're not so sure will accept it happily.\n\nAnd place three is where you think they are not going to accept it. Okay? Like a random lawyer's office or something like that.\n\nAnd we oppose our fear and our nervousness and whatever else is going on in our mind. And we just practice. You just walk into all three places with a couple of little postcards.\n\nAnd you just say, hey, I'm from the meditation center. Do you have a place to put these cards for a meditation class? Like with a loving heart.\n\nAnd the experiment is just seeing what happens inwardly and outwardly. So like, looking at the mind while we do this. And if you notice, for example, I don't want to do this.\n\nJust really look at that. What's that about? Is that part of our intention of isolation?\n\nIs that part of it? Or, oh, I don't want to feel like a dummy. You know, whatever.\n\nWhat is that about? What is that kind of self-consciousness? Does a bodhisattva have self-consciousness?\n\nYou know, afraid of like having a slightly awkward interaction? The people in New York who work at these places get way more complicated and annoying people coming in all day. So we have nothing to worry about from the point of view of them being offended or something like that.\n\nThey have much more complicated and annoying situations happen all day. And often, they'll get like a blessing actually from meeting us. Anyway, I don't want to kind of spoil it further.\n\nBut the point is to do the practice. I know some of you who are online far away, you might not have access to a little postcard or something like that. So you might have to get you one somehow.\n\nOr next time you come here you can do the experiment. But those of us who are here, let's do it. And I'm not having us do this so that we can advertise the center.\n\nThat's not the point. That's a nice effect. The point is to actually look at our mind that wants to connect to others.\n\nAnd this is a very nice, easy way to do it. And it's about like learning about ourself while we do this. Okay, so that's my encouragement for all of us.\n\nAs a way to connect. Yeah, you can go to a Jewish place. That's great.\n\nI think it's fine. It's meditation. Meditation is for everyone.\n\nYeah. I mean if you really, really don't want to go there, it's okay. You can choose another place.\n\nYeah. I've definitely went to a place where there's people who are wearing some religious garb. Like really clear religious garb.\n\nLike a barber shop, for example. And said, hey, I've got a postcard for a meditation class. Yeah, man!\n\nNice! Meditation? Fantastic!\n\nAnd they're not of this tradition. They're not Buddhists. And they're even of maybe a faith that some people would view very conservative and closed off in certain ways.\n\nAwesome! Put it right there! Like that.\n\nI don't think we want to put anyone in a box. You know, based on what they look like. The Bodhisattva mindset, of course, we want to be flexible and we want to consider people's point of view.\n\nBut I'd be wary of putting anyone in a box to say like meditation is not for them. Meditation is just about overcoming delusions and increasing virtues. That's for everyone.\n\nYeah, that's for everyone. You don't have to be a Buddhist to want to overcome your anger, your fear, your selfishness. Everyone needs that.\n\nEveryone, everywhere. Yeah, so... Please, yeah.\n\nAnd then we'll wrap it up. Because I think it's six."
      },
      {
        "speaker": "Student",
        "time": "1:59:37",
        "text": "So it's basically a place that you think people will be open to it, a place where you think they may not be open to it, and a place where you perceive at least that they will not be open to it."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:59:47",
        "text": "Yeah, that's it. It doesn't mean that they're going to hate you, but just like a place where if you were walking around putting out some postcards where you would go, no way will they take that. That kind of place.\n\nSo, I think we'll be surprised. Okay, I think that's it for now. Next week we'll be back on a normal class.\n\nSo we looked at the benefits of bodhicitta. So maybe practice-wise that would be a good thing to do. Like start reflecting on them, maybe bring them into our succession practice.\n\nMaybe more like taking one a day. And then if you can, do this little experiment. It can take like three minutes, the experiment.\n\nIt's very simple. Go to three places, see what happens. See the mind that wants to connect to others or what wants to isolate and what that's about.\n\nAnd start learning about it. Okay, so I'll just guide a little brief dedication here. You can think of the virtues you've collected, practicing, listening, listening, discussing.\n\nMay all living beings find lasting peace of mind, enlightenment. You can make any personal dedications."
      }
    ],
    "mainTeaching": []
  },
  "session2": {
    "chantedPrayers": {
      "time": "N/A",
      "note": "Abridged class - single session"
    },
    "teaching": [],
    "conclusion": []
  }
}