{
  "classId": "2026-01-18",
  "date": "January 18, 2026",
  "session1": {
    "classIntro": [],
    "chantedPrayers": {
      "time": "3:06",
      "text": "LIBERATING PRAYER\n\nO Blessed One, Shakyamuni Buddha,\nPrecious treasury of compassion,\nBestower of supreme inner peace,\nYou, who love all beings without exception,\nAre the source of happiness and goodness;\nAnd you guide us to the liberating path.\n\nYour body is a wishfulfilling jewel,\nYour speech is supreme, purifying nectar,\nAnd your mind is refuge for all living beings.\n\nWith folded hands I turn to you,\nSupreme unchanging friend,\nI request from the depths of my heart:\n\nPlease give me the light of your wisdom\nTo dispel the darkness of my mind\nAnd to heal my mental continuum.\n\nPlease nourish me with your goodness,\nThat I in turn may nourish all beings\nWith an unceasing banquet of delight.\n\nThrough your compassionate intention,\nYour blessings and virtuous deeds,\nAnd my strong wish to rely upon you,\nMay all suffering quickly cease\nAnd all happiness and joy be fulfilled;\nAnd may holy Dharma flourish for evermore.\n\nGOING FOR REFUGE\n\nI and all sentient beings, until we achieve enlightenment,\nGo for refuge to Buddha, Dharma and Sangha. (3x)\n\nGENERATING BODHICHITTA\n\nThrough the virtues I collect by giving and other perfections,\nMay I become a Buddha for the benefit of all. (3x)\n\nGENERATING THE FOUR IMMEASURABLES\n\nMay everyone be happy,\nMay everyone be free from misery,\nMay no one ever be separated from their happiness,\nMay everyone have equanimity, free from hatred and attachment.\n\nVISUALIZING THE FIELD FOR ACCUMULATING MERIT\n\nIn the space before me is the living Buddha Shakyamuni surrounded by all the Buddhas and Bodhisattvas, like the full moon surrounded by stars.\n\nPRAYER OF SEVEN LIMBS\n\nWith my body, speech and mind, humbly I prostrate,\nAnd make offerings both set out and imagined.\nI confess my wrong deeds from all time,\nAnd rejoice in the virtues of all.\nPlease stay until samsara ceases,\nAnd turn the Wheel of Dharma for us.\nI dedicate all virtues to great enlightenment.\n\nOFFERING THE MANDALA\n\nThe ground sprinkled with perfume and spread with flowers,\nThe Great Mountain, four lands, sun and moon,\nSeen as a Buddha Land and offered thus,\nMay all beings enjoy such Pure Lands.\n\nI offer without any sense of loss\nThe objects that give rise to my attachment, hatred and confusion,\nMy friends, enemies and strangers, our bodies and enjoyments;\nPlease accept these and bless me to be released directly from the three poisons.\n\nIDAM GURU RATNA MANDALAKAM NIRYATAYAMI\n\nPRAYER OF THE STAGES OF THE PATH\n\nThe path begins with strong reliance\nOn my kind Teacher, source of all good;\nO Bless me with this understanding\nTo follow him with great devotion.\n\nThis human life with all its freedoms,\nExtremely rare, with so much meaning;\nO Bless me with this understanding\nAll day and night to seize its essence.\n\nMy body, like a water bubble,\nDecays and dies so very quickly;\nAfter death come results of karma,\nJust like the shadow of a body.\n\nWith this firm knowledge and remembrance\nBless me to be extremely cautious,\nAlways avoiding harmful actions\nAnd gathering abundant virtue.\n\nSamsara's pleasures are deceptive,\nGive no contentment, only torment;\nSo please bless me to strive sincerely\nTo gain the bliss of perfect freedom.\n\nO Bless me so that from this pure thought\nCome mindfulness and greatest caution,\nTo keep as my essential practice\nThe doctrine's root, the Pratimoksha.\n\nJust like myself all my kind mothers\nAre drowning in samsara's ocean;\nO So that I may soon release them,\nBless me to train in bodhichitta.\n\nBut I cannot become a Buddha\nBy this alone without three ethics;\nSo bless me with the strength to practice\nThe Bodhisattva's ordination.\n\nBy pacifying my distractions\nAnd analyzing perfect meanings,\nBless me to quickly gain the union\nOf special insight and quiescence.\n\nWhen I become a pure container\nThrough common paths, bless me to enter\nThe essence practice of good fortune,\nThe supreme vehicle, Vajrayana.\n\nThe two attainments both depend on\nMy sacred vows and my commitments;\nBless me to understand this clearly\nAnd keep them at the cost of my life.\n\nBy constant practice in four sessions,\nThe way explained by holy Teachers,\nO Bless me to gain both the stages,\nWhich are the essence of the Tantras.\n\nMay those who guide me on the good path,\nAnd my companions all have long lives;\nBless me to pacify completely\nAll obstacles, outer and inner.\n\nMay I always find perfect Teachers,\nAnd take delight in holy Dharma,\nAccomplish all grounds and paths swiftly,\nAnd gain the state of Vajradhara.\n\nRECEIVING BLESSINGS AND PURIFYING\n\nFrom the hearts of all the holy beings, streams of light and nectar flow down, granting blessings and purifying."
    },
    "guidedMeditation": [
      {
        "speaker": "Kadam Kyle",
        "time": "15:42",
        "text": "Meditation on all living beings, being our mother. First we reflect, if our mind is formless and is not produced from the body, so it does not die when the body dies. Therefore it is beginningless and endless, a formless continuum.\n\nBecause the mind is formless and is not produced from the body, which is form, therefore it does not die when the body dies. Therefore it is beginningless and endless, a formless continuum. Just reflect on this for a little while, trying to get a sense of this formless continuum of our root mind.\n\nWhen we get distracted, turn back to reflecting on this. If our mind is formless, it is not produced from the body, and does not die when the body dies. It is beginningless and endless.\n\nBecause our mind is beginningless and endless, we are like a traveler, coming from countless past lives and going to countless future lives. Just imagine or feel what it is like to really see yourself as like a traveler, coming from countless past lives and going into countless future lives, just passing through this world. Just really imagine or feel what it is like to just be in one life, with thousands, millions, countless lives, just passing through this one life.\n\nAnd finally we can think, since I've had countless lives, I've had countless mothers, where are all these beings now? Where are all the people around me? I just can't recognize them.\n\nLike someone with a profound amnesia. Just feel what this is like. I'm surrounded by all these mothers.\n\nI just can't recognize them. And enjoy any sense of love that arises. And in our own time, we can gradually arise from our practice."
      }
    ],
    "postMeditation": [
      {
        "speaker": "Kadam Kyle",
        "time": "35:51",
        "text": "Okay, welcome back everyone. Thanks for coming. Yeah, so we'll begin with reading the Guide to the Bodhisattva's Way of Life, a few of the verses.\n\nDoes anyone want to be the lucky duck reader today? Yes, thank you very much. So it's verses 15 to 25.\n\nYou need some light."
      }
    ],
    "shantidevaReading": [
      {
        "speaker": "Anne",
        "time": "36:47",
        "text": "(15) In brief, you should know\nThat bodhichitta has two types:\nThe mind that observes enlightenment and aspires,\nAnd the mind that observes enlightenment and engages.\n\n(16) Just as the distinction between wishing to go\nAnd actually going is understood,\nSo, respectively, the wise should understand\nThe difference between these two bodhichittas.\n\n(17) From the mind that aspires to enlightenment,\nGreat effects arise while in samsara;\nBut an uninterrupted flow of good fortune does not ensue\nAs it does from the engaging mind.\n\n(18) For whoever takes up the engaging mind of bodhichitta\nWith the intention never to turn back\nFrom completely liberating\nThe infinite living beings throughout all realms,\n\n(19) From that time forth, for him there will arise —\nEven if he is asleep or apparently unconcerned —\nVast and powerful merit, equal to space,\nThat flows without interruption.\n\n(20) For the sake of those with lesser inclinations,\nThese benefits were explained with logical reasons\nBy the Tathagata himself\nIn Sutra Requested by Subahu.\n\n(21) If even the thought to relieve\nThe headaches of others\nIs a beneficial intention\nThat results in infinite merit,\n\n(22) What can be said of the wish\nTo dispel the immeasurable misery\nOf each and every living being\nAnd lead them all to countless good qualities?\n\n(23) Does our father or mother\nHave such a beneficial intention as this?\nDo the gods or the sages?\nDoes even Brahma himself?\n\n(24) If, before generating bodhichitta, these living beings\nDo not even dream of such a mind\nFor their own sakes,\nHow will they develop it for the sake of others?\n\n(25) This mind to benefit living beings,\nWhich does not arise in others even for their own sakes,\nIs an extraordinary jewel of a mind,\nWhose birth is an unprecedented wonder."
      }
    ],
    "practiceReports": [
      {
        "speaker": "Fran",
        "time": "40:31",
        "text": "I've been thinking about being a traveler in this life onto many other lives. And I've heard that before and I always liked it. I always felt very comforted and almost empowered by the idea of impermanence.\n\nBut I realized that in the past I thought about it as using it more. Well, don't get upset about that because you're just passing through here. It doesn't really matter.\n\nAnd now with the mind of bodhicitta applied to it, everything matters. It's not that it doesn't matter. It's that I have to learn how to use it.\n\nI can't just talk myself down from being anxious about something by saying, oh, you're just passing through. Tomorrow that won't matter. Next life it won't matter.\n\nBut it does in order for me to get where I want to be in the next life. Everything has to be with that mind of bodhicitta. I'm drawn to in Joyful Path.\n\nThe first benefit of bodhicitta is that we enter the Mahayana path. And before reading that, I was like, well, I'm a Mahayana Buddhist. So, of course, I'm on the Mahayana path.\n\nBut without that mind of bodhicitta, I'm not really there. So if I want my next life to continue on the Mahayana path, I need to work on that now more sincerely."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "41:58",
        "text": "That's great, Fran. Yeah, it makes sense. Thank you very much.\n\nOthers, please? Oh, Dale, yes."
      },
      {
        "speaker": "Dale",
        "time": "42:08",
        "text": "Hi. Something happened this week that was very surprising to me in a good way. I've been living in this building for 30 years.\n\nAnd my husband was in the building 20 years before that. And there was a woman that they socialized. She had a husband at the time, et cetera.\n\nBut when I moved into the building, I didn't know a lot of people on the west side. And Stan said, why don't you befriend that neighbor, that woman? So I went into her apartment.\n\nGod, I remember this like it was yesterday. And having a conversation and then saying something like, after a while, you know, maybe we can be friends. I'd like to be friends.\n\nAnd I remember her saying to me, I have enough friends. I don't need any more friends. Swear to God.\n\nSwear. Okay? And I didn't know what to say to that.\n\nI just went, okay. And I left. And to say I disliked the woman after that is putting it mildly.\n\nI think hate comes into it more than dislike. I avoided her. I mean, she's on my floor.\n\nSo, you know, not that either. But anyway, so in the interim, a lot has happened to her. I mean, a lot has happened to me.\n\nShe lost her boyfriend. She was married for 15 years. Her husband died of cancer.\n\nShe lost her dog. Whatever. Anyway, this past week, I come up in the elevator with her.\n\nAnd she had been mentioning previously a place that you could go have a drink. I really don't do that anymore. Go out for a drink.\n\nBut anyway. And I was saying, you know, I've got plans. And I did.\n\nI had plans that particular night. And she said, oh, you're busy. And I said, well, I've tried to build a life.\n\nAnd I said, you can build a life too. Because she's alone now. And I just looked at her.\n\nAnd suddenly, I just had the desire to hug her. Which I did. Now, this is shocking to me.\n\nBecause this is a woman. I mean, I really disliked her. She's a diva.\n\nAnd, you know, in my mind, that's the way she was. And I felt, wow. I said, that was such a surprise to me.\n\nAnd I felt that was Buddha. I felt that was Buddha coming out in me to just spontaneously hug her. So I felt really good about that story.\n\nWhat happened. Yes."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "44:44",
        "text": "Thank you, Dale. Yeah, it was beautiful. Right?\n\nIt's just a great teaching. And every time that happens, we can kind of prove to ourselves, oh, wow, I can shift how I view anyone. Right?\n\nThis person was like an arch enemy. And now she's someone you kind of compassionately, tenderly hugged, you know, when she was in a time of need. That's amazing.\n\nYeah. So thank you very much for sharing that. It's like the Buddha is working through us and benefiting others.\n\nThank you. Others? Please?\n\nDavid? Yes."
      },
      {
        "speaker": "David",
        "time": "45:20",
        "text": "I enjoyed thinking of myself as a traveler bound for future lives, thinking about future lives. And I noticed a couple of different outputs of that meditation or contemplation. One was I definitely did have this sort of like sort of mixed fear, maybe a little bit of wisdom fear, but maybe a little bit of self grasping fear.\n\nLike when I think about sort of like the moment after my death, you know, like Bardo or taking the next rebirth. And I'm just like, wow, like just seems like a lottery of just like cosmic proportions. And I noticed just a little bit of sort of doubt or discouragement in my mind about like how much I can do to kind of like protect myself.\n\nLike a little bit, a little bit of fear there. But I also noticed when I did that and I thought about all the different lives and sort of taking a broader view that similar to what Fran was saying, how she used to think about it a little bit differently. I used to sort of picture myself sort of like going through these things like different sort of like embodying different creatures or things like that, like with my own sort of human mind.\n\nAnd it struck me that actually my human mind is going to be completely gone and sort of that's going to completely dissolve and a new mind really is going to generate. I know like sort of our very subtle mind sort of travels from one to another, but sort of like most everything that I think of as myself currently will be completely obliterated, will never come back again. And so that was actually really helpful in sort of eroding some self self-cherishing, self-grasping, like it's just everything that I'm worried about and concerned about.\n\nAnd like none of that is happening at all ever again. So don't need to worry about it at all. And turns out that's 99% of my energy is all these things that just will never, never sort of come to pass again, all these sort of preferences and interests and all these different things.\n\nAnd then one other thought, I'm curious your thoughts about this, but yesterday I was talking after class with a woman and she said that she's really been working on being present and thinking about that. All you have is the current present moment. And I actually got this pretty crazy blessing when she said that.\n\nAnd I was like, wow, you're right. Like this is just the present moment and something happened. And I was like, I just looked around and I was like, this is all there is.\n\nAnd I was reminded of something you said, sort of like thinking about like a two by two grid. It's like you can think that this is all there is with wisdom or that this is all there is without wisdom and then maybe go into like hedonism or something like that. And then same thing when you think about that, actually we're just traveler bound for countless future lives.\n\nYou could do that probably with or without wisdom. So I was curious your thoughts about sort of like just that duality of like the present moment in some sense that is all that all we ever have. And that I feel like can bring some of the same benefits as thinking about all our countless future lives."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "48:36",
        "text": "Yeah. Yeah. Thanks, David.\n\nYeah. So you're kind of pointing out there's a lot of outputs that come from the meditation and that's exactly right. Like the one meditation has a bounty of effects.\n\nWith respect to that present minded attitude, yeah, Buddha teaches actually that all things, all functioning things are necessarily present. So philosophically it's completely correct. It's also correct to say there are countless future lives.\n\nIt's just when we get to them it's the present. So they don't exist. It's not like a line like this and we're like here and they're just like future or something like that.\n\nSo it's just we're here and then we're just kind of continuing into those lives. Yeah. So they're both complementary kind of ideas.\n\nYeah. I think it's a nice thing to ponder. Yeah.\n\nThank you. Others, please. Adriana.\n\nHi."
      },
      {
        "speaker": "Adriana",
        "time": "50:10",
        "text": "Okay. So I tracked my mind this week by making a game of meat versus light. And I had these little steaks and I had these little hearts.\n\nSo more steaks meant that I'm more concerned with my present meat body. And the hearts meant that I was working towards future lives. And I made a, I reflected at the end of the day because I couldn't really carry around.\n\nIt wasn't like not practical to do it throughout the day. Be weird. I think a bunch of little steaks at my desk in my office, but at the end of the day I reflected and, but it was nice because it helped me build awareness throughout the day of checking.\n\nLike I think it's really helpful to have a very simple rubric or heuristic where it's like, is it meat or is it light? Is it meat? It's like, it's like very clear.\n\nIt's it's easier. It was easier for me to be honest with myself or just have more like recognizing practice. What was interesting is that I thought that I was like, oh yeah.\n\nAnd I'm like, oh, these hearts are gonna run out of hearts. And cause I had more steak pieces and I really, it was really pretty steak and meat, steak and heart, steak and heart. And there was only one day where there were like two hearts.\n\nBut what I learned is that like the thoughts that keep me in samsara are like very little, there's like a million of them. Right. And then the thoughts about preparing for future life is usually like, it's like a really juicy, big, great thought and it's feels so much more powerful than the steak thoughts.\n\nSo even if it's like a, even if it's for like a few moments, it's like that counts. That feels like 50% of my mind, you know? And the other thing that I learned is that I thought that the hearts were going to be things that like I did, like, oh, I was like generous or loving.\n\nBut a lot of them were from restraint. Like, you know what? I'm not gonna say that piece of gossip.\n\nOr like this person who lives in my house with me, no names, was like really grumpy and like, you know what? I'm just gonna let that go. And like dedicated to future Adriana.\n\nSo it was like, it like the, what I learned is that what felt like the more powerful, the actions were the ones that I didn't do. So that was really fun. And I'm going to keep going for like two more weeks."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "52:40",
        "text": "Thanks, Adriana. Yeah. So it's basically a version of Geshe Bengun Gyal's practice of the black stones and white stones, but with little steaks and hearts.\n\nAnd yeah, just agree. I love this practice personally. I've gained so much from it.\n\nAnd it sounds like you're gaining a lot from it too. Just the kind of self knowledge that comes is amazing. Yeah.\n\nAnd just briefly your point about restraint. Yeah. So there's a type of moral discipline called the moral discipline of restraint.\n\nAnd if we hold back from an action due to a spiritual view, that's a virtuous action. And it's really helpful to notice those actions and to rejoice in them. Like, so there's virtuous actions where we overtly do something helpful for someone, but there's a lot of virtuous actions at first that are just restraint based, stopping negativity instead of engaging in overt positivity.\n\nBut stopping negativity is a positive action. So it's important to notice these and to really rejoice in them because we didn't need to restrain ourself. And there's probably times in our life where we didn't restrain ourself.\n\nSo we can notice it and really celebrate it. And yeah, it only works if we restrain due to a spiritual view. So like a little kid who can't talk restrains from gossiping, not because they have a good intention, but because they don't know about it and can't talk.\n\nRight. So that's not virtuous. It's not.\n\nIt's just neutral. Right. Them not gossiping.\n\nBut in your case, right, like you've not given it to the person who's in a bad mood. It's coming from a spiritual view, spiritual point of view. Like I don't want to create negative karma or I want to cherish this person or whatever the reason was.\n\nSo therefore it's something to really rejoice in. So we should always celebrate our virtuous restraint. Yeah.\n\nThanks Adriana. Anyone else have anything they'd like to throw out there? Offer?\n\nRegurgitate? Okay. Nope.\n\nOkay, good. So then let's see. Okay."
      }
    ],
    "postReading": [
      {
        "speaker": "Kadam Kyle",
        "time": "39:19",
        "text": "Thank you very much, Anne. Appreciate you being the reader extraordinaire.\n\nOh yeah, page 8 and 9. I should have told you all before that. Apologies.\n\nOkay, very good. So we were continuing on both equanimity and all living beings as mother. We're exploring how to have a traveler mindset, feeling like a traveler bound for future lives.\n\nWe're also just kind of having this long-term view, viewing our very subtle mind as something that goes endlessly into the future. So instead of being so pressurized about the here and the now, and instead just having this wonderful long-term view of our life, countless lives. And then yeah, just exploring our love and trying to have a more like warm and close, friendly, affectionate feeling towards people.\n\nOkay. So that was the gist of last week. Anyone have anything to report? Any data from the field? Fran, yes, please."
      }
    ],
    "mainTeaching": [
      {
        "speaker": "Kadam Kyle",
        "time": "55:11",
        "text": "So we're going to be continuing on these pages with respect to developing our love. But I want us to kind of have a focus. So we've been kind of emphasizing the six times a day practice, like pausing six times a day.\n\nAnd we can kind of keep that up if we'd like. We've been doing that for a couple months now. But one thing I think that would be really important to kind of emphasize if possible is like really what is it like to be guided by a mind of love or bodhicitta.\n\nOkay. So I know we're going to say more about this, but we could ask ourselves like in a day how often do we make a decision or take an action with an overt like intense love guiding us or like a bodhicitta mind guiding us. So I'm not talking about just sort of verbally doing it.\n\nLike may this action be of the greatest benefit to others. That's great and that does matter. And that's way better than doing that than not, than just acting autonomously or like automatically.\n\nBut here talking about like what does it really mean to be kind of guided by a mind of love or cherishing others or bodhicitta to do an action. Like I think Dale's story earlier is a perfect encapsulation of this. Like it's almost a sense that you're being like possessed by something that's forcing you to do something.\n\nThat's kind of how you described it, right? It's like Buddha was like guiding you to hug them. Sometimes out of compassion we have this.\n\nLike if we see, if we're walking down the street, right, and there's a parent holding like one kid. And then, you know, hands full. And then like another, one of the little toddlers or rugrats or whatever like falls over.\n\nAnd if you're like a parent or whatever, you just have this open heart, you might just like run to them and like, oh, let me help you, right? Or if they drop something, you just like, you can't help but just like run over and help them pick up, you know, the stuff there. It's just like there's something guiding you, right?\n\nThat's not a conceptual, like a heady thing. It's not an intellectual thing. It's like almost as if we're being compelled to act.\n\nSo ultimately this is what it means about really changing our intention. It doesn't just mean verbalizing mentally a good intention. It means having something that's overt and powerful, compelling us into certain behaviors and actions.\n\nBut what's compelling us is a virtuous mind, in this case the mind of love or bodhicitta. I'm just going to say the word love, but just think of it like a continuum, like love here, bodhicitta here, as like the supreme good heart. But like one of those good-hearted intentions.\n\nActually, I'll say bodhicitta. It's more auspicious, but you can think of it just like a basic love all the way up to universal compassion and then bodhicitta, but whatever it is. So a lot of times in our life, right, we're trying to solve the problems of our life.\n\nShould I stay? Should I go? Should I see this person?\n\nShould I not? Should I tell them off? Should I not tell them off?\n\nShould I bite my tongue? Our life can get really bogged down in all this decision-making. Essentially what we're often trying to do, and the reason we get confused, is because we're coming from a self-grasping mind, which is incredibly deluded.\n\nIt's attached to what it wants. It maybe is averse towards what it doesn't want, or the person that we're dealing with. In those situations, we are not making that decision.\n\nWe're guided by delusion. We think, I'm making that decision, but we're actually being guided by our delusion. If we're not overtly in a virtuous mind.\n\nSo that's why it's so confusing, right? Because we're like, I know I should do this, but I can't help but do that. Or, I just don't know the way forward in this situation.\n\nIt just feels so confusing and muddled. And it's just because delusion always makes things confusing and muddled. And because it's going against our heart.\n\nThere's something that feels wrong when it's guiding us. So the question is, what would it be like to 100% stop trying to figure out what's going on in the way forward, and instead put all of our energy into getting a mind of bodhicitta going, and loving heart going. And then just letting that make the decision.\n\nSo this is what I want us to really be kind of working on. And I'm going to work on it, and I'm going to try to do better myself. And I hope we can all work on it, and try to do better with this.\n\nIt's actually not an easy thing to really do this, because we're breaking down our self-cherishing mind, our self-grasping mind, and our anger, and our attachment. These are deeply ingrained problems in our mind. So it's actually not an easy thing to really put the delusions completely down, and let bodhicitta guide us.\n\nBut if we can do this, we're going to start seeing a cessation of certain problems that we have in our life. So for example, if we have a problem of overthinking things, and overanalyzing things, this solves that problem completely. Because the love just makes the decision, and you just act wholeheartedly, inspired and peacefully.\n\nAgain, it's like it's compelling you to an action. The only reason we're overthinking is because we're stuck and mired in delusion, and like a bog of delusions. And often the options that the delusions are creating are awful options.\n\nSo it solves like an overthinking. It guides us naturally to the right choice. It also helps us get motivated, but not in an anxious way.\n\nSo for a lot of us, we're either apathetic and don't care, or we're active and engaged, but out of our anxiety or fear. This is very complicated for people, right? How do I motivate myself, but not from a contaminated motivation?\n\nHow do I charge myself up, but not coming from a delusion? Because yeah, you can charge yourself up from delusion, definitely. So if we start doing this, we find almost a limitless source of energy, but it's coming from a very different place.\n\nIt's coming from our love. So if you're an overthinker, this will solve the problem. If you're a little bit lazy, and you don't know how to motivate yourself, this will solve the problem.\n\nIf you're an anxiety-motivated person, like you're driven, but it's because you have this crippling anxiety that drives you and pushes you, this will solve the problem. If we take ourselves a bit too seriously, and say this is going to solve the problem, like we're too heavy, and everything is so grave for us in our life, this is going to solve the problem. All that gravity and intensity comes from self-grasping and self-cherishing.\n\nWhen we're guided by love, we're just light, like light as a fairy, just floating about. Just because we're not driven by this egocentric mind. So if we find that we have this issue of just being way too intense, especially with ourselves, or taking everything so seriously, and taking ourselves so seriously, this is going to solve the problem.\n\nEven if as simple as simple things, well, not simple things always, but just kind of day-to-day skills, like standing up for ourself, or having clear boundaries in our life with ourselves and others in different situations, or prioritizing things, all these things get kind of neatly solved, actually, if we really let our love guide us. If we're trying to figure it out from the point of view of ourself that we normally see, driven by our delusions, all these things get really screwed up. So practically, how to make this really focused?\n\nWhat would be nice is if each one of us can come up with one of those specific problems that we want to solve. It's kind of like what David was saying earlier, meditation on feeling like a traveler bound for future lives has a multifaceted benefit, many different benefits, like a sasami knife, right? It solves a bunch of different problems.\n\nActually, all the Lam Rim meditations are like this. That's why they're highlighted, because they do ten different things in one meditation. Something like breathing meditation is actually quite small in comparison.\n\nSo the point is to take what's a personal skill we really want to work on and improve, like an emotional skill or a dharma skill that we can work on through letting ourself be guided by love, like really seeing what it's like to hand the reins over 100% to love and letting it decide what we're going to do next. So maybe we can think about this each a little bit. What's the target that we want to work through?\n\nIs it overwhelm? Is it taking ourselves too seriously? Is it overthinking?\n\nIs it whatever in our life? What's our kind of target spot that we want to aim for and work on? The last thing about this, and I'll take any questions or thoughts before we kind of mosey much further, is one interesting way to figure out what your target is is to think like when you got into Buddhism, like there was some good intention, but there was also some kind of maladaptive problem that maybe even got us into practice in some way.\n\nI'll explain my example from my life in a second. But because our mind is pervaded by delusions, we don't just get into dharma for completely pure reasons. There's often other motives that are there.\n\nThere's often challenges, so it could just be a challenge that was inside. But there could even be other motives that might still be kind of contaminating the practice. So for me, it took me a long time in my practice to realize, oh, there's this contaminated motive to want to feel special.\n\nAnd I've had that since I was just a little kid. I don't know if it's a youngest child thing, needing to stand out in some way. But I could see the pattern throughout my whole life, just doing little, odd, quirky things.\n\nIt's just driven by a very basic interest to want to feel special, to just be different or whatever. So it's helpful then for me to look at my practice and say, hmm, where is this coming from? And how does that manifest in my own practice?\n\nHow much do I practice the dharma because I want to seem special in some way, or be regarded as special in some way? And how much does that maybe get in the way of my practice, or having a more holistic way of practicing? For example, like, oh, if I want to benefit someone, hmm, how much is it about wanting to seem a bit special, as a really specially nice person?\n\nOh, yeah. Am I doing it truly because I want to benefit them, or is it there's a slight interest in seeming special? So that's something for me that's very helpful to look at, right?\n\nAnd to think, okay, it's just about some kind of insecurity, right? And some kind of self-cherishing prideful mind, like wanting to be better than other people, right? It was a horrible kind of mind.\n\nOkay, I can then use my love, right, to oppose that, to kind of break it down, mostly because love will elevate everyone else. And then find a joy in not being special, and seeing everyone else as special. Something like that.\n\nSo for other people, it could be like a kind of contaminated reason for getting into the Dharma. It could just be like an inability to accept some pain in their life. And they just weren't able to accept that pain, so they were just chasing something to help them put their mind somewhere else.\n\nNot in a healthy way, like the Dharma way is acknowledging the pain, seeing where it comes from, and doing it. But there's an escapist version of this, right? Like, I just can't bear to look at the pain in my life, so I'm just going to escape to some fantasy world, right?\n\nIt's like, I forget how the meme goes, but it's something like, not to point out Elon Musk or something, but it's like, men would rather try to go to Mars than go to therapy. I think that's the meme, yeah. And I'm not saying go to therapy, but I'm saying that's sort of the wisdom in the little meme, right?\n\nIt's like, what things do we do in our life as some maybe escape, and maybe big complicated things that we do, as an escape for something that we just never were able to deal with. And maybe our whole Dharma practice has been an edifice, you know, to kind of cover that up. Who knows, right?\n\nI'm just trying to give examples, right? Or maybe it was just like we were just frankly lonely, and we just wanted companionship and friendship, and we just felt lonely in our life. And that, like, we met a wonderful sangha, a bunch of nice people who accepted us, right?\n\nAnd we were just driven by a wish for companionship, actually. And we put up with the Dharma. Just to like, you know, we're willing to deal with an hour of a class so we could have some companionship from some nice people to help us deal with our loneliness that we haven't figured out how to deal with.\n\nOkay, enough examples. This is just something like, it's a way to kind of like figure out, like, are there still these like funny contaminations in our practice? I'm just belaboring the point, because I think we can go decades of a Dharma practice still guided by some of these, if we're not aware of what's going on.\n\nAnd it's like it always kind of makes the whole practice off in some way. And so what we're trying to do here is like really see what's it like to move from one of those to just 100% guided by love. Okay, does anyone have any thoughts or questions about this point before we mosey?\n\nYes, Anne, thanks."
      },
      {
        "speaker": "Anne",
        "time": "1:16:36",
        "text": "Could you clarify a little more about not just how to choose a target, but what the target is? You gave some examples of overwhelm or overthinking. So the target isn't going to be a situation, or could it be a situation?\n\nIt's more a tendency that we have, a mental habit that causes us suffering."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:17:00",
        "text": "Yeah, the target is like, it's like thinking of it as like a little project, right? Okay, I'm going to work on my tendency or my habit of overwhelm or work on my tendency or habit of overthinking or my inability just to make decisions in life or I want to work on my kind of just underlying anxiety that I have or my just being too intense with myself or others. So it's like just choosing sort of like a theme of some sort to especially work on.\n\nThe point being that when we have a Dharma practice, if we just practice it in general, it's very easy for it to not like take a root in our mind. But if we have a specific kind of objective to work on, it just gives it focus and direction. It still will manifest in other situations.\n\nIt's just much more effective to like give it a focus, like do this. And like if we direct our love towards this like little project, little focus, then it would just be a bit more grounded and not abstract. I don't know, does that make sense, Anne?"
      },
      {
        "speaker": "Anne",
        "time": "1:18:32",
        "text": "I guess I'm wondering why we would pick a mental habit rather than a situation."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:18:39",
        "text": "Can you give me an example of a situation?"
      },
      {
        "speaker": "Anne",
        "time": "1:18:41",
        "text": "Well, let's say it seems easier to apply Dharma to like a specific example. Like if you were anxious, it would be like maybe anxiety about work. Or if you, I don't know, but just like if you were a person who was anxious all the time, there really wouldn't be a focus."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:19:09",
        "text": "Yeah, yeah."
      },
      {
        "speaker": "Anne",
        "time": "1:19:09",
        "text": "You know what I mean?"
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:19:10",
        "text": "Yeah, yeah. Oh, I get what you're saying. Yeah, that's still a mental habit.\n\nThat's just targeting it even further. So yeah, that's great. Like anxiety about money, anxiety about work, anxiety about relationships, whatever.\n\nIf that helps clarify it a little bit, that's great. It's just nice for it to be just all-encompassing enough. So like if it's truly like for someone, it might be like, it's just like truly anxiety about like money and security.\n\nAnd like there's just something deep down in there about like being secure, which is what money, obsession is all about, security, right? Somehow I'm making myself safe with a fortress of cash, which doesn't make us safe at all. So nothing to do with being safe.\n\nBut we feel that way, right? And so it's like, okay, great, make that your focus. Like, okay, it's anxiety around feeling secure through looking through resources mostly.\n\nWe don't want to get so hyper-specialized though where it's actually not speaking to the theme as a whole. Like anxiety about going to the grocery store and the line that's there. It's like, yeah, but there's something a little bit more precise there.\n\nThere's something about like a time anxiety there, right? And this sort of strange need for efficiency and getting everything done correctly. There's something more precise there that's really going on, right?\n\nSo I'm just trying to make maybe just to make this even more clear. It's just like we just want to make sure we hit the right target. Yeah, yeah.\n\nAnd too specific, yeah, might be missing something. But you're right, like too vague might not be getting to the root of what's going on. Yeah, Mimi and then Fran."
      },
      {
        "speaker": "Mimi",
        "time": "1:21:39",
        "text": "So Kadam, when we're doing this, it seems like we're almost looking at our shadow, right? Our shadow self or those parts of us that may be a little bit tender. And so we're kind of like coaxing it out, right?\n\nVery gently to take a look at it because it is contaminated, right? At some level it is contaminating our practice. But it's almost like you have to, while you're doing that, you also simultaneously have to know that you have this Buddha nature, right?\n\nSo even if you're seeing these aspects of maybe what drew you to the Dharma in the beginning or like your insecurities or whatever, or your yearnings or whatever. Yeah, not to get overwhelmed by that, right? Like to me, it's like I'm going to do it.\n\nI'm going to like take a look and kind of like investigate some of these like shadowy parts of myself. But then just say, okay, but Geshe-la is with me. So I'm just going to like rely on Geshe-la.\n\nLike I just know that his love and his peace is like protecting me. Like I'm going to be okay. Does that make sense?\n\nI don't know."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:23:14",
        "text": "Yeah, yeah. I think what you're talking about is the sort of emotional difficulty that can come from looking at some of these things in our mind and some of these motives and drives. And yeah, this is where we really need like a clear Buddhist view that they're not us.\n\nThis is where Buddhism is like quite different from like modern psychology or something, right? Where modern psychology people would say like that's just like, that's like almost like your psychological DNA. It's just like kind of who you are, is you're someone who's driven by this thing.\n\nBuddhist view is that's not true at all. It's just a pattern. It's just like a karmic pattern in your mind, like a storm blowing through.\n\nIt's just a storm that happens to blow through a lot for us. So it's just like we have to have this kind of radical non-identification with it. Just like you don't identify with the storms that go by in the sky, but you can be aware of like a weather pattern.\n\nSo too, we want to like radically not identify with these patterns of the mind while still seeing them. Because if we identify with them, the whole thing feels awful. It just feels like we're discovering this inalienable, wretched part of us, which is just a terrible feeling.\n\nThere's this wretched, evil thing that's part of who I am. It's just like, how do you work with something like that, truly, if it's just who you are? How do you become a Buddha if that's just who you are?\n\nThat way of thinking is really damaging for people to say like, you are inherently... It's very damaging. Because you can't actually free yourself.\n\nThat's who you are. All this way of thinking is like the idea of a soul, or like an inherent personality or persona, which is not Buddhist view. Those are particularly Western ways of thinking that we've all adopted.\n\nEven though they came from religion, they've fixed themselves into all sorts of thinking and fields of knowledge, this kind of essentialism. It's probably the best way to say it. I'm just trying to say, Mimi, your point is exactly right.\n\nWe do have to be really careful and gentle with ourselves, and incredibly honest, but incredibly gentle. But this is contingent on being able to not identify with those things. If we identify with them, then we've basically lost the battle.\n\nIf we see them more like patterns that pass through our mind that are not us, like weather patterns, then we can respond to them and learn how to work with them, but not be afraid of them. Does that make sense, Mimi?"
      },
      {
        "speaker": "Mimi",
        "time": "1:26:59",
        "text": "Absolutely. Very helpful. Thank you, Kunal."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:27:02",
        "text": "Cool. Thanks, Mimi. Appreciate it.\n\nFran?"
      },
      {
        "speaker": "Fran",
        "time": "1:27:07",
        "text": "I have no trouble finding a target. I have several of them. But actually, they're really all one when you take a look at it.\n\nI have, over the years, learned to use different Dharma tools to ameliorate them, but I don't quite understand how applying the mind of love and bodhicitta fits in there. My first reaction is, all right, just don't be so hard on yourself. But that's not the mind of love that I'm looking for at all.\n\nThat's self-cherishing. So I'm not quite sure where to put the mind of love in there."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:27:46",
        "text": "Yeah, exactly, Fran. This is exactly why we're doing this. It's a good point.\n\nAnd a lot of time when we're working with our mind, we kind of learn the tools, but what we're maybe not aware of is that who's actually running the show of working with our mind. It's often actually our self-cherishing. So it's like, yes, I will apply the opponent to deal with this.\n\nAs long as you don't threaten me. I'll do this dance with what's going on in the mind, but it's actually just... For example, if it's being hard on ourself, that's the problem.\n\nIt's like I'm going to use the Dharma to just simply not be hard on myself so that I can basically cherish myself more. I'm trying to protect myself from self-criticism, which is a delusion. Self-protection is self-cherishing.\n\nSo this is exactly the point, which is what does it really mean to be guided by a mind of love or cherishing others, bodhicitta? What does it really mean to hand over the reins completely and let that mind, that intention guide us? And when we do that, we won't be hard on ourself at all because there'll be almost no self-appearing to even cherish.\n\nActually, we're not even interested in the self when we're really guided by love because love is interested in others. It forgets the self. And it makes us feel so good inside that there's a healthy self-esteem that is a side effect."
      },
      {
        "speaker": "Fran",
        "time": "1:30:07",
        "text": "So is it that, I feel like this is wrong also, is it that if I can learn to not give in to this target that I will be able to benefit others better? That sounds like that's self-cherishing also, that it's still making me feel better about myself."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:30:34",
        "text": "No, you will be able to benefit others better, definitely. It's more like the mind of love is a naturally profoundly confident mind. So there's no basis anymore to not feel great about ourself or to be hard on ourself."
      },
      {
        "speaker": "Fran",
        "time": "1:30:55",
        "text": "So the spontaneity, is that the goal? Is that this becomes my natural way of thinking?"
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:31:03",
        "text": "Yeah, yeah. To really let the mind of cherishing others' love guide us. Yeah, anyway.\n\nI can tell this is a good idea. I think this is a very good idea, yeah. And round two, very exciting.\n\nI love a double dipper."
      },
      {
        "speaker": "Anne",
        "time": "1:31:31",
        "text": "I just want to say this is terrifying, right?"
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:31:35",
        "text": "Really? You can't figure it out. Can you say more about that?"
      },
      {
        "speaker": "Anne",
        "time": "1:31:38",
        "text": "Oh my goodness. I feel both super excited. I can't wait to try this out.\n\nEverything could just fall apart. That's what it feels like. One or the other."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:31:59",
        "text": "Yeah, yeah. I think maybe that would be an interesting thing to investigate. Like why would it feel that being driven by the self we normally see is keeping everything together, right?\n\nWhich is like, that's what it feels like, right?"
      },
      {
        "speaker": "Anne",
        "time": "1:32:18",
        "text": "Well, because I also know what it's keeping together. It's keeping this nightmare going, right?"
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:32:23",
        "text": "Yeah, it's just churning nightmare on."
      },
      {
        "speaker": "Anne",
        "time": "1:32:26",
        "text": "Yeah."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:32:28",
        "text": "Yeah. Natalie, did you have a hand? Yeah, yeah.\n\nYeah, one more and then we'll do a couple of concluding bits. Oh, and then Adriana."
      },
      {
        "speaker": "Natalie",
        "time": "1:32:39",
        "text": "My first class. Big topic. They're all big topics.\n\nIt's funny because it's obviously going to be no surprise. You guys know me well by now. It's going to be about anxiety about work.\n\nBut I did this practice last year when I had a really terrifying work trip coming up. And I knew it was going to be with very difficult people with a terrible schedule, no sleep. And I remember going in there.\n\nI'm like, you're a Dharma practitioner. You can do this. Think about your tools.\n\nAnd one was the mind of Bodhicitta. I'm like, just go in there. And the week is all about others because you know the problem is you're self-cherishing and you're self-grasping.\n\nSo every interaction you have, love other people, even the difficult ones. It's not about what you're going to accomplish during the week work-wise. It's about the interactions and just loving every person that you're going to meet for that week.\n\nAmazing week. Really came back. I was so happy.\n\nAnd then a week later, the misery kicked in again. And I feel like it's because I was playing a role. And for me, the challenge has always been moving from playing a role to actually believing and remembering every single day that I have the potential to be a Bodhicitta or to have that mind and to be a Bodhisattva.\n\nIs there anything? So if I do this again, I know I'll need a little complimentary practice to kind of like, how can I remind myself that I actually am already or have the potential to be on top of going into that project? Because I know otherwise I'm going to go back into that role that I'm playing, which is helpful to deal with difficult situation, but it's not the long game, right?"
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:34:40",
        "text": "Yeah. I mean, from one point of view, we're always just playing a role. So I wonder if you played that role like you were playing in Italy, if you just didn't stop playing the role, if one day you'd go, oh, this is like who I really am, it might be something to ponder.\n\nLike, why not just always play that role? If it went well and it was enjoyable, why not play it until the end of time? And then maybe one day it would be like, huh, I've played this role long enough.\n\nMaybe this is actually who I am. Yeah. And sometimes we just have to play it long enough to believe.\n\nAnd then, yeah. We'll look at some tools on how to kind of practically apply this. Yeah.\n\nAdriana, last one. Yeah."
      },
      {
        "speaker": "Adriana",
        "time": "1:35:43",
        "text": "Just going to say that I was thinking about this practice was not making sense to me. And I was thinking, well, it's not an intellectual practice. That's why I'm confused about it.\n\nSo I was thinking about, Geshe-la has this quote that love is the real nuclear bomb that destroys all problems, all self-cherishing, right? So you think about Geshe-la's mind, 100 percent purely motivated by love. And he did all kinds of complicated business, global business things, like overseeing a thousand centers.\n\nSo I think that is comforting to me. And I think Geshe-la would look at my mind and he would just be like, why are you working so hard? Just rely on love.\n\nLike it's going to be, I am hopeful that this is going to feel like a big relief. And otherwise, I'm just going to continue to be a maniac. But now Geshe-la is giving me a chance to just be like really cool.\n\nAnd I'm like, yes, I want to be cool. Right? I want to be cool."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:36:54",
        "text": "Yeah. That's your project, being extra cool. Yeah.\n\nYeah. Using him as an example is a really good one because he basically lived 24-7 in a light state, just blissed out, out of his mind, floating around everywhere, but just worked every hour of every day for the benefit of others. And a lot of his monk friends that he went to monastery with found a little ragtag group of people and then just hung out with them, like a handful of disciples, until they died.\n\nOr just like went and meditated somewhere and hung out until they died. But he just like churned forward like a machine, basically. Day in, day out.\n\nBut totally light and blissful. And just without any problems. And so it's like, yeah, that might be for some of us who are New Yorkers, you're trying to be motivated, industrious, get things done.\n\nIt's like, how can I have that mind that's energized but completely light, like completely blissful? And it's only by love that we can do that. Love is the only answer to something that gives us incredible fuel, but is also very blissful and relaxed.\n\nThere is no other answer. So it's like, yeah, using him as an example for something like that is really helpful. Like, okay, there's a living version of that that I've seen.\n\nAnd we can apply a lot of the other applications too. Like even just with anxiety and worry. Like his quote famously is like, people saying someone stole a Dharma Center to him.\n\nAnd he just said like, this is good. They stole a Dharma Center. It's like a huge building.\n\nThey got into the board of directors or whatever and just stole it. It's such an evil, horrible thing to do, right? And it's like creating all these complications.\n\nAnd he's just like, yeah, this is good. We're just trying to benefit people. It's okay.\n\nAnd to us, that's a contradiction."
      },
      {
        "speaker": "Fran",
        "time": "1:39:27",
        "text": "No, we're trying to benefit people."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:39:30",
        "text": "That's so bad. No, that thought, that mind is the self-cherishing mind. This is, it doesn't like, it doesn't, anyway.\n\nYeah, where the mind of love is just like, okay, we're just trying to benefit people. That's fine. This isn't going to help us.\n\nThere's no angst there. So we can see like when we get in these little knots, it's just a simple sign that we don't know how to follow our love. There's something missing, you know.\n\nOkay. Enough for now. We'll get into the text and how to apply this and some practical kind of specific tools in the next session.\n\nOkay. Just two quick announcements. On Saturday, we have a course called Compassionate Creativity, Helping Others Where They're At.\n\nSo this is about how to like benefit others at their level in the right way with a kind of creative and wise mind. This is a bit related to this, actually, and we'll be making a very similar point in that course, 11 to 2. And then the 7th of February, we have an all-day long course called How to Not Take Yourself So Seriously.\n\nIt's a silent retreat on equalizing and exchanging self with others. It will also, surprise, surprise, be related to this topic quite a bit. So anyway, lots of good stuff coming up.\n\nOkay, let's dedicate here, and we'll come back at 6.11. Okay, we can think through the virtues we've collected through practicing, meditating, discussing. May all living beings find lasting peace of mind, enlightenment. Okay, thank you.\n\nThanks, everyone."
      }
    ]
  },
  "session2": {
    "chantedPrayers": {
      "time": "1:45:31",
      "text": "O Blessed One, Shakyamuni Buddha,\nPrecious treasury of compassion,\nBestower of supreme inner peace,\nYou, who love all beings without exception,\nAre the source of happiness and goodness;\nAnd you guide us to the liberating path.\n\nYour body is a wishfulfilling jewel,\nYour speech is supreme, purifying nectar,\nAnd your mind is refuge for all living beings.\n\nWith folded hands I turn to you,\nSupreme unchanging friend,\nI request from the depths of my heart:\n\nPlease give me the light of your wisdom\nTo dispel the darkness of my mind\nAnd to heal my mental continuum.\n\nPlease nourish me with your goodness,\nThat I in turn may nourish all beings\nWith an unceasing banquet of delight.\n\nThrough your compassionate intention,\nYour blessings and virtuous deeds,\nAnd my strong wish to rely upon you,\nMay all suffering quickly cease\nAnd all happiness and joy be fulfilled;\nAnd may holy Dharma flourish for evermore."
    },
    "teaching": [
      {
        "speaker": "Kadam Kyle",
        "time": "1:50:13",
        "text": "to see if they're logical, non-contradictory, reasonable, and applicable to our experience is a process known as analytical meditation.\n\nArising from this process of examination is a conclusion, in this case a strong feeling that all beings have been our mother. The next step is to hold this feeling or conclusion by the power of our mindfulness and remain upon it single-pointedly. This process is called placent meditation.\n\nIt is through the continual practice of placent meditation that true realizations dawn in our mind. When we become firm in the recognition that all sentient beings have been our mother, we have attained the realization of the first of the seven stages in the development of bodhichitta. So here it's talking about this relationship between analytical meditation and placent meditation.\n\nSo we can all ask ourselves, how is this relationship for us? Do we feel clear about how to move from analytical meditation to placent meditation? Do we feel clear on how to get to a meditation object and stay there single-pointedly?\n\nDo we have tools to skillfully engage with analytical meditation? And do we have tools to then shift from that to placent meditation, to be able to abide single-pointedly on a meditation object? Or is our meditation just thinking, thinking, thinking, thinking, thinking, like that, like churning the whole time?\n\nLike what percentage of it is stillness and quiet, like quietude almost? For example, with the different loving-kindness-based meditations, if we're trying to be guided by love, we want to be able to get to the object of meditation more and more swiftly over time. We want it to be an expedited process, something that we can do pretty quickly, like moving from not, for example, feeling love towards someone, towards feeling they're my mother, or not feeling love towards someone or some situation, or being bogged down in self-cherishing, to really cherishing others.\n\nWe want to be able to do that somewhat swiftly, right? So, of course, analytical meditation is trying, right? We're trying.\n\nAnd that's great, and there's nothing wrong with that. But we do want to have a kind of analytical meditation that's going to produce some fruit of an experience of love. So we want to be able to really find the object of meditation with all the Lam Rim objects, and especially these loving-kindness-based ones.\n\nSo we can all kind of look at our mind and kind of just explore a little bit what are our skills here. One thing here is that one of the most important things we can do to upgrade our analytical meditation is to contemplate in daily life quite a bit. It's hard to do a place of meditation in daily life because there's just so many distractions and our senses are being engaged.\n\nBut we can contemplate, a.k.a. do analytical meditation, all day. And it makes everything much more interesting. So, for example, when we think about the next 24 hours, and we ask ourselves, how do I want the day to go?\n\nIt's interesting because we often think about the external details, but that doesn't matter at all, basically. When we're thinking about how we want the day to go, we want to think, what kind of mindsets do we have for the next 24 hours? Basically, what are we thinking about the next 24 hours?\n\nThat's much more interesting and important. It's like, what kind of thoughts do I want to have over the next day? Not, what do I want externally to occur?\n\nIt's interesting, when we just focus on that, we're not thinking about the thoughts at all that we have. And that just makes us pretty attached and fearful and controlling. So the types of thoughts we want to have are contemplative thoughts.\n\nThoughts that are contemplative in nature. Basically, we're just thinking about Dharma all day. What's going on externally can never stop us from thinking about Dharma.\n\nNo one can stop us from thinking about Dharma, even if we're in jail and tortured or something like that. They can't stop you from turning it into the spiritual path. You're just thinking, yes, samsara is like a hideous prison, a hideous torture chamber.\n\nYes, this is teaching me. Thank you, torturers. They can't stop you.\n\nAnd you're blissful at that point. You're happy. You're getting the best Dharma teaching you ever got.\n\nThey can't control what you're doing with your mind. So the thing is, we can contemplate all day, 24-7. And the more we contemplate during the day, the better analytical meditation is going to be.\n\nSo each day throughout this week, it would be a nice thing to do at the beginning of the day. Like, okay, what kind of thoughts do I want to have over this next day? What kind of contemplations that are going to grow my love do I want to have over this next day?\n\nWhen I'm here, what kind of loving thoughts will work there? And then when I'm doing this, what kind of loving thoughts will kind of get in there? And when I'm kind of lonely and bored at that point in the day, what kind of loving thoughts could I have over there?\n\nWe all know this, but we also just want to turn everything into a contemplation. And we can basically just turn anything that happens into a contemplation, into like a Dharma teaching on love. So let us all figure out how to do that ourselves.\n\nIt just basically depends on how you frame any situation. If you frame it with the intention to kind of turn it into some love teaching, you can make anything a teaching on love. Yeah, we all know that?\n\nYeah, okay. This is why I like an epithet in Sanskrit for Buddhist is inner being, inner being. It's like someone who's more interested in what they're thinking about than what's going on externally.\n\nAnd that's a gradual process. More interested in what I'm thinking about than what's happening externally. Okay, remembering the kindness of all living beings.\n\nIf all beings have been our mother, then how are we to recollect their kindness? Present mother carried us in her womb for nine months. Whether sitting, walking, eating, or even sleeping, she was ever mindful of our presence.\n\nHer only thought was of our welfare, and she regarded us as a precious gem. Even though our birth may have caused her intense pain, she still thought solely of our welfare and happiness. And a bunch of challenging things happened to her body the whole time, which she didn't enjoy particularly.\n\nAny of the moms of this life in this group can, if anyone needs educating, you can talk to one of our moms in this life about the fun of having a little being living in your belly for nine months. As an infant, we were little more than a helpless caterpillar. That's very cute.\n\nNot knowing what was beneficial or harmful. Our mother cared for us and fed us her milk. When we were afraid, she warmed us with the heat of her body and cuddled and comforted us in loving arms.\n\nShe even wore soft clothing so as not to harm our sensitive skin. So the point here is connecting to total helplessness at the mercy of the world for a long time, at least a couple of years. Definitely the first year, but a few more after that.\n\nThe more we connect to utter helplessness, the more this meditation works quite well. Essentially, we were just in the hands of someone who could control whether we live or die. Solely up to them.\n\nThat really makes the meditation touch our heart if we feel totally helpless. Utterly helpless. It was completely up to their mercy whether I lived or I died.\n\nWherever she went, she took us with her. She washed and bathed us and cleaned the dirt from our nose. Sometimes a parent will suck the snot out of the nose of the child.\n\nNo, you never did that, Fran. I won't poll everyone else, but I know some mothers who have done that because their child is very congested and they don't want to prod their nose. So they'll just suck the snot out of it.\n\nIt's so kind. I don't want to do that for anyone. I love all of you.\n\nI will not be sucking the snot out of your nose anytime soon. Maybe if you're dying I would do it, but pretty much no other situation. I would just come up with a million other answers.\n\nWe'd get a hose out or something like that. Yeah, there's tools. Okay, cool.\n\nWhile playing with us, she would sing sweet sounds and repeat our name with special tenderness. She protected us continually from the dangers of fire and accident. In fact, if it were not for her constant care, we would not be alive now.\n\nAll that we have and enjoy is through the kindness of our mother. She rejoiced in our happiness and shared in our sorrow. Worrying about our slightest discomfort, she would have willingly surrendered even her own life in order that we may live.\n\nShe taught us how to walk and talk, read and write, and underwent many hardships in order to give us a good education and the very best of whatever she possessed. So this line, all that we have and enjoy is through the kindness of our mother. So we can think about that a little bit.\n\nCan we make a proof for that? All that we have and enjoy is through the kindness of our mother. Looking upon her child with tenderness, a mother cherishes it from conception until death with great devotion and unconditional love.\n\nBringing to mind the limitless kindness of our present mother makes us realize the infinite loving care we have received from time without beginning from all the countless mothers who have nurtured us. How kind these sentient beings have all been. One of the easiest ways to get into a loving mind is to remember the kindness of others, whether thinking about them as our mother or just thinking about gratitude in general.\n\nThis is one of these core skills of being a Buddhist, is being able to do this and get to this object of meditation where we feel like... It's like a sense of grace. Grace is like freely given protection.\n\nSomething like this, like freely given help. So that's the sense of this meditation. It's like we've received, it's like freely given help.\n\nThe meditation breaks down the self-cherishing mind quite a bit. Because often we think we did it ourself for this reason or that reason. But we're utterly dependent on others.\n\nSo really connecting to that, that sense of being utterly dependent on others and their kindness, again it's like this core skill to our practice, really breaks us out of the self-cherishing mind. It actually leads us into the emptiness of the self pretty quickly if we stick with the meditation. Because we just say, well, what am I?\n\nEverything I have is just coming from others. So there's nothing that came from me. Well, then who am I then?\n\nNothing has come from me. There's no self there. I'm just a product of others.\n\nSo we can ask, how does this meditation work for us? A couple of things. One thing that helps is to think about the good intentions of others.\n\nSo technically we don't know anyone's intention. And so there are people who help us, maybe who don't intend to help us. And they're still kind, because they help us.\n\nLike I have this little charging dock thing that I love where I can charge nine different of my devices in one little friendly little dock thing. My life is just so much better because of this dumb little tool. Because I don't have to carry around a bunch of chargers and plugs and blah blah blah.\n\nI'm always traveling, so I need to charge a bunch of my garbage. So the person who made it maybe wasn't thinking about me. But they're still kind to me.\n\nMy life is way better because of them. So from one point of view, you can still appreciate people regardless. But it's really helpful to just 100% assume good faith.\n\nUnless you know otherwise. We can infer otherwise sometimes. Still then we don't know, but if someone's chasing after you with a knife it may be reasonable to conclude okay, maybe they don't have the best intention right now.\n\nBut it's helpful. Generally speaking, assume good faith. Assume good intention.\n\nJust envision or imagine what it would be like for them to be looking after you. That's the sense. It's like someone who's looking after your well-being.\n\nThat's what we want to open our heart to. There's so much fear and pessimism in the world. But there's an incredible amount of goodness.\n\nI'll probably have to leave during the discussion today because of the snow going on. And it's a little bit worse upstate. So I'll need to duck out a little bit early.\n\nBut I've had multiple people today reach out to me to tell me about the snow. And just to say, please, I really want you to drive carefully. And someone said this to me at the end of the Sunday class today this morning, who I didn't even know knew that I drive upstate afterwards.\n\nAnd she said, please be careful tonight. And I felt actually really touched. Like, wow, that's really interesting.\n\nShe's really thinking about me. And she's really wishing me to be safe. I didn't mention it.\n\nWe weren't talking about it. It was just independent. She just came up to me because she was personally thinking about it, about me driving back.\n\nBut it was really touching to think, oh wow, she really loves me. She really wants me to be happy and safe. That's so beautiful.\n\nSo it's like that sense that it's good to just assume for all living beings that that's how they feel about us. Until they prove otherwise. I'm not saying you can be dumb.\n\nJust assume until you get some decent evidence. It doesn't mean let yourself get taken advantage of or whatever. It just means in our heart this is a view.\n\nIt's like if you see someone cleaning up the street. Like a group of people who clean up the garbage on Atlantic Avenue every day. Around five or six.\n\nBecause there's garbage every day that's strewn all over the street. So it's like, yeah, we don't know that they have an intention to benefit us. But if you just connect to that feeling, they're just so kind and they're looking out for us.\n\nAnd they really want us to have a beautiful environment. If you just sort of assume that until proven otherwise, it feels really beautiful. And it just helps us get into that feeling of kindness and gratitude.\n\nOf course we can do this with people who annoy us too. Like let's say someone's trying to rile us up in our life. It's an interesting thing.\n\nThey're not going to hurt us. Don't act dumb and let yourself get hurt. Let's say they're just trying to rile us up by saying something.\n\nIt's really interesting. If you just assume good faith, you can just feel that they're like a little jester appearing in your life to help you lighten up. I know when I do this, I just laugh with them.\n\nWhen I don't do this, I get very defensive and mad. And I want to hurt them. I don't want to live in that place personally.\n\nBut it's like, yeah, maybe with a good intention. They're trying to help me lighten up by poking me and prodding me and making fun of me or whatever. Doing things that they know I don't like.\n\nI do need to learn how to deal with that. I need to lighten up a little bit. What if I just assume good faith here and see them as kind?\n\nThat is really fun. They're going, ha ha, gotcha, riled you up again, ha ha. You need to lighten up.\n\nWhy are you so defensive? It's like, oh yeah, you got me again. Thank you very much.\n\nThat was very kind, like that. There's just some ways to think about this meditation. Last thing for now on this specific meditation is to think about just the incredible trial and error and immense amount of death that occurred for us to have anything we have now.\n\nIt involved people just eating random things and dying over and over and over and over again. Way before people were even domesticated or had domesticated societies in little cities and towns. They're just wandering around the wilderness and they're like, well, I'm starving, let's eat that.\n\nDead. But then to actually get someone to learn that is complicated because you're dead. You needed to have someone who was there when you died from it who correctly inferred we shouldn't eat that and then pass it down.\n\nFor the most part, people just did that and died over and over and over and over and over again until finally someone realized all the people who eat those berries die. Then they enshrine that in knowledge, there's no books, so they painstakingly teach everyone don't eat those berries, you're going to die. The language probably isn't that substantial, so it's like pointing at it and then like this, or like that.\n\nEvery single food had to be done like that. Every single drink, like certain water, that one has whatever in it, it just kills you. Dead.\n\nEventually people figured out things like how to sterilize or boil the water and not maybe get as sick or die. Then they had to teach people that and that's painstaking to pass that knowledge on. People don't believe you, there's no guarantee your little society lives.\n\nSomeone maybe just comes by and kills all the people in your society and the knowledge is lost forever. So just think about how much death there had to occur just for these basic bits of knowledge to pass down from generation to generation. Basically our very existence is on this huge pile of corpses of people who just sacrificed themselves, just like a guinea pig.\n\nThey lived their whole life, they ate one weird thing and they're dead. That's their existence. That was their tribute to the future of society.\n\nWe're the benefactors of all those little actions. What about trying out different government styles that worked? Let's have crazy, scary theocracy for a bit.\n\nLet's have nepotistic dictators for a bit. People just kept trying all these things and mostly death is the result of most of them. Just experimenting with different ways to organize humans.\n\nThere's just like trails of suffering and pain left. These people are just like fodder in these experiments that were done for us to have any kind of some semblance of a society that works. And we do, it's amazing.\n\nWe have a society that actually works to some degree. Yeah, people are very critical of it. I'll personally take it over like being a serf or something like that.\n\nI think I'd take it every day of the week. We have religious freedom. We have freedom to come to things like this.\n\nWe have something called free time that didn't exist until, I don't know when, but like 40 years ago, 50 years ago, 70 years ago, whatever the day is. We have so many incredible luxuries and it's basically just the sacrifices of people in incredibly petty ways that they just sacrificed their life for us to learn some tiny, infinitesimal bit of knowledge that eventually built up enough knowledge for there to be a civilization at all. That's incredible, right?\n\nSo we can just feel like, wow, that's so kind, right? For there to be some kind of semblance of a working society where we can learn Dharma where there's a freaking Zoom stream that we could get of Dharma from the comfort of our home or a Dharma center that we can snuggle up into with amazing people. So many different factors have to come together that are all impossible.\n\nAnd they all did. And we're the benefactor of it. We just showed up and have it for us.\n\nI just find that very helpful to think about. The idea is just to make it touch your heart. Some of those things are what touch my heart.\n\nDeveloping the wish to repay the kindness of all mother beings merely to remember the kindness of all mother sentient beings is not enough. Only the most callous and ungrateful would fail to see that it is our duty and responsibility to repay this kindness. So you can just feel, do you have a feeling every day that you have a duty and responsibility to repay the kindness of others?\n\nIf not, we are the most callous and ungrateful. What's the line in the Lord of All Nature's Prayer? We're like a mean and heartless child leaving their parents to suffer in a jail while they escape.\n\nThis we can do by bestowing on others material gifts, pleasures or enjoyments and other temporary benefits. However, the supreme repayment of the infinite kindness we have received is to lead all beings to the unsurpassable happiness of full awakening. Yeah, part of our kind of individual like little projects, working on being really love motivated is breaking out of a yeah, of like a naive love, right?\n\nBecause bodhichitta is like an educated compassion or educated love. It's not like a naive mind. So bodhichitta mind, right?\n\nIt's like, it doesn't get bogged down in like people pleasing. The bodhichitta mind. Like for some people, they have a really difficult time with like boundaries and how to relate to people in their life.\n\nAnd they constantly find themselves like over committing and then shutting off their heart and under committing. And they just don't know how to like navigate personal relationships. And hearing teachings on love and compassion make them just crazy because they try to over commit and do a bunch of things for people and then they burn out and then they present loving kindness.\n\nAnd then they just do it over and over again. And they harden their heart and realize that's not the answer. And then they just go back into the fray.\n\nAnd this is a real problem, right? And this is something we really have to help people with as Dharma teachers. To like help people.\n\nBecause this is a sincere confusion for many people. And the mind of bodhichitta starts to resolve a lot of this. Because we just see, my aim is benefiting all living beings.\n\nI don't need to be so bogged down in these individual micro relationships. I have this huge vision. I need to benefit all living beings.\n\nI'm on a spiritual journey to become a Buddha. Basically, if you're holding me back, get out of the way. I'm not feeling guilty about it.\n\nI'm not being callous to you. Like if you had a cure to an illness that spread throughout the world, that you could cure everyone with. And you're like charging to get it into the hands of everyone.\n\nAnd someone was like, come on, hang out with me. Be nice to me. You'd just be like, absolutely not.\n\nGet out of my way. I'm trying to help everyone here. Get out of the way.\n\nThey said, you're not a real Buddhist. You just say, I'm pushing you out of the way. Because I am a real Buddhist.\n\nGet out of the way. I've got a big vision. I'm helping everyone.\n\nThe more we get this big vision of bodhichitta, we just stop getting so complicated about these things. And we can just be really clear a lot more often. Is this about my journey to enlightenment?\n\nNo. Okay. Love you and leave you.\n\nBye bye. Like that. Love you, leave you.\n\nBye bye. But we have to have this view, right? It's my enlightenment that's the answer.\n\nIt's not like the people-pleasing massaging of people's egos. That's the answer. Yeah, I might do some of that as my process to become more enlightened, because I have to learn how to be nicer and more tolerant of people and more patient.\n\nYeah, but that's not the answer. Me helping them right now with a little chat or smile isn't the answer. My enlightenment, my awakening is the actual answer.\n\nSo if it's helping me move to awakening, great. Keep it up. If it's getting in the way, I love you, therefore I'm leaving you.\n\nLike that. So we start to kind of build this clarity in our mind. It stops getting sucked into these little sub-games of life.\n\nBecause we have the big game that we're focusing on. The big game of awakening, enlightenment. So if this is something hard for you personally, it's okay.\n\nAnd there's probably some really good reasons that this is hard for you. That having these kind of clear boundaries in your life is complicated. It's a huge impetus then to really understand bodhicitta is the answer.\n\nWe have to become enlightened for the benefit of others. Once we really get that mega crystal clear, that's what I need to do. That's where I'm going.\n\nThen this stuff will actually just resolve itself. It would just stop being so complicated. David, yeah?"
      },
      {
        "speaker": "David",
        "time": "2:26:45",
        "text": "I guess my question is there's a lot of teachings about just transforming everything into the path. So how can somebody actually prevent our enlightenment? Or what does that look like?\n\nI realize if we think the answer is external stuff, then yeah, that's not."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "2:27:02",
        "text": "I was just talking to someone about this a couple days ago. So there's the question we need to ask ourselves. Am I using this to become more enlightened right now?\n\nIf yes, continue onwards. If no, abandon ship. It's actually a simple heuristic.\n\nIt does take some self-honesty. But if I'm actually transforming it, then I'm growing my virtues. Fantastic.\n\nContinue onwards. If I'm not able to transform right now and I'm increasing my delusions, abandon ship. So yeah, they're not the ones getting in the way.\n\nOur capacity is getting in the way. But our capacity might not be one where we can transform certain situations right now. Does that make sense?\n\nYeah. And over time, we'll get these really clear heuristics. Kind of rules of thumb.\n\nThese situations, yes. Those situations, no. They're not like huge, impenetrable walls.\n\nBut they're just like guidelines for living that we figure out. Things like a teacher's advice or different teachings on moral discipline that come in the fifth chapter here are examples of that. They're not like these strict rules for living, but they're like guidelines.\n\nIt's like, generally speaking, do this kind of stuff and avoid these kind of situations. Because generally speaking, this kind of stuff helps you grow your virtues and become more enlightened. Generally speaking, those kind of situations are pretty hard to transform.\n\nMaybe don't focus on them. Like, what's one of them? From a teacher, profit and respect are the nooses of the morals.\n\nSo brush them aside like stones on a path, something like that. Profit and respect are the nooses of the morals. Yeah, you can transform profit and respect, definitely.\n\nBut it's also a heuristic, being motivated by profit and respect. Pursuing those things, generally speaking, is just a delusion-festering wound that appears in the mind. It just spawns delusions, generally speaking.\n\nAnyway, so this is the simple tool. It's like, okay, I want to become enlightened for the benefit of others. I'm aiming for enlightenment.\n\nI'm not people-pleasing. I'm not just trying to make everyone in my life fine with me right now, or even just fine in general right now. There's no end to that.\n\nThere's no way we can do that. It's impossible. Running around, trying to fix every single person.\n\nWe're going to go completely bonkers doing that. It's like, I need to become enlightened. So then, okay, am I growing my virtues?\n\nAm I really moving towards enlightenment in this situation? If yes, fantastic. Great.\n\nLinger around. If no, that's okay. Draw a line in the sand.\n\nLove you and leave you. And if people don't respect that, that wasn't a relationship that was going to work out anyway. Any good relationship is based on being able to say that and do that.\n\nLove and leave people. That's what a healthy relationship is. Actually, it can help them find the right way of relating to you and other people too.\n\nIt's a very important kind of skill to live into. Then just a couple of little practical things. On love, as our guide, Geshe-la says here, accepting defeat and offering the victory section, eight steps to happiness.\n\nIf while experiencing adverse conditions, our mind remains calm and happy through the practice of patience or love, we do not have a problem. We may have a challenging situation, may be sick or injured, but we're free from pain. By controlling our mind in this way, we experience a cessation of our pain, worry and depression and find inner peace.\n\nFurthermore, by keeping a peaceful mind in difficult situations, we are far more likely to find solutions and respond constructively. Buddhist practice is very gentle. It does not require physical deprivation and hardship, but is mainly concerned with the internal task of controlling and transforming the mind.\n\nOnce we've learned how to do this, we will understand the real meaning of Buddhist teachings. I love that section! Oh my gosh!\n\nEspecially this last line. Once we've learned how to do this, we'll understand the real meaning of Buddhist teachings. Which means it's like oral instruction.\n\nThis is like from the point of view of High Sutta Tantra. This is like core Buddhist instruction. Again, Buddhist practice is very gentle.\n\nIt does not require physical deprivation and hardship, and is mainly concerned with the internal task of controlling and transforming the mind. Once we've learned how to do this, we'll understand the real meaning of Buddhist teachings. By keeping a peaceful mind in difficult situations, we're far more likely to find solutions and respond constructively.\n\nThe practical tool, which I think we've looked at in this class, and it's referring to a little grid that David referred to earlier. It's basically, again, it's like being driven by love. What we're trying to do is intervene in the decisions in our life, especially with respect to the specific project we're working on.\n\nWhat we're trying to do is see, okay, option A, option B, right now. Then what we're trying to do is take a step back and ask, what mind is creating those options? Basically, it's generally speaking a delusion of anger, attachment, or maybe something else.\n\nThen what we're going to try to do is cultivate some love and see what are the new options that appear. We're stepping back from the decision, understanding the mind that's creating those options in the decision. If it's not a virtue, generating the mind of love and then seeing new options.\n\nLet's say someone says something unkind to us. First, should I say something? Should I not say something to them?\n\nShould I scream at them and tell them off? Or should I bitterly seethe and grumble to myself for the next five years? Which one do I want to do?\n\nThat's why we get stuck, right? Because those are both terrible options. We're asking, what mind is creating the options?\n\nIt's the mind of anger, mostly. Maybe the mind of attachment. It's like a grid.\n\nThose are two boxes. What we're seeing is that there's on the Y-axis, there's the mindset you have. There's two boxes.\n\nScream at them, seethe. What we're asking is, what's the mind that's creating those two options? It's like the Y-axis.\n\nNo, it's like my anger. Oh, that's why I'm stuck. I'm deciding between two options created by anger.\n\nThat's why I'm so confused about what to do. Because they both feel awful. They're both terrible decisions, non-virtuous decisions.\n\nHow do I choose between them? We're stepping back from the two options. We're trying to see the mind that's creating them.\n\nThen we're moving down to a more peaceful mind. I'm trying to visually demonstrate with my hands, but I'm stopping doing that now. You get the idea.\n\nOn the Y-axis, there's the minds. It's like a more peaceful mind. In this case, a mind of love.\n\nCan I get from the anger to the love? We're not trying to figure out what to do yet until the love is there. Or else we'll probably just pop back up to the top row and get back into stumbling around those two choices.\n\nWe're not trying to look at the two choices but from a loving angle. Those are the options created by anger. Those aren't the options, really.\n\nWe're like, I'm not going to make a decision until I get to a mind of love. That's the only thing that's going to give me good options. We might move to that mind of love.\n\nIt's using whatever tool is going to get us there. We're going to work as we go through this chapter more tools and tools and tools. It could be kindness, it could be all living beings are mother, it could be wishing love, may you be happy, it could be bodhichitta, whatever thing is going to get you to love.\n\nWhen we get to that mind of love, it's almost like you ask it, OK, what are the choices? As if you're dialoguing with a friend or a co-worker or a partner or something. OK, what are the choices, love?\n\nAlmost anthropomorphizing it. Can you help me get some choices? There still might be a say something and not say something choice.\n\nThey're actually different options. They're completely different than the first two. They're like, help the person.\n\nHelp the person see that they can't mistreat people. Something like that. That would be like the say something mind.\n\nIt's just an example. It's totally different than tell them what they need to learn. You really feel like you're helping from the depths of your heart.\n\nYou love that person. The not say something one is like, realize that it's just going to harm them and others to say something and instead just pray for them and wish them well or imagine they're a Buddha or do something mental instead of say something verbally. This is like the simple kind of technique.\n\nIt's like a structure, a thought to put your mind into. It's like, OK, I'm making a decision. Should I do this?\n\nShould I do that? Move from the decision to the mindset. Understand the mindset that made the options.\n\nMove from that mindset, if it's a delusion, to love. Re-evaluate the decision but being guided by love. It's a bit clunky at first but I think if we work on it all together and try out some things and learn some best practices, it's going to start to be very fluent and natural.\n\nWe'll start attuning and feeling how right it feels when we're guided by love. How off it feels when we're guided by delusion. We'll start making really wise, amazing decisions.\n\nWe all do already but we'll start making even better ones and cutting through the confusion, the nonsense, and so on. The last thing I'll say about this is you have to give yourself a little bit of space to not get to the decision-making process till the love has come to bear. Sometimes you might not be able to get there in time and then you've just got to do what you've got to do.\n\nBut when possible, give yourself the space. That's enough for now. I will dissolve and hopefully not die.\n\nNo, it should be fine. Kristen and Grady, I might give you a desperation call if it's funky out there on the way. We'll have a little time for discussion still and then someone can wrap it up and get a conclusion.\n\nAnn, do you mind doing that? So you just hop on the mic when we're done and get everyone's final bit. Thank you all very much.\n\nDiscussion partners in here. Let's have Fran and Ann P and then Ann K and Natalie and David and Jose."
      }
    ],
    "conclusion": [
      {
        "speaker": "David",
        "time": "3:01:20",
        "text": "I'd try to make at least one decision coming from a mind of love and maybe doing the exercise that Kadam Kyle laid out, sort of if there was some option that was already appearing to our mind that was coming from a delusion, identify that as happening, generate a positive mind instead, and then come up with our new options coming from love."
      },
      {
        "speaker": "Fran",
        "time": "3:01:44",
        "text": "I just wanted to add the goal to that for me would be to recognize the situation, to even stop myself to make that, to think about those decisions, to not rush into something and then say, oh, I should have done that little grid thing before I said that."
      },
      {
        "speaker": "Anne",
        "time": "3:02:10",
        "text": "Any online ideas? Online people? We're good?\n\nOK. I'm also going to just try to do all my actions with a mind of love, like before every action. Like, what would it mean to do this with a mind of love?\n\nYeah, because I'm going to apply that to my to-do list as I go through the list all day long."
      },
      {
        "speaker": "Adriana",
        "time": "3:02:36",
        "text": "Just really quickly, what you just said reminded me that I remember I went to a workshop with Kadam Morten, and he said, we should do things with love or not do them at all. Whoa!"
      },
      {
        "speaker": "Adriana",
        "time": "3:02:59",
        "text": "Interesting, thank you. You could just do nothing this week. Are those the two options?\n\nThose are the two options. They're a little extreme, but you know."
      },
      {
        "speaker": "Anne",
        "time": "3:03:12",
        "text": "Wonderful. Dedication? Should we just do like the nine-line prayer?"
      },
      {
        "speaker": "David",
        "time": "3:03:30",
        "text": "All right. So we can just think through our time spent listening, contemplating, discussing, meditating. May all living beings find lasting peace of mind, enlightenment.\n\nWe can make any personal prayers or dedications. Thank you all."
      }
    ]
  }
}