{
  "classId": "2025-12-14",
  "date": "December 14, 2025",
  "session1": {
    "chantedPrayers": {
      "time": "0:31",
      "text": "LIBERATING PRAYER\n\nO Blessed One, Shakyamuni Buddha,\nPrecious treasury of compassion,\nBestower of supreme inner peace,\nYou, who love all beings without exception,\nAre the source of happiness and goodness;\nAnd you guide us to the liberating path.\n\nYour body is a wishfulfilling jewel,\nYour speech is supreme, purifying nectar,\nAnd your mind is refuge for all living beings.\n\nWith folded hands I turn to you,\nSupreme unchanging friend,\nI request from the depths of my heart:\n\nPlease give me the light of your wisdom\nTo dispel the darkness of my mind\nAnd to heal my mental continuum.\n\nPlease nourish me with your goodness,\nThat I in turn may nourish all beings\nWith an unceasing banquet of delight.\n\nThrough your compassionate intention,\nYour blessings and virtuous deeds,\nAnd my strong wish to rely upon you,\nMay all suffering quickly cease\nAnd all happiness and joy be fulfilled;\nAnd may holy Dharma flourish for evermore.\n\nGOING FOR REFUGE\n\nI and all sentient beings, until we achieve enlightenment,\nGo for refuge to Buddha, Dharma and Sangha. (3x)\n\nGENERATING BODHICHITTA\n\nThrough the virtues I collect by giving and other perfections,\nMay I become a Buddha for the benefit of all. (3x)\n\nGENERATING THE FOUR IMMEASURABLES\n\nMay everyone be happy,\nMay everyone be free from misery,\nMay no one ever be separated from their happiness,\nMay everyone have equanimity, free from hatred and attachment.\n\nVISUALIZING THE FIELD FOR ACCUMULATING MERIT\n\nIn the space before me is the living Buddha Shakyamuni surrounded by all the Buddhas and Bodhisattvas, like the full moon surrounded by stars.\n\nPRAYER OF SEVEN LIMBS\n\nWith my body, speech and mind, humbly I prostrate,\nAnd make offerings both set out and imagined.\nI confess my wrong deeds from all time,\nAnd rejoice in the virtues of all.\nPlease stay until samsara ceases,\nAnd turn the Wheel of Dharma for us.\nI dedicate all virtues to great enlightenment.\n\nOFFERING THE MANDALA\n\nThe ground sprinkled with perfume and spread with flowers,\nThe Great Mountain, four lands, sun and moon,\nSeen as a Buddha Land and offered thus,\nMay all beings enjoy such Pure Lands.\n\nI offer without any sense of loss\nThe objects that give rise to my attachment, hatred and confusion,\nMy friends, enemies and strangers, our bodies and enjoyments;\nPlease accept these and bless me to be released directly from the three poisons.\n\nIDAM GURU RATNA MANDALAKAM NIRYATAYAMI\n\nPRAYER OF THE STAGES OF THE PATH\n\nThe path begins with strong reliance\nOn my kind Teacher, source of all good;\nO Bless me with this understanding\nTo follow him with great devotion.\n\nThis human life with all its freedoms,\nExtremely rare, with so much meaning;\nO Bless me with this understanding\nAll day and night to seize its essence.\n\nMy body, like a water bubble,\nDecays and dies so very quickly;\nAfter death come results of karma,\nJust like the shadow of a body.\n\nWith this firm knowledge and remembrance\nBless me to be extremely cautious,\nAlways avoiding harmful actions\nAnd gathering abundant virtue.\n\nSamsara's pleasures are deceptive,\nGive no contentment, only torment;\nSo please bless me to strive sincerely\nTo gain the bliss of perfect freedom.\n\nO Bless me so that from this pure thought\nCome mindfulness and greatest caution,\nTo keep as my essential practice\nThe doctrine's root, the Pratimoksha.\n\nJust like myself all my kind mothers\nAre drowning in samsara's ocean;\nO So that I may soon release them,\nBless me to train in bodhichitta.\n\nBut I cannot become a Buddha\nBy this alone without three ethics;\nSo bless me with the strength to practice\nThe Bodhisattva's ordination.\n\nBy pacifying my distractions\nAnd analyzing perfect meanings,\nBless me to quickly gain the union\nOf special insight and quiescence.\n\nWhen I become a pure container\nThrough common paths, bless me to enter\nThe essence practice of good fortune,\nThe supreme vehicle, Vajrayana.\n\nThe two attainments both depend on\nMy sacred vows and my commitments;\nBless me to understand this clearly\nAnd keep them at the cost of my life.\n\nBy constant practice in four sessions,\nThe way explained by holy Teachers,\nO Bless me to gain both the stages,\nWhich are the essence of the Tantras.\n\nMay those who guide me on the good path,\nAnd my companions all have long lives;\nBless me to pacify completely\nAll obstacles, outer and inner.\n\nMay I always find perfect Teachers,\nAnd take delight in holy Dharma,\nAccomplish all grounds and paths swiftly,\nAnd gain the state of Vajradhara.\n\nRECEIVING BLESSINGS AND PURIFYING\n\nFrom the hearts of all the holy beings, streams of light and nectar flow down, granting blessings and purifying."
    },
    "guidedMeditation": [
      {
        "speaker": "Kadam Kyle",
        "time": "12:41",
        "text": "Just feel inspiring blessings pour down. Remember that Buddha's blessings are like the sun.\n\nOur mind is like a room. Developing the mind of faith is like opening the vines and letting the sun in.\n\nJust use your faith to let Buddha's compassionate blessings into your heart. Then we can take one of the benefits of bodhicitta.\n\nWhatever moves our heart the most. Deeply admire and appreciate that benefit. For example, if we think about how bodhicitta can protect us from fear.\n\nWe can reflect on our pain of fear and anxiety that we experience. How troubling and bothersome it is. How frustrating it is to live in fear.\n\nHow it makes us inert and unable to help others.\n\nYou can think about the misery of living a fearful life.\n\nBodhicitta will be a complete cure for this. Just apply this same method to whatever benefit we choose. Just seeing the personal problems this benefit will solve.\n\nAnd all the beautiful things that it will bring.\n\nOnce we develop some admiring faith in bodhicitta.\n\nWe allow this to then transform into wishing faith. Thinking, I want to develop a precious mind of bodhicitta.\n\nAnd hold that wish in meditation, single pointedly. If we get distracted, just return back to one of these benefits.\n\nReally admiring it.\n\nEspecially how it relates to you and what you need in your practice.\n\nWhen you get this sense of appreciation, seeing its beauty. Then transform your mind into wishing faith. Wishing to develop bodhicitta.\n\nAnd again concentrate on this wish, single pointedly.\n\nAnd let this wish to develop bodhicitta can gradually arise from our practice."
      }
    ],
    "postMeditation": [
      {
        "speaker": "Kadam Kyle",
        "time": "31:08",
        "text": "Okay, so we'll begin by reading Guide to the Bodhisattva's Way of Life."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "31:19",
        "text": "And we will go from verse 15 to... It's hard to choose."
      }
    ],
    "shantidevaReading": [
      {
        "speaker": "Kadam Kyle",
        "time": "31:58",
        "text": "(15) In brief, you should know\nThat bodhichitta has two types:\nThe mind that observes enlightenment and aspires,\nAnd the mind that observes enlightenment and engages.\n\n(16) Just as the distinction between wishing to go\nAnd actually going is understood,\nSo, respectively, the wise should understand\nThe difference between these two bodhichittas.\n\n(17) From the mind that aspires to enlightenment,\nGreat effects arise while in samsara;\nBut an uninterrupted flow of good fortune does not ensue\nAs it does from the engaging mind.\n\n(18) For whoever takes up the engaging mind of bodhichitta\nWith the intention never to turn back\nFrom completely liberating\nThe infinite living beings throughout all realms,\n\n(19) From that time forth, for him there will arise —\nEven if he is asleep or apparently unconcerned —\nVast and powerful merit, equal to space,\nThat flows without interruption.\n\n(20) For the sake of those with lesser inclinations,\nThese benefits were explained with logical reasons\nBy the Tathagata himself\nIn Sutra Requested by Subahu.\n\n(21) If even the thought to relieve\nThe headaches of others\nIs a beneficial intention\nThat results in infinite merit,\n\n(22) What can be said of the wish\nTo dispel the immeasurable misery\nOf each and every living being\nAnd lead them all to countless good qualities?\n\n(23) Does our father or mother\nHave such a beneficial intention as this?\nDo the gods or the sages?\nDoes even Brahma himself?\n\n(24) If, before generating bodhichitta, these living beings\nDo not even dream of such a mind\nFor their own sakes,\nHow will they develop it for the sake of others?\n\n(25) This mind to benefit living beings,\nWhich does not arise in others even for their own sakes,\nIs an extraordinary jewel of a mind,\nWhose birth is an unprecedented wonder."
      }
    ],
    "postReading": [
      {
        "speaker": "Kadam Kyle",
        "time": "36:06",
        "text": "Sumit, yes, please."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "36:18",
        "text": "The little black box isn't on, I don't think."
      }
    ],
    "practiceReports": [
      {
        "speaker": "Sumit",
        "time": "36:24",
        "text": "So the practice was the setting the bodhicitta intention and relaxing was the one I was doing. And I was like really into this because my practice is very neurotic. So I was like really, really into this practice.\n\nSo I really got into it. It was very fruitful. And it was great because, hey, I was setting the bodhicitta intention, which is the superior intention, all week.\n\nThat's awesome. But it really didn't feel relaxed. And for the sake of time, I don't want to go through all the examples.\n\nI kind of want to give the conclusions and hear your response. So there's like three main reasons it didn't seem relaxed. Okay.\n\nSo the first one is that it's not like you set an intention. It's like you have to set your intention constantly. It's like I could set my intention.\n\nAnd because I was mindful of it this week, I was like, I have to set my intention. And like five minutes later, my intention has gone out the window. It's not just self-cherishing or whatever.\n\nRight? So it's like a vigilance. Doing bodhicitta is like a vigilant practice.\n\nLike it made me think of Bengungyo. So that's one thing. There's like vigilance to it.\n\nThe second thing is that when I tried to set my intention, and it was like, okay, I set my intention and relax. And like it's, sorry, like when I'm setting my intention, the energy of bodhicitta, it's like the word aspiring, engaging, are like, it's like a very active thing. And we talk about like fuel, like compassion and bodhicitta can fuel.\n\nSo it's a very high energy enterprise, which was again, a good thing. Right? Like I'm glad that I was pushed to be doing things.\n\nSo anyways, that was my experience of it. And the third thing was that when I was like setting the intention and then being like, let's see how it plays out. I can get into that for some things.\n\nRight? Like when it's like, oh, like I have people over for dinner. Oh, I'm setting my intention to cook you a nice meal.\n\nHey, I burned the food. Like that doesn't really matter. Right?\n\nBut it's like, this is everything. This is literally the purpose and meaning of my life. Right?\n\nAnd so for like that to like not work out, it's just so important. Right? And so to be relaxed about something so important, it just really didn't feel right.\n\nSo I know that's a lot. So I don't want to like, if you're going to just like pick one or whatever, but those were sort of like my three. It overall was good practice, but those were three experiences I have that were very unrelaxed."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "39:24",
        "text": "Yeah. Yeah. Yeah.\n\nAnd here, maybe even just the word relaxed in this context just has some sort of loaded connotation, because I think the way you interpret it is very different from the way that I interpret it. It seems like in your mind has something to do with like passivity and not having a lot of energy and not being vigilant, like almost just like stoned on a couch. That's not what I mean by relaxed.\n\nIt means you're just deeply peaceful. That's what I meant. Like you're just so peaceful in your heart.\n\nSo you can be totally vigilant and totally peaceful. You can be totally engaged and energetic and totally peaceful. Yeah.\n\nSo that's just sort of the connotation. And so it might be an interesting activity to think like, can I envision a relaxed vigilance or a relaxed activity or a relaxed energetic quality? Can I envision what that's like?\n\nAnd maybe the word relaxed there just doesn't work for the job. Maybe the word peaceful is like a better word for the job."
      },
      {
        "speaker": "Sumit",
        "time": "40:50",
        "text": "Good thing this we have a long book for me to work on those two. But the one that I was in particularly, the one that I was really into was this."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "41:00",
        "text": "Number three."
      },
      {
        "speaker": "Sumit",
        "time": "41:00",
        "text": "Yeah. The number which was this. Me and Michael had a long conversation about this, this idea of like being into the inputs, not the outputs."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "41:07",
        "text": "Yeah."
      },
      {
        "speaker": "Sumit",
        "time": "41:08",
        "text": "And so like when the output isn't, how can you be peaceful when you're like, hey, this is really important actually. Right. And then to be like the output.\n\nRight. Like turns out like, how can you be peaceful about that? That's when I was really taken."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "41:24",
        "text": "Yeah. I think the main thing there is seeing that unpeacefulness with respect to any output is always attachment. And so it's like we have to kind of label that over and over and over again.\n\nLike peacefulness is attachment. The worry is attachment. And like the more we kind of slap that label on those moments, the more we'll start to see that response is coming from a delusion.\n\nAnd what we'll start to see is there's a way to do our best, but not get a certain output that's obvious, but feel deeply peaceful. But it's not until we start to like really identify worry and these kind of responses as attachment that we can really do that well. Thanks.\n\nYeah. Yeah. Thanks.\n\nYeah. And these, yes."
      },
      {
        "speaker": "Anne",
        "time": "42:29",
        "text": "I had a really good experience of this. And there were a couple examples this week, which I won't get into, but it was like I had a situation, I was walking into it, that was very identical to a situation the previous week, but I had this very different motivation for it and a completely different feeling during it. I felt so much happier.\n\nAnd what a difference in the outcome. Like, wow. Really astonishing.\n\nAnd what I'm thinking, I was just sitting here thinking about how, what a wonderful week I had. And I think this is one of these practices that I just want to make part of who I am. Just like something that I do unconsciously all the time.\n\nSo I think I'm going to make it one of my six, maybe four of my six sessions, just because we don't have TT for a few weeks. I can really, especially visiting my family for Christmas, it'd be wonderful to have this all through like the next two weeks. So I think that's going to be my plan."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "43:33",
        "text": "Yeah. I mean, it makes sense as a choice, just because we have a vow to generate bodhicitta six times a day. So it's kind of the intention to be part of the six session practice anyway.\n\nSo it's nice that kind of naturally you're attracted to it. Could you just say a little bit more though about, because again, like with the data, it's really helpful to say like why it worked. So like you said, you had these two situations, same thing, back to back weeks."
      },
      {
        "speaker": "Anne",
        "time": "44:03",
        "text": "One that really stands out in my mind is like a week ago, I met up with a person and I was really a little bit about like, what can I get out of this evening for me? And the evening did not go well. And I'm like, I thought this would go better, but I just felt weird and funny about it.\n\nIt was kind of wonky. And last night, same person, completely different intention. It was like a magical evening.\n\nIt was just so delightful. And we were both so happy."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "44:30",
        "text": "Okay."
      },
      {
        "speaker": "Anne",
        "time": "44:31",
        "text": "Yeah."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "44:32",
        "text": "Yeah. So it was just getting out of that thought of what can I get out of it for me?"
      },
      {
        "speaker": "Anne",
        "time": "44:36",
        "text": "Yeah. I'm only going to be concerned with the other person's happiness and well-being."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "44:40",
        "text": "Yeah. Okay. That makes sense.\n\nYeah."
      },
      {
        "speaker": "Anne",
        "time": "44:42",
        "text": "And I don't need to worry about, am I going to come out on the short end of the stick? I just don't need to worry. It's going to go great."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "44:48",
        "text": "Yeah."
      },
      {
        "speaker": "Anne",
        "time": "44:49",
        "text": "Or it'll go great in the long run or whatever. Yeah."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "44:51",
        "text": "Okay. Yeah. That makes sense.\n\nThank you. There's Adriana. Yeah."
      },
      {
        "speaker": "Adriana",
        "time": "44:57",
        "text": "Hi. Hi. Okay.\n\nSo what I tried, what I've been trying for the past couple of weeks is focusing on practicing patience in very minor, low stakes situations. Okay. So this week I had to go to the dentist and I had to get like 500 x-rays, you know, when they put the thing in your mouth and all these different ways.\n\nAnd I'm like, how could this be? This is just like one millimeter. Why do they need this angle?\n\nWhatever. And I usually really don't like it. And I thought, okay, I'm going to generate bodhichitta.\n\nI'm going to work on bodhichitta. It's going to take 45 minutes to clean my mouth. 45 minutes of bodhichitta.\n\nThis is going to be great. And especially with the x-rays because I usually have this gag reflex. And I was like, this is my job.\n\nIt's just to accept. And I felt so happy that I was like almost a little disappointed when the x-rays ended. I was like, what?\n\nThat's it? I want more. So, I'm really, I have a lot of like kind of things on fire that feel very high stakes and kind of almost too triggering for me to practice in a relaxed way.\n\nI'm practicing more in an intellectual way. So I'm finding that the low stakes stuff is where I can really like feel bodhichitta. And I'm like thinking about what you said a couple weeks ago about how it has to be 100%.\n\nLike, non-bodhichitta will win. So it's like 51%. I don't really know the math, but basically, it has to be 100% bodhichitta.\n\nIf there's like a little bit of non-virtue, like it doesn't, like the non-virtue will always win over bodhichitta. So, in those like small stakes moments, I can just like relax and just have it, have a whole mind of bodhichitta. Whereas, if I'm on the subway I'm like, oh, but the good thing is like, if I'm in the other trickier situations, I'm like, oh, I don't have 100% bodhichitta.\n\nThat's okay, but it's been helpful to be like, oh, I'm judging that person's outfit so I can have bodhichitta right now. But not trying, just like observing."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "47:15",
        "text": "Thanks. Yeah, yeah. Yeah, no, I appreciate what you're sharing here, Joanna, about like practicing in these seemingly low stakes situations.\n\nBecause, yeah, what I've personally found is very similar to kind of what you're describing, which is there are certain situations that are really hard to practice specific dharma techniques in. but usually because those are the most difficult things in our life, those are the things that we're slapping our dharma techniques against. And then we go on autopilot in the easier times, because we're like, pff, this is nothing.\n\nAnd even in nice times like going for a walk, or just going shopping, or hanging out with friends, or relaxing a little bit. And so it's like we pull out the dharma tools in the fires of our day, but then like in all these moments of relative calm and tranquility we kind of put them down. And it really is often like the opposite is probably the better tool, which is do it in those times of relative calm and tranquility and even nice moments.\n\nBecause that's actually where we get a lot of feeling for them. And we build up like a reservoir of peace. That then allows us to actually navigate those fires of life.\n\nAnd so for example, whenever I teach on patience, I often say to people patience is a mind that wholeheartedly accepts whatever is arising, having given up the idea that things are other than they are. So like when you walked down the street to the Dharma Center, which is a relatively low-stake experience, you're just walking down the street to the Dharma Center. It's actually a nice moment in the week, probably.\n\nLike were you wholeheartedly accepting the way things are, having given up the idea that they should be other? Right? Or was there a thought like ugh, it's a little cold.\n\nUgh, why didn't they shovel the sidewalk over here at the Salvation Army? You know? Why didn't they do that?\n\nThey left all the ice there. Or ugh, it's turned red, the light. I'm going to have to wait.\n\nYou know? Just these little thoughts. And like even though they're really low-stakes, they're actually moments of non-acceptance.\n\nEvery single one of them, right? So it's like are we actually practicing wholeheartedly happily accepting every single one of these little moments? And if not, fantastic.\n\nThat's a great area to practice with. That's not a small thing because we're not even doing it. It's actually not small.\n\nIt's big because it's not happening right now. That's actually our level of practice right now. And once we do it there, we start to feel inspired.\n\nWe feel whole. We just feel like full. And then when those fires hit, we got something to call on.\n\nSo anyway, I'm just sharing a sort of agreement with this kind of way of practicing. Thank you. Others, please?\n\nDavid, yes?"
      },
      {
        "speaker": "Student",
        "time": "50:39",
        "text": "This is a little similar to Adriana's, but the method for getting there was the practice of seeing things as a gift. I guess you use the word gift. I use it more as the word test.\n\nBasically, seeing everything that happens to me is like a test for my mind. And when I remember to do it, it was amazing. So many times, I'd just be upset about something, usually kind of low-stakes things, maybe something at work.\n\nSomebody said they were going to do something and didn't do it. And then all of a sudden, I remember, wait, maybe this is one of those tests. And all of a sudden, it's like no problem at all.\n\nSo just trying to remember to do that is like a massive patience exercise. Maybe I like turning into a little bit of a game or something like that. All of a sudden, it's like how virtuous, how much can I accept this situation?\n\nThere's a little bit of a purification, I think, that happens too. You accept something that you wouldn't have previously accepted. It's like all this negativity in my mind somewhere, and I feel like when I accept it, it's like putting out this little fire someplace.\n\nIt feels really nice."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "51:50",
        "text": "Yeah, thanks, David. Fantastic. Yeah, so you're using the idea of reliance on a spiritual guide and feeling like everything arises like a little test from our guru to help us purify or train our mind.\n\nYeah, I'm with you. I think that label is actually quite useful. Like, ooh, this is an exam, a little test.\n\nLike, come on, let me see if I can do it. Let me see if I can pass this test, dealing with this annoying person or this challenging situation or whatever. And it just makes it a lot more fun and jovial.\n\nYeah, you're right. When we can actually accept, then it does feel like we've purified that karma. It's like burned off.\n\nThank you. Mimi, then Fran?"
      },
      {
        "speaker": "Mimi",
        "time": "52:33",
        "text": "Hi. So this week, what I did for my practice was to ask the guru to help me with whatever was needed. And I was like, okay.\n\nI was like, just bring it on. Just bring it on. So whatever it is, I'm going to answer the call.\n\nAnd so Monday was fine. I kept saying, okay, Geshe-la, I'm waiting for the call. Tuesday, Wednesday, Thursday, I was like walking around my lunch hour, listening to Heart Jewel.\n\nAnd I'm just like, oh, how happy can be? And then I get back to my office and I look on my phone and there's this message from this person. And it was so mean.\n\nIt was so mean. And I was completely shocked. I was like, oh, my God.\n\nLike, what is wrong with this person? And I won't go into the details. They're a little bit personal.\n\nBut what I did was I was like, okay, this is the call. This is Geshe-la's call. How do I act?\n\nAnd so I decided I'm just not going to react. I'm not going to react to this anger. I'm just not.\n\nAnd I shut it down and I actually blocked this person. And I just said, well, I'm just going to pray. I'm just going to pray for them and process it differently.\n\nBut I think the message for me was like Geshe-la or the guru just saying you have attachment in this particular area and these are the last vestiges of this attachment. So how are you going to deal with this mean, you know? And I was like, yes, I'm ripping it apart.\n\nThat's it. Cut, cut, cut. I'm so happy.\n\nBut I don't think this week I'm going to do that practice. I'm going to take a little break. I'm going to decide on something else.\n\nThat's my report."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "54:58",
        "text": "Yeah. Thanks, Mimi. Hopefully none of you got blocked by Mimi this week.\n\nWe're all like, oh, darn. She didn't respond to me on Thursday. Yeah, that's great, Mimi.\n\nI think it's lovely. I know what you mean in these situations. Sometimes something has to just completely blow up for us to just let it go.\n\nAnd that's often actually a good gift because our attachment or whatever is like holding on and kind of greedily holding on even though the whole thing is burning down. And we're just like, no, I don't want to let go. And then it just absolutely blows up.\n\nAnd then it just allows us, it's kind of painful, right, but it's a gift because we just drop it and then we're free. And on the other side we feel some relief. Sometimes it's worth it to just blow it up.\n\nDon't purposely blow it up, but if it does blow up, let it blow up and drop it. Yeah. Thanks.\n\nFran, yes, please."
      },
      {
        "speaker": "Fran",
        "time": "56:14",
        "text": "So my ongoing six-week succession practice has been, was really great this week. I'm just becoming more and more just remembering to rely on my spiritual guide. Every issue I have.\n\nSo the benefit that I was really focusing on this week was the power of protection from fear because I'm a very fearful person and it really holds me back in a lot of ways. And I've been saying this prayer to Geshe-la for weeks now, six times a day. And it's been so helpful and realizing that the fear is self-cherishing and that it's a state of mind.\n\nAnd just, so what I've been doing whenever I feel anything, any anxiety arising or any fear, just asking for blessings to Geshe-la to please bless me to do whatever I have to do to not feel this way, to remember that it's self-cherishing. And this past week during an acupuncture session, I had a little visitation as the same as if in a dream from my mother. And I've been working on some, thinking about things a lot about how my mother impacted my life and why, trying to explain why I'm the way I am because of things that my mother did.\n\nAnd I had a conversation with her about certain things and a lot was resolved in that. And I believe it was a blessing from my spiritual guide. And at the end of this little visitation, if you will, my mother became Tara and Vajrayogini and Prajnaparamita.\n\nAnd I was like, oh, that's right. They're all the same nature. My mother is the same nature as Tara and Tara's here protecting me.\n\nSo I have to stop just sort of like making excuses for my behavior because of something my mother did 30 years ago or 40 years ago or 50 years ago. And it was such a blessing from my spiritual guide that I just, I walked through, I've said this once before, I walk through life now just feeling as if he's with me all the time. When we first started the six-session practice, you had, Kadamkhal, you had said that it was something that was going to change our lives or change our practice or change our lives.\n\nAnd it really has done that for me. So much gratitude."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "58:52",
        "text": "Thank you, Fran. Yeah, that's beautiful. I think there's no words I need to say about that.\n\nSo that's just, that's lovely. Thank you. I appreciate it.\n\nYou really stuck with it. You really stuck with the practice. You worked on it.\n\nYou let it evolve. You refined it and so on. And it's demonstrating the effects that it has because it's quite a cumulative one.\n\nIf we do stay with it. It's a simple ask. It's actually not a big-time ask in the day.\n\nIt's just about the consistency and staying with it. And then we see the effects eventually. Thank you.\n\nAnything else from the crowd? Field? The homies?\n\nHomettes? Nada? Okay."
      },
      {
        "speaker": "Student",
        "time": "59:39",
        "text": "Oh, Brian, yeah? Just a quick comment. I was actually mad at Salvation Army earlier.\n\nOh. And by the way, you can, the same thing, not just outside, even in the center, could also be the same thing what you said. Non-acceptance wholeheartedly.\n\nI mean, you can be attached, okay, this is your coffee time, and the teacher gives you a job, and suddenly there's non-acceptance. For example. Just theoretically.\n\nYou know, this morning, I was like, after assisting everything, okay, now it's my time for coffee before Harjo. And like, okay, the assistant came late. I mean, not the assistant.\n\nThat was who was supposed to do the offerings of the shrine. So we had to do it quick. And I was like, the teacher tells me if I can do the, change the bowls, the water.\n\nAnd I'm like, at first my miserliness came in. Like, you know, my time for coffee now. But then I said, no, I'm going to do it.\n\nIt's going to help me against miserliness. But yes, that's just a reminder that even in the center, you can sometimes have the unwholehearted acceptance."
      },
      {
        "speaker": "David",
        "time": "1:01:11",
        "text": "Yeah."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:01:18",
        "text": "Okay, very good. Let's take a look at the text. And just a reminder, so we're not here next Sunday, and the Sunday after that.\n\nSo we'll be off for two weeks. So maybe something that we can focus on in the second class today is a bit about wrapping up the year spiritually. Because it's nice to bookend things.\n\nAnd like reflect a little bit on what we learned about ourself and our practice from the year. And how we kind of want to integrate that going forward. Because we always want to be kind of practicing at the cutting edge of our practice, right?\n\nThe cutting edge of our practice isn't always the cutting edge of where it's always been. It's where it is today, right? That's the cutting edge of our practice.\n\nThat's where we want to be. We don't want to be in an abstracted place like over here, in some sort of theoretical world, when maybe the delusions we're facing are like right here. There are certain delusions, certain problems we're dealing with, certain challenges we're dealing with.\n\nThat's where we want to be practicing, right? And so it's very useful to kind of do these semi-regular check-ins. We try to do it every day if possible, at night time.\n\nBut if you can't do it every day at night time, then doing it somewhat regularly. To just see, okay, what was sort of like some highs, what were the spiritual highs of this year? What were some lows from the year?\n\nAnd then, what did I learn about myself this year? What are the lessons I learned about myself and my practice this year? And where am I at right now?\n\nAnd what's going to be that next step for me, based on where I'm at right now? It's just a sort of interesting thing with Dharma, because it's so interesting and evocative, it is very easy to just enjoy thinking about it, pondering it, but not necessarily looking at our specific delusions that are causing us problems right now, today, with the people in our life. And it's just an interesting thing, because not everything is like that, but it's interesting enough to engage us like that.\n\nBut we all love Dharma, and it's actually possible for our practice to be a bit like this, where we're thinking about it, but then at the same time, the delusions that we have on a day-to-day basis aren't getting looked at. I like to write some little Dharma thoughts each day, just as a way for me to contemplate in an organized way, and kind of make sure it happens each day. And what I try to catch for myself is, when am I talking about pondering something totally theoretical, versus my actual delusions that are occurring that day.\n\nGoing, meh, meh, meh, they did this. Meh, meh, meh, I did that. It's like, okay, now I'm talking about some theoretical thing, or pondering some theoretical thing, but I'm not looking at this whining mind that I have, which is actually what I'm dealing with, my whining mind, my critical mind of other people, my judgmental mind, my attached mind, right?\n\nAnd for me, it's just very helpful to say, oh, that's actually the cutting edge of my practice for today. That's actually where I'm at. That's where I want to be digging in.\n\nAnyway, sorry, this is for the next class. After the break, we'll kind of talk about this in more detail. But the main thing is, what did we learn about ourself from this year?\n\nMaybe some highs, some lows, spiritually. And then, where are we at today? And what's that next step for our practice, like tomorrow, right, for us?\n\nOkay. So page 28, starting with the paragraph, if we are to engage. Sukesha says here, if we're to engage in the actual development of bodhicitta, we need strong inspiration.\n\nAnd this is only acquired by reflecting on the many benefits of this mind, of bodhicitta. If we knew of a king who had great wealth, power, and knowledge, we might easily think, how wonderful it would be to become like him. Such a desire arises only because we have seen the good qualities that king possesses, and therefore we wish to emulate him.\n\nSimilarly, first we must understand the good qualities of bodhicitta, and only then will the thought arise how wonderful it would be to give birth to such a precious mind. At present, however, if someone were to ask us which we would prefer, to develop bodhicitta, or possess a nugget of gold, I'm talking a big nugget, not a wimpy little nugget, you know, enough that it would interest us, you know, we would go to the cash for gold place, you know, and we'd already be planning it out, right, ready to bring our nugget there. We would certainly choose the gold.\n\nWe're like, no I wouldn't, I'm on TTP. I wouldn't choose the gold. Okay, what do you think about all day?\n\nRight, if someone looked at your thoughts all day, how many of them have to do with your, like, occupation and making money? And how many of them have to do with developing bodhicitta purposely? And if it's not gold, it might be being liked, it might be some pleasure, it might be, yeah, some pleasure, yeah.\n\nSome, yeah, like reputation, praise, whatever the thing is, yeah. So, it's just helpful to see, like, if someone actually looked at the download of our thoughts from the day, like a document with all of our thoughts, would they say, like if they looked at Kyle's thoughts for the day, they say, is Kyle more interested in gold or bodhicitta? Right?\n\nAnd then they would look. They'd tally up the thoughts. How many thoughts were about scheming to grow my bodhicitta today?\n\nAnd how many thoughts were scheming to grow maybe one of the eight worldly concerns? Right? And just check, right?\n\nSo we just ask ourselves, what's going on in our mind, you know, for real? This is because we see the valuable qualities of gold, but fail to see the incomparable qualities and benefits of bodhicitta. If we understand these benefits, our choice would be different.\n\nWe would realize that while gold is easily obtained, no amount of money in the world can buy bodhicitta, something not found for sale anywhere. The only way to obtain the precious bodhicitta is to develop it ourself through long meditation. Until we develop a continuous and spontaneous aspiration to develop bodhicitta, we should spend much time contemplating its benefits in general.\n\nFrom Shantideva's list of ten benefits, we should select the one that has the strongest positive influence on our mind and meditate reflectively upon it. For such a meditation to be of greatest value, it should be continuous and concentrated. Then at the close...\n\nOops, sorry. For such a meditation to be of greatest value, it should be continuous and concentrated. Okay, so...\n\nHas anyone memorized the ten benefits of bodhicitta? Okay, we got Adriana's hand was up first, I think. Yeah.\n\nDo you actually want to share them or no? You don't have to. Okay, let's chuck her the mic.\n\nYeah, yeah."
      },
      {
        "speaker": "Adriana",
        "time": "1:10:10",
        "text": "Yay! Okay, the conquering of all evil, the attainment of the sublime happiness, bodhicitta has a special name and meaning, the transformation of the inferior to the supreme, the value of the precious bodhicitta, which is difficult to find, the indestructible and inexhaustible fruits of bodhicitta, the power of the protection from fear, the... Okay, I know the last one is about the scripture, precious scripture of benefits of bodhicitta, and the other is...\n\nOh, this is my favorite one. I don't know how I forgot it. The swift and easy destruction of...\n\nI think of it as all negative karma, but I know it's a different word. Yay!"
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:10:56",
        "text": "Bingo. Sounds great. I'm so happy.\n\nOkay, we won't make everyone go through. That'd be fun. Everyone in class go one by one.\n\nPass. That'd be actually kind of good, actually going one by one through each one of us. I just didn't care.\n\nThank you. I was doing other way more important things and knowing why bodhicitta is a good idea. No, we won't do that.\n\nNo, I'm sure we would all perfectly recite them in Sanskrit and Tibetan and in English. Because why not? Ryan, did you have a hand there?\n\nNo, I was..."
      },
      {
        "speaker": "David",
        "time": "1:11:50",
        "text": "I didn't hear what you said."
      },
      {
        "speaker": "Student",
        "time": "1:11:51",
        "text": "Thank you. I was complaining about Salvation Army."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:11:55",
        "text": "Oh, yeah, okay. Let's get him the mic. Yeah, yeah, yeah."
      },
      {
        "speaker": "Student",
        "time": "1:11:59",
        "text": "Come on, confess. Let's get the confession."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:12:02",
        "text": "Yeah, yeah, yeah."
      },
      {
        "speaker": "Student",
        "time": "1:12:03",
        "text": "Let's get it. And I confess for the three jewels. I don't remember the ten things.\n\nI was more busy with my comfort, including the Salvation Army ice. Why, you know? Yes."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:12:19",
        "text": "Much more important, the fact that the Salvation Army people don't clean their ice. Yes. Thank you.\n\nThanks, Ryan, for being a good sport. Okay. Then, at the close of the meditation session, we should repeat the prayer originally cited in the introduction to this commentary.\n\nMay the precious Supreme Bodhicitta grow where it has not yet grown. Where it has grown, may it not decrease, but flourish forevermore. By reciting this prayer, we're stating our desire to give birth to Bodhicitta as quickly as possible.\n\nWe can recite this prayer after performing any virtuous action. We should remember that without Bodhicitta, whatever powers we may have and whatever miracles we may be able to perform are of no real benefit. Being able to fly in the sky is of no importance.\n\nEven birds are able to do this. Would you rather fly in the sky or have Bodhicitta? We've had such miracle powers and clairvoyance many times in our previous lives, but what have they done for us?\n\nNow is the time to control our untamed mind with Bodhicitta. With Bodhicitta, the mind is made peaceful. Enlightenment and fulfillment of all our wishes are not very far away.\n\nIt is important to remember that we cannot attain enlightenment if we do not first acquaint ourselves with and then master the methods for developing Bodhicitta. We must practice these methods as diligently as possible, all the while exhorting ourselves to generate this precious attitude. Nowadays, with the world in turmoil, there's a particular need for Westerners to cultivate Bodhicitta, a.k.a. everyone. If we're to make it through these perilous times, true Bodhisattvas must appear in the West as well as in the East. Okay, so this feeling that we're trying to develop here is this powerful desire to grow our Bodhicitta mind. So when we're thinking about this, we're trying to figure out what are my specific obstacles to its cultivation.\n\nFor me, what are my exact obstacles? This is a good thing to do with any Lamrim meditation, or any meditation in general, and it's something we always want to do when we're teaching Dharma, is to think what are the obstacles for the people who are coming to the class about understanding this. What are their obstacles?\n\nBecause from one point of view, if we fully appreciated Bodhicitta, and we didn't have obstacles to its development, we would just develop it now. We'd just do it, because it's the most no-brainer thing to do. You're just done with samsara, you'll be enlightened in no time, you'll forever be happy, you'll be able to actually help your friends and family, you'll actually be able to make a difference in the world.\n\nIt's the most no-brainer thing in the world. It's just so obviously a good idea. But we're not doing it, right?\n\nIf we're still in samsara, we're not doing it. So there's an obstacle, or two, or ten, or whatever. And so we want to figure these out, what these are for us.\n\nSo there's lots of different obstacles that could be. Generally, we kind of want to start with things like faith, around faith. So it could be like a believing faith issue in bodhicitta, like we don't believe in it.\n\nThat could be we don't believe in bodhicitta, specifically, or we don't believe in enlightenment. Or we just only somewhat believe in enlightenment. So there could be like a believing faith issue.\n\nThere could be more of an admiring faith issue, like we're not that interested in it. If there was a course on tantra, if there was a course on emptiness, we'd go, ooh, yeah. If there's a course on bodhicitta, no.\n\nNot interested, thank you very much. Got other things going on. So do we admire bodhicitta in the same way we admire other dharma realizations?\n\nOr is it just simply like not much of a wish? Maybe we think, yeah, agreed. Good idea.\n\nYeah, I kind of believe in it. Yeah. But there's just not a powerful desire to cultivate it.\n\nSo we can always start there, right? Whenever we're looking at our obstacles, we can kind of go through three types of faith and see, is there this? Is there that?\n\nIs there this? Is there that? So that's like one bit.\n\nThen, we can kind of go into effort next. So with effort, we can go to the different types of laziness and just check, are these there? So there's the laziness of discouragement.\n\nThis is the most classic one. Basically, we don't feel we could change or we feel something is too high for us or things haven't been going well in our practice or we think that we're stuck in some way or something just doesn't work anymore or it's like a discouragement about like the Buddhas and their ability to help us or even in the truth of what they teach or even discouragement around our Sangha or our spiritual guide. So there's all sorts of permutations on discouragement.\n\nThere's also procrastination, which is like, I'll do it later. I've got more important things to do right now. Thank you.\n\nI can't deal with bodhicitta. I've got to work. I've got to make some cash.\n\nI've got to deal with this area of my life. Or I've got to do other practices. I've got to do other activities and then I'll get around to the bodhicitta.\n\nSo there's procrastination. Then there's being attached to what's meaningless and non-virtuous, which is basically, I just think other things are more interesting, frankly. I just like other stuff more.\n\nI just like other things more than bodhicitta. I like TV more. I like hanging out with my friends more.\n\nI like, you know, going to this activity more. You know, whatever. I like, who knows what, more.\n\nSo it's a laziness, right? Because it basically makes things that are not those activities seem unpleasant. Because they're getting in the way of the fun parts of our life.\n\nSo they're burdensome. Ugh, Jeff. Jeff's got to generate bodhicitta.\n\nUgh, I've got to go to class. Ugh, it's getting in the way of all the fun things I'm doing as I lock myself into my little prison cell for millions of more lives. And samsara.\n\nI'm having so much fun doing this. Can't be bothered. Anyway, that's laziness of being attached to what's meaningless and non-virtuous.\n\nAnd then the laziness of indolence, which is just like being attached to immobility and sleep and inactivity. Obviously we need sleep, need rest. We can become so preferential towards it that we just don't want to do anything particularly.\n\nIndolence, yeah. So it's helpful, right? You just take your practice of developing bodhicitta and just run from the lazinesses.\n\nOkay, laziness of discouragement. Where are you? Okay, you're here, you're there.\n\nOkay, I know you with this, I know you with that. Great. Got that obstacle down.\n\nRight, laziness of procrastination. Putting it off, et cetera. Okay, good, got you.\n\nLaziness of being attracted to what's meaningless and non-virtuous. Okay, that's how that functions. Laziness of indolence, okay, that's how that functions.\n\nSo we're just kind of seeing the different obstacles at play here. So we can always go to the faith challenges. We can always go to the effort-based difficulties and challenges.\n\nThen there's just a couple other little bits and pieces. That are worth looking at. One is just simple distraction.\n\nAnd the issue with distraction is it just makes all Dharma uninteresting. Like Dharma loses its magic and its luster if we're in a very distracted state. And it's just simply that our mind can't absorb long enough to taste the magic.\n\nAnd this is just, it's a very tricky thing to break out of, right? Because our mind is so busy and rapid and constantly wandering towards delusions. That even just sitting down and being quiet it's just being locked up like with a madman.\n\nWith just like rapid, deluded thoughts. Sitting down to meditate is that. This is not fun at first, right?\n\nIt's just, ugh, I don't want to do that. Sounds like the worst idea ever. I need to be busy.\n\nI need to have people to hang out with. I need things to do. I don't want to be hanging out with my delusions all day.\n\nIt's so painful. It is. So it's quite a tricky trap to kind of break out of, right?\n\nAnd usually what happens is that in a distracted mindset our mind becomes sort of so agitated and unhappy that it feels that the only way to escape is more distraction. So there's like a sort of self reinforcing effect of this. Which is like my mind's in pain.\n\nIt's so agitated and distracted. Ah! Okay, sitting alone with that.\n\nNo way! That's too painful. More distraction?\n\nOh, that actually feels good because now I'm not facing it. Phew! I'm on the hedonic treadmill.\n\nI'm like going, going, going. I've got this going on. I've got that going on.\n\nGreat! I'm not facing the pain of it. Right?\n\nSo we've just got to keep upping the dose until catastrophe. There's only one way that one goes. Which is down hard.\n\nSo anyway, we can check like what degree of maybe our obstacle in our bodhicitta or any lamrim meditation. It's just simple distraction. We've gotten stuck in a distracting loop in our life around distracting habits.\n\nOf course the devices are the biggest culprit but there's other things too that are related here. So we can kind of check there. There's that obstacle.\n\nAnyway, we can kind of keep going on forever about this but the last one for now is just our renunciation obstacle. Because bodhicitta basically is like renunciation for others. It's kind of like that.\n\nIt's just like having renunciation on behalf of others. And we can only have renunciation on behalf of others if we have renunciation sort of on behalf of ourselves. There's lots of different reasons for this.\n\nOne is that we actually see the clear solution when we have proper renunciation. And this gives us the clear solution for others. But if we don't understand precisely how others become liberated from suffering, then our bodhicitta is always going to be lacking power and vision.\n\nIt's going to be missing the part, the answer. And usually it's because we think we're somehow liberating inherently existent living beings. Which is an impossible task.\n\nSo it's a renunciation that actually gives us the insight into our own liberation. And once we realize that, we realize it's realizing emptiness. That's liberation.\n\nThere was no inherent person ever in the first place. Then we realize, oh, my bodhicitta isn't about liberating inherent people. There are no inherent people.\n\nOh. It's about liberating mere named people. That's a very different operation.\n\nIt's a much easier operation to liberate mere named people. Anyway, as we develop proper renunciation, it informs the bodhicitta. This is one aspect of it.\n\nThe other is just that it gives us the kind of drive and the power. Because we just find samsara completely repulsive and uninteresting. And we feel this on behalf of others.\n\nSo they're going through that. But there are huge stakes. There are huge stakes.\n\nThis is kind of like, I think, part of Sumit's point earlier. There are huge stakes for others in our practice. And we do care.\n\nAnd we should care. And so, the more we see the stakes for ourselves, which comes from our renunciation and contemplating specifically the seven sufferings of human life, birth, sickness, aging, and death, encountering what we don't like, being separate from what we do like, and failing to satisfy our desires. Once we see the stakes for ourselves, then, of course, we'll see the stakes for others.\n\nAnd that will give us the drive there. So, the point is, sometimes a bodhicitta issue is just a renunciation issue. There's a renunciation deficiency there.\n\nAnd all we've got to do is up our renunciation game a little bit. So this is just an example of how you would go through identifying obstacles. And what's important about this activity is that if we just take a meditation and we're hammering at it, which means just doing the meditation a lot, but it's not going anywhere, it's much more skillful to identify what are the obstacles at play.\n\nLet me undo the obstacles and then when I revisit the meditation, it might just be easy and simple. It's sort of like meditation is less like an amazing, beautiful jewel. And the obstacle is this concrete barrier that's been fused around it.\n\nAnd we're trying to grab that jewel and we're just blooding our hand on that concrete barrier. And we don't realize, oh, there's just this huge obstacle in my mind. Oh, I just have to break the obstacle.\n\nBut if we're just trying to let go for the jewel without cracking open that obstacle, it can end up just being very frustrating. And our practice can become something that's just really frustrating and upsetting even. And that's such a disappointment because we worked so hard to build it up.\n\nWe don't want it to get into those spaces. This is just an exercise that we can do with any meditation, but I'm just trying to illustrate it with respect to bodhichitta."
      },
      {
        "speaker": "Anne",
        "time": "1:30:34",
        "text": "Anne, please. I noticed when you were going through the obstacles, in particular the laziness of attachment, I got really defensive. And I started having an argument with you in my mind."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:30:49",
        "text": "Sounds fun."
      },
      {
        "speaker": "Anne",
        "time": "1:30:51",
        "text": "Going through my week and explaining."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:30:53",
        "text": "Yeah, yeah, yeah."
      },
      {
        "speaker": "Anne",
        "time": "1:30:55",
        "text": "And I realized I didn't want to admit these obstacles because I felt like there was nothing I could do about them. So I just wanted them to not be true. I don't want to admit that I have these attachments that get in the way because I feel like maybe in the long term there's something I can do, but in the short term there's nothing I can do.\n\nIt's just really hard to be very clear and be like, yeah, these are the obstacles. Okay. You know?\n\nI'm not trying to point out where I'm a bad person or doing something wrong. It's just like, this is what's in the refrigerator. And that's really hard.\n\nIf I don't do it that way, I'm not going to even admit what the obstacles are. It's really tricky."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:31:40",
        "text": "Yeah. I know exactly what you mean, Anne. Part of our practice is getting really skilled at doing this and being able to see our obstacles totally objectively but without the tiniest bit of self reproach.\n\nNot even the tiniest bit. Maximum kindness to oneself and maximum honesty. And that's a really sweet spot to be in.\n\nBut it's just a bit tricky. Because we have a lot of psychological defense mechanisms against seeing the truth in our mind for different reasons. And sometimes maybe that's the obstacle.\n\nThat's a whole other bag of worms that we can investigate. yeah, learning how to do that is really, really important. Not that long ago, I had this dream night after night after night of these different people I've harmed in my life.\n\nThis is a very strange thing. Each night I had a new dream of another person I had harmed in my life. And at somewhere around the fifth or sixth night of it, I was like, oh my god, I'm having this weird purification thing going on.\n\nOf how I actually fully purified. And they were people from a long time ago. But they actually purified that karma around this person and that person.\n\nIt was interesting because not exactly. I spent a lot of time doing purification practice. It was a humbling moment for me.\n\nEven though I'm really trying. Really trying to purify my negative karma and be honest about my delusions and my problems and this and that. I'm really giving my all.\n\nStill, there are these people, especially from my childhood and so on. It's like, I've harmed, but I haven't actually purified that yet. So why not?\n\nWhy haven't I been honest with myself about that? What am I trying to hide from? And it just was very touching to see that.\n\nIt was humbling too. I have a long way to go. For some reason my mind can't even look at that right now.\n\nI have since purified that. But I'm sure there are other things that will keep coming up over time. Anyway, just to conclude, we want to have this skill of being maximally self-honest and maximally gentle.\n\noften, once we fully inhabit that, more little truths bubble up in our mind. It was almost like our mind wasn't letting us see those things because it was afraid of the self-reproach that would set in. So we're actually able to really start to look at all those little bits and pieces at that point.\n\nAnyway, that's good. Marianne, last thing, and then we'll take a breather."
      },
      {
        "speaker": "Anne",
        "time": "1:35:06",
        "text": "Just saying that sounds really painful, but I know what you mean. The ghost of Christmas past. I was just thinking lately more so like there's so much suffering.\n\nIt's like I was buying a coat. Okay, there's down. Then I'm suddenly thinking about the thousands or millions of geese had an untimely death.\n\nI'm like, okay, there's all that suffering so then you want to well, that leads to renunciation, but you don't want to get just a negative renunciation. So then you try to balance that with faith that enlightenment's possible, and then you kind of hit the bodhicitta. Or you go, it's all empty.\n\nI don't know what I'm trying to say. It gets kind of complicated."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:36:03",
        "text": "Yeah, it's like with a recipe you know, you like, you make a soup or something like that, and then you have your friend taste it and they're like, it's like missing something, and then you're like, okay, let me sprinkle a little whatever, some soy sauce in there, some salt or whatever, and then you're like, no, that was a little salty, and then they put like a little acid in there, like a little lime juice or lemon or a little vinegar or something. Oh, that is better, but now it's a little tart, and I don't want to, okay, what's going to balance the tartness?\n\nYou know, and there's like this balancing act, and it's the same with actually most of our lamrim meditations and our relationship with our different meditations. It's like you're trying to balance a recipe. You get in the right mix, and there's a sort of like cocktail or like set of ingredients of mental factors and mindsets inside of us, and usually they're a little bit out of whack, and we have to adjust them, and as we kind of adjust one, it goes a little too high over here, and then something else goes a bit low, and then you've got to adjust that, and then this one goes a little bit low, and you just tinker with it, and if we treat it as a fun game, then it's a delight, or like a little puzzle, then it's a delight. If we treat it as a burden, and in an angsty and frustrated way, then it's incredibly annoying to do this.\n\nAnd so, we just have to kind of learn how to balance our mind in this way, and this is a big part of dharma practice, like knowing what, like how we're unbalanced right now, and what we're going to do to rebalance, and we might try that out, and it might actually tilt us a little bit too far, and then we have to have maybe a third thing, right, that sends us slightly the other direction, and as we build out our dharma tools, our arsenal, our ingredients, whatever the analogy is, then we're able to kind of like figure out how to do this quite skillfully. Anyway, thank you. Okay, so in the next class, we'll start off with a meditation, just pondering, okay, what are the obstacles for me to developing bodhicitta?\n\nAnd we'll just spend five minutes pondering that. If you want to talk about it, or discuss it in the break, that's great too. And then we'll spend a little bit of time on, like a little bit in the text, but then we'll talk about sort of an end-of-year investigation.\n\nAlright, I think that's it. Just a reminder, two things. 24th, there's an afternoon with the Buddha of Compassion and Adriana.\n\nSo it should be a fun time here. So if you want to do something Christmas Eve, 24th, whatever, come along. It should be a very meaningful time.\n\nAnd four, is it four? Two to four. Okay, sorry, two to four.\n\nAnd then New Year's Eve, we'll be here. This year we have live music. Very exciting.\n\nWe're upping our game. One of our Dharma music. If you see it as Dharma, then everything is Dharma music.\n\nOkay. Yeah, with Fred, he's one of our FP members, but anyone who's above average musically is welcome to join. Which I think is self-selecting, because you probably won't offer if it's going to be terrifying for everyone.\n\nNo, I'm just kidding. Anyone who wants to join. He said he could make it work for anyone.\n\nSo, come along. That's seven to nine New Year's Eve. Let's dedicate and then we'll come back at 6.15. Okay, we can think to the virtues we've collected through practicing, meditating, discussing. May all living beings find lasting peace of mind, enlightenment."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:40:37",
        "text": "We can make some personal prayers and dedications."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:41:01",
        "text": "We can think, may the precious bodhicitta grow where it has not yet grown. What has grown may not decrease, but flourish forevermore."
      },
      {
        "speaker": "David",
        "time": "1:41:35",
        "text": "Okay, thank you. Thanks. I was like, you know, I was like so excited."
      },
      {
        "speaker": "Michael",
        "time": "1:42:13",
        "text": "Because I feel like I never memorized anything."
      },
      {
        "speaker": "David",
        "time": "1:42:16",
        "text": "You did so well."
      },
      {
        "speaker": "Michael",
        "time": "1:42:17",
        "text": "I was like, I'm not going to be like David. I'm not going to be like old Adriana. I tried and I just didn't get it.\n\nNo, no, no. You can do it. Look, you just need this little card."
      },
      {
        "speaker": "Student",
        "time": "1:42:29",
        "text": "Yeah, you need to make just the list."
      },
      {
        "speaker": "Michael",
        "time": "1:42:31",
        "text": "I tried to do it just by looking at the pages. That's a different list, first of all. Yeah.\n\nYou just have that and then you can say I'm washing the dishes. Yeah, that's my phone. I put my phone in while I'm washing the dishes.\n\nYou've got to find the ones that catch the worst like the most evil, the slime. And then just go and you have that time. You know?\n\nSpring Festival? Where is it?"
      },
      {
        "speaker": "Student",
        "time": "1:43:07",
        "text": "I'm doing this."
      },
      {
        "speaker": "Michael",
        "time": "1:43:09",
        "text": "I have an Airbnb, actually. Yeah. I'm supposed to go to work on your show.\n\nI think I've been here from like the 31st to the 18th."
      },
      {
        "speaker": "Byron",
        "time": "1:43:26",
        "text": "So it's like eight nights. Yeah."
      },
      {
        "speaker": "Michael",
        "time": "1:43:28",
        "text": "I'll send it to you. I got an Airbnb."
      },
      {
        "speaker": "Student",
        "time": "1:43:38",
        "text": "It's pretty fancy. Do you have a space there?"
      },
      {
        "speaker": "Michael",
        "time": "1:43:41",
        "text": "Yeah. It's only two weeks. I just got it the last eight nights.\n\nWait a second. What about the festival, the US festival? I talked to Jeremy."
      },
      {
        "speaker": "David",
        "time": "1:43:57",
        "text": "Oh, I remember."
      },
      {
        "speaker": "Michael",
        "time": "1:43:58",
        "text": "He was talking about the US festival there. Yeah, I'm very excited. Where is it in Geneva?\n\nIs it within walking distance? It's been an hour since the last time I walked there."
      },
      {
        "speaker": "David",
        "time": "1:44:21",
        "text": "That was the thing when I was..."
      },
      {
        "speaker": "Michael",
        "time": "1:44:25",
        "text": "because we went to a conversation between a nice car. We showed it up. Where did you stay?\n\nWe stayed at the temple. There's no taxis. They only operate during festivals.\n\nOh, really? To leave the grounds? I meant to leave to get there.\n\nFrom where? From the train station."
      },
      {
        "speaker": "Sumit",
        "time": "1:44:47",
        "text": "Really? There's no cabs? No.\n\nThere was a little guy and we were like, oh no, it's Easter."
      },
      {
        "speaker": "Michael",
        "time": "1:44:57",
        "text": "What did he take to show? So I walked through the little town and I got a pizza and I called the guy. I didn't know what they were planning to have.\n\nI got the phone. I called him. Do you remember the best time ever to walk to the town and then you were not able to talk?\n\nIt was so nice. I was really sad. We had a lot of fun.\n\nThere was only one house working and it was Easter."
      }
    ],
    "mainTeaching": []
  },
  "session2": {
    "chantedPrayers": {
      "time": "2:25:00",
      "text": "LIBERATING PRAYER\n\nO Blessed One, Shakyamuni Buddha,\nPrecious treasury of compassion,\nBestower of supreme inner peace,\nYou, who love all beings without exception,\nAre the source of happiness and goodness;\nAnd you guide us to the liberating path.\n\nYour body is a wishfulfilling jewel,\nYour speech is supreme, purifying nectar,\nAnd your mind is refuge for all living beings.\n\nWith folded hands I turn to you,\nSupreme unchanging friend,\nI request from the depths of my heart:\n\nPlease give me the light of your wisdom\nTo dispel the darkness of my mind\nAnd to heal my mental continuum.\n\nPlease nourish me with your goodness,\nThat I in turn may nourish all beings\nWith an unceasing banquet of delight.\n\nThrough your compassionate intention,\nYour blessings and virtuous deeds,\nAnd my strong wish to rely upon you,\nMay all suffering quickly cease\nAnd all happiness and joy be fulfilled;\nAnd may holy Dharma flourish for evermore."
    },
    "teaching": [
      {
        "speaker": "Kadam Kyle",
        "time": "2:28:45",
        "text": "That's it. And that's how you kind of know you found it. It's like a little blessing that comes through.\n\nLike, ah, that's what's kind of in my way right now. Like, ah, that's what's kind of in my way right now. That's it.\n\nIf you don't get that feeling, then there's other maybe sneakier things going on other than the main culprits. other than the main culprits. Pride is one of them.\n\nBecause pride functions a bit like an invisible barrier. It's quite invisible. Because it's so closely related to self-grasping and self-cherishing.\n\nYou can almost think of it as indistinguishable from self-grasping in some ways. from self-grasping in some ways. So, there's kind of an invisible quality to pride.\n\nSo, there's kind of an invisible quality to pride. So, if you did the exercise and you had this feeling of like, I looked through the obstacles, it just doesn't feel like one resonates with me. it just doesn't feel like one resonates with me.\n\nPride's a good target then. Pride's a good target then. Because it's a sense of like, well, part of the reason that we can't find any culprit is because it would be too painful for our pride to find a culprit.\n\nOr, how could we have an obstacle? Or, how could we have an obstacle? Because we're the best.\n\nOr, who's Buddha to say, I have an obstacle. I'm justified in everything I'm doing and feeling. I'm justified in everything I'm doing and feeling.\n\nThese are all different permutations of pride. Pride's definitely an inverse of faith. they're often kind of faith-related issues, but some of them can be a bit subtle.\n\nbut some of them can be a bit subtle. And often it's because of the pride involved in it. So, that would be like an example of a culprit So, that would be like an example of a culprit that is worth looking at if you kind of did the exercise and nothing touched your heart and go hmm what's the role that deluded pride plays in my in my practice and that would be an example of one but sometimes we have to do other little poking around okay all right guess who says here to develop bodhicitta we must complete four preparations it's very important to know these because if we prepare well it is easy to develop bodhicitta thus we should thus we should one acquaint our mind with the benefits of bodhicitta to accumulate a wealth of merit three purify ourself of all non-virtue all now that's it okay and for understand the method for developing bodhicitta the last point will be discussed in the next section in this commentary okay so we have other little culprits here these are also invisible ones right number two and three merit lack and then for number three is just negative karma then the negative karma obstacle is that the specific tricky iteration of it is the negative karma from holding wrong views okay if you've read Geshe-la's explanation of the short Vajrasattva practice and or instructions on Mahamudra or looked at any of his teachings on Vajrasattva and purification from the last many years that where he's taught on it he's principally taught people to purify the imprints of holding wrong views the reason is because that imprint is much more complicated and problematic than for example the imprint to like get sick or something like this or just have misfortune befall you because like misfortune befalls us externally but we have no wrong views we just have Dharma minds we're just like bring it on baby you know gobble gobble more the merrier we're just we're winning right so the most problematic effect is the effect that comes from holding wrong views why is this because these are just views that have denied Dharma in a past life so why is this so problematic it leads to different effects one is that we just don't understand Dharma it doesn't make sense to us we're just like what are you talking about it makes no sense I had this experience when I first learned about Buddhism in a high school world history class and I remember learning about it thinking that's all wrong completely wrong and I'm feeling really clear like makes it no sense it's completely wrong and actually feeling surprised anyone believe it you know and it's part of the limitation of the teacher but part of it is just my wrong views but I just it looked like the most wrong thing I've ever heard about right and then just a couple years later reading a Buddhist book thinking everything in this is right this is the most self-evident amazing thing I've ever read you know and it's interesting like mind shift karma shifted but it's helpful for me to see to have both those experiences right to juxtapose them like when I was feeling that way in high school reading it I wasn't that that was my experience right this is just wrong it's just this is just not right but that's all it wasn't like a battle it wasn't like I was doubting it even right it just appeared completely false and so to see that disappear that view so helpful for me right to go wow my mind can completely view something in the wrong way especially with Dharma and so what happens is that from holding wrong views in past lives when we read Dharma it doesn't make sense to us and then or when we study and practice it doesn't make sense and then we do practice it we don't gain experience it just stays kind of distant and kind of far away we don't we don't see like it working for us so what Geshe-la has taught before is that of course we want to purify all of our negative karma but it's often effective to target our purification practice towards something because it gives it a little bit more power to make it specific and like aimed at some culprit and and aiming it at the negative karma from holding wrong views is a surefire way to do that it's like the way I think about it is okay I have all this karma from holding wrong views in past lives so then when I study Dharma sometimes basically all I'm doing is ripening that karma right so I'm like reading something so I'm putting in the sort of input of studying Dharma the output I'm getting is the karma of holding wrong views from the past which is not understanding this is annoying as heck it's so frustrating right we put in something we just keep ripening this karma of holding wrong views of course we can just think well it doesn't matter I'm just creating good karma I don't need to worry about it but that's a hard thing to hold if it keeps happening for days months years decades at some point we're gonna go sorry I'm done with that that's it you know no more thank you very much it's just that's a very frustrating experience right so as we if we target that negative karma in our mind then what happens is we just read a line we think we basically experience incredible blessings and it just touches our heart and it feels so beautiful and amazing you want to tell everyone it and that I've heard that line thank you much why are you so excited about that it's because we got a taste of it I'm sure we've all been there right to like revisit a Dharma teaching idea practice maybe years later or months later days later where where it clicked right and the sense of wow that was there all along Wow before it was just like a language I didn't understand and now it's alive and it's vivid it's it's incredible it's delectable okay so anyway the point there is that this is one of the invisible kind of obstacles right it's just having tons of negative karma from holding wrong views in the past and if for example like we notice ourself going mmm I'm not sure Buddha's right about this right that's a sign tendency similar to the cause of holding wrong views right so it's a sign right that there's obviously a ton of karma from holding wrong views still in our mind right just operating if we have the tendency to do it you know still one for you of course it's just a mind that a so the number just action so it's a nine that it's a mind that denies something that's necessary to attain liberation so you're out we're outright denying something that is necessary for attain liberation doesn't mean having a doubt that's not wrong view you have to deny"
      },
      {
        "speaker": "David",
        "time": "2:38:59",
        "text": "it right David yeah like sorry two of these the accumulation of merit and the purification of non-virtue they're being listed here it's like prerequisites to bodhichitta but then also seems like those are benefits of bodhichitta the merit thing maybe makes sense because like you need a bunch of merit to get bodhichitta and then once you have bodhichitta you get a lot more but this idea that you need to purify all non-virtue seems like a little bit duplicative maybe what you just said actually is a good way to think about it like purify your your wrong views first and then once you have bodhichitta you can purify the other stuff yeah one of"
      },
      {
        "speaker": "Kadam Kyle",
        "time": "2:39:41",
        "text": "your thoughts about that yeah yeah that's that's basically it yeah you purify the stuff that's getting in the way of bodhichitta but that's not all the stuff necessarily right you can purify the rest too okay so I just want to complete that a little bit there just again just to look at some more of these invisible obstacles so like negative karma such a negative karma of holding wrong views right okay so then about drawing some conclusions from the last year so one of the skills we want to get into is understanding sort of what phase our practice is in and you can use all sorts of different analogies but let's take the analogy of an airplane because Geshe does use this about like then you know bodhichitta conventional bodhichitta is like the runway and the practice of higher secret tantra is like the you know stealth bomber or whatever plane you want to use that flies off of that thing anyways we won't be unpacking that part of the analogy and this is helpful to use just like an idea of like a plane or something right so kind of misdiagnosing the sort of phase that our practice is in is a is a bit of a mistake because we don't take the correct actions that are necessary for moving us to the next step in our practice so think about like a plane and you're the pilot right and so maybe they're like like one of the stages is like simply kind of figuring out how to like run that plane right and it's like a scholastic phase you're not even necessarily doing that much but you're like collecting teachings ideas studying and this is a phase in our practice it doesn't even just mean at the beginning but they're like periods of time where we go through we realize there's a Dharma limitation in our knowledge and our scholarship there's like a lack actually and this will happen over and over in our practice and if we don't have this happen over and over in our practice we are missing something definitely right this our scholarship doesn't end until we're a Buddha so there are definite gaps in our scholarship part of is our experience at Dharma is our scholarship too right so this is like a phase right you're just sort of like it's like the pilot sort of like learning how to fly like reading the handbook how to work the plane and so on and this is like a that's a little bit like a still phase you know not necessarily tons of movement on the outside but it's sort of like recalibration retreats can be a little bit like this too something like that yeah then there's sort of like take off right and this is okay I'm starting to see positive movement here I haven't hit my full stride yet but I'm like moving in the right direction I'm like starting to hit a flow so early on in our practice this is like maybe come to classes for a while and and we're still kind of like sitting in the airplane reading the book you know and like figuring out what to do and then one day maybe we form a bit of a regular practice or we do something like heart tool and rim or join a study program or something we're like whoo yeah I'm like taking off here like I'm starting to like feel something and I'm starting to move somewhere spiritually this also can happen at points in our life where we've like slowed down a little bit and then we've kind of kicked it back into gear maybe after a break maybe after some time where we needed some rest maybe you just practice dissolved a little bit for whatever reason it's like liftoff then there's like kind of like we've hit the 30,000 plus you know feet we're just like soaring we're flying everything's good right and that's like okay I've really hit my stride here I've really hit where I want to go it doesn't last like that forever because usually there's a new learning that comes eventually but there are periods where we've really hit that stride and that's a time where we want to be we want to be building up like collecting virtue when we're in a space like that because that's going to protect us in the other phases it's like in it that's a really strong point where we're really clear we're energized we're focused whatever we want to gather in that point and then there's um there's various forms of like going down there's like a free fall I'm not laughing at it it's just laughing because I've been there and I know how unfun that is that's sometimes what happens right we're just like we just like lose the plot it's usually just some really strong delusions come up and they absolutely kick our butt and we weren't ready for him we didn't know they were gonna come and now we're falling and we're bracing you know for impact there's also like just kind of a like a slowly deflating fall a little bit different than the free fall it's just like we sort of like we were kind of cruising we thought everything was good we kind of forgot what got us there and then we just like took our hands off the off the plane you know and we're just actually that probably makes you free fall anyway but we're just like slowly deflating right and we haven't lost it completely right but we're like we're moving sort of in the wrong direction for our practice for happiness for well-being and then there's like a healthier version of it which is like a purposeful landing which is more like okay I could maintain that kind of like strength and power and that like altitude right but I have to like because of like life changes or things going on I have to actually like pause a little bit not like pause my practice but pause that level of intensity of practice and land you know refuel kind of check what my next step in life is and what my next stage is and that's like a purposeful kind of like it's kind of like when you reorganize your practice because you realize it wasn't exactly what we wanted to be it's not working maybe for the life situation we're in right now and we want to kind of rethink it and then lastly there's well the landing there is like the person picking up the book again so that that comes full circle and then lastly there's the when we free fall and exploded on the ground and that's a very helpful moment to notice and I think there's times where people are actually in that and they think they're one of the other sets and they're on fire like in a jet fuel is like you know melting their their skin off them anyway it's like it's all it's all absolutely blown up right and and that's that's kind of a moment right it can be basically the whole thing has gotten ruptured it could be like a certain attachment has taken over to such a degree that it's like cut off everything else it could be like to a partner or person or experience a job the pleasure and addiction whatever that could be a form of like a complete crash landing or it could just be more like some anger set in or some discouragement sudden it's just really taken hold to such a degree that was like the joy in our practice is just not there anymore right and it's just an analogy right but but it's just like a little framework to ponder sometimes and it's like it doesn't matter if we're at any of those stages in our practice and there's little many versions of this that can happen even in one day but it's helpful to kind of diagnose okay today today like this is sort of where I feel at and am I like in a sort of a recouping rebuilding stage am I just lifting off I'm kind of getting on the right track am I soaring you know coasting am I descending crap or um you know vertically down am I sort of like losing steam or am I kind of purposely kind of quieting things down so that I can like re-evaluate or have I full-on crash landed and I'm on fire so we can just kind of play around with that a little bit and just see like today you know where am I at and going forward like what's what do I need to take the next step right what's the next step for me in my practice not like what's 10 steps down the line but what's the next one right so if you are if you've crash landed and you're alive still and you're on fire it probably would be stop being on fire you know you'll deal with the broken bones later and whatever else right but you got to get not being on fire first that's the next step right and our own practice the analogy would be like if something that was just like a habit has now become like a destructive addiction right the next step is that has to go first nothing else will be important until that thing goes you're not going anywhere until that thing is gone it's just that's the you know purify your greatest delusion first or some rage has set in right and it's just it's just like killing you you know inside that has to go first nothing else is really going to move until the rage gets damper down the rage destroys merit too so it's like can build much merit in a raging state right or if it's more like okay I'm like lifting off this is a more of a positive sort of it it's like okay what's my next step okay I want to like I want to see what's actually working right now what's the sort of kit that I've put together that's like getting me to lift off what are the circumstances and practices and ideas and whatever that I've set up right now that's getting me to lift off and and what's really working right now what's gonna take me to that next kind of step in my practice okay I didn't get the idea it's just a nice thing to ponder so amidst that and we can just do this in discussion with your partner amidst that maybe we can think about like a little positive moment from the last year and and a low moment spiritually in the last year and it's just really nice to kind of be clear of both of those because you don't just want the highs it's like just eating candy you know it's fun for so long we do want to we want to be aware of the lows you know the tough moments and they're very rich and instructive right okay so this is what we'll just be discussing a bit in the discussion and we'll have some time to do that and then come back and share a little bit okay so then let's see let's have David and Michael and let's have Adriana and Jose and let's have Margaret and Anne and Ryan and Sumit and Marianne and Suzanne all right yeah well done me good matching"
      },
      {
        "speaker": "Student",
        "time": "2:53:26",
        "text": "he's gone cruising but sort of slightly kind of deflating trying to figure out what the next I don't know I feel like I had this idea that I should be"
      },
      {
        "speaker": "Mimi",
        "time": "2:53:47",
        "text": "continuing to ascend and sometimes I feel like I'm just sort of treading water. I do a little bit here and there."
      },
      {
        "speaker": "David",
        "time": "2:54:02",
        "text": "I feel like my mind goes rapidly."
      },
      {
        "speaker": "Student",
        "time": "2:54:09",
        "text": "It's hard to say that it's improved, like, margaret, you know, you know, just like in the last couple of years, I feel like I'm just sort of treading water. I do a little bit here and there. I feel like my mind goes rapidly.\n\nIt's hard to say that it's improved, like, margaret, you know, you know, just like in the last couple of years, I feel like my mind goes rapidly. It's hard to say that it's improved, like, margaret, you know, you know, just like in the last couple of years, I feel like my mind goes rapidly. It's hard to say that it's improved, like, margaret, you know, you know, just like in the last couple of years, I feel like my mind goes rapidly.\n\nIt's hard to say that it's improved, like, margaret, you know, just like in the last couple of years, I feel like my mind goes rapidly."
      },
      {
        "speaker": "David",
        "time": "2:54:36",
        "text": "It's hard to say that it's improved, like, margaret, you know, just like in the last It's been a long time, or at least it's been a while since I've seen him."
      },
      {
        "speaker": "Mimi",
        "time": "2:55:21",
        "text": "I haven't seen him in like five or ten years. What, he's not as angry? Yeah, he's not as angry.\n\nWell, you know, with the... He's not as fierce as I've seen him. I think he's definitely going to have fun with it.\n\nProbably. I love her. Yeah, I love her.\n\nI think he's going to have fun with it."
      },
      {
        "speaker": "Student",
        "time": "3:02:42",
        "text": "I mean, if you're out in one person, like it wouldn't be all of us, it would be a lot of people."
      },
      {
        "speaker": "Mimi",
        "time": "3:02:53",
        "text": "And we see them in a bigger group."
      },
      {
        "speaker": "Mimi",
        "time": "3:02:56",
        "text": "I mean, I don't know that the..."
      }
    ],
    "conclusion": [
      {
        "speaker": "Michael",
        "time": "3:18:33",
        "text": "And just to close, I think, you know, if I just went with my heart, like what I feel like would work best for me. Um, I don't think it goes very well with what I think Geshe-la would recommend. But what I feel like would go best with me is actually just to take a break from trying to do all the, like, daily practices and things like that and commit myself to, like, a couple really long retreats throughout the year.\n\nThat enough would be, that would be hard enough for me to figure out with, like, vacation time and that kind of thing. But, like, but I get so much out of the, like, really long meditations and retreats and stuff. That I have joy in.\n\nBut the, like, daily practice, I just, there's no more joy in it. Yeah."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "3:19:29",
        "text": "Yeah, yeah. Thank you, Michael. Yeah, I appreciate you sharing that.\n\nWe weren't laughing at the fact that you're on fire. It was just more the fact that you said it in a very cavalier way. Like, oh, I'm just fully on fire.\n\nYeah, no, I appreciate you sharing that. It's really helpful, right? And it's an interesting stage.\n\nAnd I would, like, to me, I would take a stage like that in my practice as, like, not view it as a problem, but more, like, view it as something that's, that's like a recalibration, right? About, like, actually a previous way of practicing that actually wasn't working. Because there's a sense of, like, resistance, right?\n\nTo, like, a seated practice and so on, which is fine. And we don't really need to do much seated practice if we can just practice Dharma in daily life. Like, that's just, that can be completely rich.\n\nAnd we can have a full life around that. But sometimes I find, like, going through an experience like what you're describing, because I've definitely been through these before, I find them helpful to think, like, there is a way I was approaching my practice previously that was really unenjoyable. And that's why I feel kind of relief, almost, at, like, not having to do it.\n\nBecause it wasn't enjoyable, actually, right? And so a moment, like, a phase like that is useful. Because it's like, okay, this is, like, information for me.\n\nThis is actually really helpful. But is there a way to, like, yeah, to find a way of approaching the practice that we love? And it might just be in daily life, right?\n\nIt doesn't have to be in a seated way. It might be just in daily life. But yeah, it'd be a rich thing to ponder.\n\nAnd then with respect to the different lazinesses, yeah, it's a good point. That's often all of them. It doesn't hurt to pull on one of those lovers, though.\n\nLet's see what happens, yeah. Discouragement is the best lover, by far, usually. Other ones are related, but that's a pretty darn good one, yeah.\n\nYeah, thanks so much. I really appreciate you sharing that, Michael. Anyone else?\n\nMaybe one more before we wrap it up? David, yeah."
      },
      {
        "speaker": "David",
        "time": "3:22:08",
        "text": "I wanted to practice distraction. And I've done this before with some success. But I had this idea, like, what if I just asked my spiritual guide to, like, really, like, take the, you know, do it for me, you know, kind of thing?\n\nJust, like, seeing when I want to be distracted, like, just rely on the spiritual guide in that moment and just see what happens. And rather thanâ€”because it feels like I'm kind of fighting myself sometimes when I try to overcome distraction. And so really enhancing my practice of reliance on a spiritual guide for that delusion."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "3:22:46",
        "text": "Yeah, so you're just kind of thinking, okay, that's my next kind of step for me, especially with working on bodhicitta and other things, is to move the distractions around and specifically through relying on a spiritual guide to do that. Yeah, fantastic. Thank you.\n\nI did say one more, but let's go, Mimi. I saw your hand up there. You tied with David."
      },
      {
        "speaker": "Mimi",
        "time": "3:23:08",
        "text": "You sure? You have time?"
      },
      {
        "speaker": "Kadam Kyle",
        "time": "3:23:10",
        "text": "Yeah, yeah, yeah. Let it rip, and then if you go too long, I'll justâ€” Okay, okay."
      },
      {
        "speaker": "Mimi",
        "time": "3:23:13",
        "text": "I'll do it quickly. But, you know, it's emotional. So I was sharing with Byron and Fran how, in my practice, like, I noticed, like, I, you know, took a long pause from the practice for many years and then have come back.\n\nAnd I think that what's been really noticeable for me is how I've been able to scaffold my practice, you know, just coming back into TTP online, then joining, you know, doing, helping the branch, now doing, you know, more things with the shrine and coming to the center more often. And what I found is that there's, like, this huge reservoir of information from all the times that I've practiced and all the teachings that I've received over the years. And now it seems that those files or those drawers are starting to reopen and come alive for me.\n\nAnd I'm, like, really making these connections at a very, very, very deep and personal, intimate level. So I'm so happy to be back and very grateful to you, Kano, and to the sangha. Yeah, I just really feel very supported and just so, so happy.\n\nThank you."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "3:25:00",
        "text": "Yeah, thank you, Miriam. It's beautiful, yeah. Yeah, and it's a good example of going through those different phases in our little plane, right?\n\nAnd they're not necessarily bad in any way. You know, they're just different phases. And they often lead to something better on the other side.\n\nAnd so it's a nice example, right? And to think of all that beautiful karma that was created, and it was just latent, beckoning, you know, beckoning you. And now you get to harvest some of it, which is an incredible thing to do.\n\nAnd it's a nice example, Mimi. Thank you. Okay, thank you, everyone.\n\nIt's wonderful. So we're back in a couple of weeks. I'll just guide a brief dedication now.\n\nSo we can think of the virtues we've collected through practicing, meditating, and discussing. May all living beings find lasting peace of mind, enlightenment."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "3:26:18",
        "text": "We can make any personal prayers or dedications."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "3:27:05",
        "text": "Okay, thank you. Just the final thought is, as we know, there's different types of bodhicitta. And one of them is boatman-like bodhicitta, which we, there was a hint about it in one of the benefits of bodhicitta, which no one pointed out.\n\nToo bad. We missed out on that part of that benefit. But this type of bodhicitta is just so nice to always remember with respect to the center, which is like, we're going to enlightenment together.\n\nAnd to have a view, we'll all attain enlightenment together one day. All of us at the same time. It's just a great view, as a group.\n\nJust as all the people on the boat show up on the other side of the river or the ocean together. So let's just keep having that view. We're all going together.\n\nWe're learning together. We're growing together. We're learning from each other.\n\nWe're supporting each other. And I definitely feel supported by you all. I hope you can feel supported by each other.\n\nAnd that is just such a nice thing to always remember. We're all doing this together. Every day, we can think, I'm on the same boat as all my TTP sangha, going together to enlightenment.\n\nOkay. Thank you very much."
      }
    ]
  }
}