{
  "classId": "nov09",
  "date": "November 9, 2025",
  "session1": {
    "classIntro": [
      {
        "speaker": "Kadam Kyle",
        "time": "0:17",
        "text": "Okay, hi everyone. So I'll begin the practice in a moment, and I'm just going to say a few brief words about helping us concentrate a little bit as we practice. Let's see, a long time ago Geshe-la asked how do people attain tranquil abiding, and he said to attain tranquil abiding is very easy.\n\nYou just 100% stop distraction, and then you'll just naturally attain tranquil abiding, easy. So I like to think about that, because what he was saying is that it's simply a decision. It's not like some people can and some people can't.\n\nIt's just some people decide to, and some people don't. It's very interesting to think of our mind this way. Our mind isn't a passive observer.\n\nIt's the creator of all. We are not the creator of all, right? Our mind is the creator of all, including of our idea of us.\n\nSelf is just a creation of mind. So is everything else. So sometimes, like in our meditation, we can sort of feel like we're just this passive being, you know, just sort of doing our best, and it's helpful to think, no, our mind is so powerful.\n\nOur mind is so powerful. It can create a distraction-free meditation if we decide to. We're not like on the sidelines, you know, just a victim to our world and our experience.\n\nSo anyway, I found this advice so helpful over the years, 100% stop distraction. This is Geshe's advice, which is basically just saying you can just decide to, if you'd like, and just do it. When I was making some prayers to my guru over the last many weeks, the answer I got back every single time was that phrase, 100% stop distraction.\n\nAnd I figured to some degree it's for me, but then it must be for other people too, because that was the only thing I heard in response. So I wanted to share that. 100% stop distraction, and then everything naturally comes.\n\nAs we know, distraction means a mind that wanders to an object of delusion. So it also means 100% stop our ignorance, because all objects of ignorance are objects of delusion. 100% stop distraction is not an external activity.\n\nIt's not an external statement. It's actually an internal one, right? Saying stop three poisons, ultimately.\n\nBut anyway, that's too much. I wanted to say that as one thing. 100% stop distraction, just make a decision.\n\nAnd once we start practicing making decisions and following through with them, our mind will basically be able to do that. Second thing, just a simple point, is to, and I'll give us about a minute to do this before the liberating prayer, is to just draw all of our awareness into the room. As Geshe-la explains in Tantric Grounds and Paths, all of our minds are mounted by winds.\n\nAnd so if you draw all of your winds, for example, into your body, then our minds aren't going to wander to anything outside of the body, or anywhere else. Because the winds are mounted by, the minds are mounted by winds. It's like our minds are going out when they're getting distracted.\n\nSo this is quite, well anyway, we can just practice this, but we'll get a sense of this. I can just draw all my energy into this room, and into my being, leaving everything behind. And you can do that, actually.\n\nYou can draw all the winds from the future, and from the past, and from other parts of Brooklyn, and from your house, and from some person that you don't like thinking about right now. You can just draw all the winds away from all those things, and all those people, into right here. And if you do that, then there's not going to be much distraction.\n\nSo again, this is just about making a choice. It's a very simple tool, and it's great if we teach meditation. This is just a very nice, simple phrase to include right at the beginning of the meditation.\n\nJust draw all your awareness into the room, like that. Okay, those are the two things I wanted to say. So let's enjoy now.\n\nSo we'll just take about a minute."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "6:48",
        "text": "The mind is the creator of all. So we can just make a decision. We're going to 100% stop distraction.\n\nWe can draw all our awareness, our energy winds and minds, into the room, leaving everything else behind. And then we can enjoy engaging in the prayers."
      }
    ],
    "chantedPrayers": {
      "time": "9:03",
      "text": "LIBERATING PRAYER\n\nO Blessed One, Shakyamuni Buddha,\nPrecious treasury of compassion,\nBestower of supreme inner peace,\nYou, who love all beings without exception,\nAre the source of happiness and goodness;\nAnd you guide us to the liberating path.\n\nYour body is a wishfulfilling jewel,\nYour speech is supreme, purifying nectar,\nAnd your mind is refuge for all living beings.\n\nWith folded hands I turn to you,\nSupreme unchanging friend,\nI request from the depths of my heart:\n\nPlease give me the light of your wisdom\nTo dispel the darkness of my mind\nAnd to heal my mental continuum.\n\nPlease nourish me with your goodness,\nThat I in turn may nourish all beings\nWith an unceasing banquet of delight.\n\nThrough your compassionate intention,\nYour blessings and virtuous deeds,\nAnd my strong wish to rely upon you,\nMay all suffering quickly cease\nAnd all happiness and joy be fulfilled;\nAnd may holy Dharma flourish for evermore.\n\nGOING FOR REFUGE\n\nI and all sentient beings, until we achieve enlightenment,\nGo for refuge to Buddha, Dharma and Sangha. (3x)\n\nGENERATING BODHICHITTA\n\nThrough the virtues I collect by giving and other perfections,\nMay I become a Buddha for the benefit of all. (3x)\n\nGENERATING THE FOUR IMMEASURABLES\n\nMay everyone be happy,\nMay everyone be free from misery,\nMay no one ever be separated from their happiness,\nMay everyone have equanimity, free from hatred and attachment.\n\nVISUALIZING THE FIELD FOR ACCUMULATING MERIT\n\nIn the space before me is the living Buddha Shakyamuni surrounded by all the Buddhas and Bodhisattvas, like the full moon surrounded by stars.\n\nPRAYER OF SEVEN LIMBS\n\nWith my body, speech and mind, humbly I prostrate,\nAnd make offerings both set out and imagined.\nI confess my wrong deeds from all time,\nAnd rejoice in the virtues of all.\nPlease stay until samsara ceases,\nAnd turn the Wheel of Dharma for us.\nI dedicate all virtues to great enlightenment.\n\nOFFERING THE MANDALA\n\nThe ground sprinkled with perfume and spread with flowers,\nThe Great Mountain, four lands, sun and moon,\nSeen as a Buddha Land and offered thus,\nMay all beings enjoy such Pure Lands.\n\nI offer without any sense of loss\nThe objects that give rise to my attachment, hatred and confusion,\nMy friends, enemies and strangers, our bodies and enjoyments;\nPlease accept these and bless me to be released directly from the three poisons.\n\nIDAM GURU RATNA MANDALAKAM NIRYATAYAMI\n\nPRAYER OF THE STAGES OF THE PATH\n\nThe path begins with strong reliance\nOn my kind Teacher, source of all good;\nO Bless me with this understanding\nTo follow him with great devotion.\n\nThis human life with all its freedoms,\nExtremely rare, with so much meaning;\nO Bless me with this understanding\nAll day and night to seize its essence.\n\nMy body, like a water bubble,\nDecays and dies so very quickly;\nAfter death come results of karma,\nJust like the shadow of a body.\n\nWith this firm knowledge and remembrance\nBless me to be extremely cautious,\nAlways avoiding harmful actions\nAnd gathering abundant virtue.\n\nSamsara's pleasures are deceptive,\nGive no contentment, only torment;\nSo please bless me to strive sincerely\nTo gain the bliss of perfect freedom.\n\nO Bless me so that from this pure thought\nCome mindfulness and greatest caution,\nTo keep as my essential practice\nThe doctrine's root, the Pratimoksha.\n\nJust like myself all my kind mothers\nAre drowning in samsara's ocean;\nO So that I may soon release them,\nBless me to train in bodhichitta.\n\nBut I cannot become a Buddha\nBy this alone without three ethics;\nSo bless me with the strength to practice\nThe Bodhisattva's ordination.\n\nBy pacifying my distractions\nAnd analyzing perfect meanings,\nBless me to quickly gain the union\nOf special insight and quiescence.\n\nWhen I become a pure container\nThrough common paths, bless me to enter\nThe essence practice of good fortune,\nThe supreme vehicle, Vajrayana.\n\nThe two attainments both depend on\nMy sacred vows and my commitments;\nBless me to understand this clearly\nAnd keep them at the cost of my life.\n\nBy constant practice in four sessions,\nThe way explained by holy Teachers,\nO Bless me to gain both the stages,\nWhich are the essence of the Tantras.\n\nMay those who guide me on the good path,\nAnd my companions all have long lives;\nBless me to pacify completely\nAll obstacles, outer and inner.\n\nMay I always find perfect Teachers,\nAnd take delight in holy Dharma,\nAccomplish all grounds and paths swiftly,\nAnd gain the state of Vajradhara.\n\nRECEIVING BLESSINGS AND PURIFYING\n\nFrom the hearts of all the holy beings, streams of light and nectar flow down, granting blessings and purifying."
    },
    "guidedMeditation": [
      {
        "speaker": "Kadam Kyle",
        "time": "21:30",
        "text": "Just to feel we receive powerful blessings. Then we can remember that we should think, I am a bodhisattva in a bodhisattva family. Since we have taken the bodhisattva vows, it's a valid basis of imputation.\n\nImputing bodhisattva. Just practice holding this powerful, confident label on ourself. I am a bodhisattva in a bodhisattva community.\n\nThink about a problem in your life. Investigate what it would be like to strongly label or experience yourself as a bodhisattva in a bodhisattva family, addressing this problem. Ask yourself what would it look like for a bodhisattva to go through this situation.\n\nHow would they think? How would they see others? How would they move forward?\n\nJust explore like this for a little while. And finally, we can just check in for the last minute how our practice of our six sessions went over the last week. And see if there's anything in particular we learned.\n\nAnd with this understanding, we can gradually arise from our practice."
      }
    ],
    "postMeditation": [
      {
        "speaker": "Kadam Kyle",
        "time": "35:45",
        "text": "Okay, lovely. So let's see.\n\nIn person, there's me and P, David, Byron, and K. Sharon, Marianne, Neil, Fran, Jose, Ryan. And then online, Suzanne, Brady, Kristen, Ben, Dale, Margaret, Maura, Mimi.\n\nOkay, lovely. Hi, everyone. And so in a moment, we'll share how our practice went over the week.\n\nAnd so I sent this out on a WhatsApp group, but I'm going to just reiterate it now about the optimal data sharing format. Okay. So it goes like this.\n\nIt's one, two, three. One, I practiced da-da-da-da-da-da-da. Okay?\n\nWhatever you practiced. So you say like, I practiced trying to remember the six session Guru Yoga. Or I practiced really trying to emphasize the little mini self-generation in the six session Guru Yoga.\n\nOr I practiced trying to do it but being really imperfectionist and being really gentle on myself. Or I practiced mostly emphasizing the Bodhisattva vow part of like the six sessions and really connecting to the Bodhisattva's way of life. Right?\n\nWhatever, right? But we're saying this is what I practiced. Okay?\n\nThat's thing one. Thing two is this is like the result that I saw. We're just drawing some kind of like inference, right?\n\nLike we're noticing some kind of effect, right? Like I really liked it. It was really hard.\n\nI overestimated my ability to follow through. I had a big plan but it didn't really happen. I liked it way more than I thought I would.\n\nWhatever, you know, who knows what. Just some results, right? So point one, this is what I practiced.\n\nPoint two, this is the result I observed. Point three, this is my conclusion. So that's what we're trying to like get a takeaway from that, right?\n\nOkay. So that can be done really simply and easily. And I posted on the WhatsApp group, please know preambles, side stories, back stories of the people involved somehow in the data just because it takes a lot of time to do those bits.\n\nSo it's nice to hear from lots of people. And if we have the preambles and the side stories, it just takes forever basically. So this is much nicer actually to make a universal conclusion that is useful for everyone, right?\n\nSo I'm not trying to damper anyone's data sharing. It's just this will make it much more useful for everyone if we approach it this way, which is always the intention. But we might have not realized that.\n\nOkay. Very good. So now does anyone have any reports from the week?\n\nAnn, yes. Thank you. Very good.\n\nYou have to do it in a robotic voice too with no feeling."
      }
    ],
    "practiceReports": [
      {
        "speaker": "Anne",
        "time": "38:26",
        "text": "So, yeah, this is about the succession thing."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "38:28",
        "text": "Hold on, hold on. You're not on yet. I know."
      },
      {
        "speaker": "Anne",
        "time": "38:30",
        "text": "It is on though, but I can't hear myself. Oh, okay. So this is about succession yoga.\n\nI did the thing. What I observed is that sometimes I really wanted to do it and sometimes I didn't. And the times where I didn't want to do it, and I think maybe people often have this experience, is the time I most needed to do it when I felt I couldn't spare the time.\n\nOr I think more often I wasn't in a great place and I didn't want to feel it, right? I didn't want to take a break and be with myself. And I found that when I kind of pushed through and I just did it no matter what, my day went great.\n\nIt was a different world, you know? Things didn't build up. It's like doing the dishes after every meal, right?\n\nReally nice."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "39:22",
        "text": "Fantastic. Thank you so much, Ann. Yeah, so this is a great thing to notice, and we can all do this.\n\nWhere is our practice resistance? And for everyone, it's different. Some people, it's like, I don't want to do a puja.\n\nOh, it's a puja. I don't want to do a puja. I just want to meditate and read.\n\nIt's like, oh, what's that about? What's wrong with you? Anyway, it's like, look at that, right?\n\nThat's your resistance. Other people say, oh, my God, the study and logic and the reasoning. It's just too heady and intellectual.\n\nWhere's the real practical stuff? Ah, I don't like this. Other people, it's like, I just want to meditate.\n\nMeditating is so boring. I want other things. I'll chant all day, and I'll make some beautiful offerings, but I don't want to just sit and meditate.\n\nWhatever, right? So it's just really helpful to notice in our own life, where are our resistances? Just on like a macro scale, which is more like patterns.\n\nAnd then in the day, like what you're talking about, like where we're going, oh, I don't want to do it, and then exploring what that's about. And it's nice what you demonstrated, which is like, just don't buy into it, because it's never wisdom, right, that's saying don't do your dharma practice. Thanks so much, Anne.\n\nLovely. Marianne, please."
      },
      {
        "speaker": "Mary Ann",
        "time": "40:50",
        "text": "Yeah, I went into it really slowly and let myself not be perfect and forgot a couple of times the first couple of days, and then I just got totally into it, because I don't think this is too much maybe back story, but instead of wanting to do two meditations a day, I got to do this, and it was just really great and fun, and I made this little booklet, and so I realized I should do them all three times, and I was only doing them once, so I just gradually let myself go into it, and I found that my mind wasn't yo-yoing quite as much, like I didn't have that intense resistance to certain things that I was having before, because I like meditating. The rest of my day sucks.\n\nThis is much more like, oh, yeah, this is fun. I can do that. I can do that instead.\n\nSo I thought it was really like a little train to be on the whole day with great little stops on the way, and I didn't worry about even trying to be there present with the words every single time, but if I wasn't completely present with the words, I was like, that's fine. I'm still here, you know. I'm on the train.\n\nSo that was what it was like."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "41:58",
        "text": "Beautiful, Marianne. Thank you so much. That's lovely.\n\nYeah, it makes a lot of sense. You kind of just enjoyed almost like the periodic quality of the six sessions and how it kind of kept the mind in that more virtuous state instead of maybe some extreme meditation sessions and then just letting our mind go willy-nilly all day. And then you also approached it in a really imperfectionist way, a really gentle way, trying not to push yourself into something that felt uncomfortable but just letting it kind of happen organically.\n\nThank you. That's really nice. Fran, please.\n\nAnd then Suzanne after that."
      },
      {
        "speaker": "Fran",
        "time": "42:44",
        "text": "I also had a great week with this. I also have a little book, Marianne's. I found it very helpful to, I did it a couple of days in advance, knowing what was coming up to list when I was going to do the six sessions during the day.\n\nAnd in my mind, sometimes I referred back to it because I would go and check it off and say, oh, when's the next time. And sometimes in my mind, oh, I already did those two, when's the next one. And each day was a little bit different, so it didn't become just routine and easy to forget.\n\nSo that was really very helpful. I found that I was able to, one of my goals was I set it up to do it before lunch and before dinner so I would remember to offer my food, and that was better than it's ever been. Far from good but definite progress from that.\n\nAnd I think the biggest change I've noticed in myself this week is that I feel like I'm going through life as a Buddhist as opposed to trying to apply Buddhism to my life. Because it's just all day long a constant thread of asking for blessings and being connected."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "44:00",
        "text": "Lovely. What you're describing is exactly the purpose of these kind of practices. It's just like, yeah, just kind of staying in our refuge experience, being a Dharma practitioner, and being connected to the Buddha's spiritual guide.\n\nAnd this regular reconnection is much more effective actually than some mega burst and then just going through life. And then I really liked your point about pre-planning the times based on your slightly changeable schedule. That's really smart, yeah.\n\nBecause just letting it happen organically can work if our mindfulness is enough and the habit is built up enough. But for a lot of us it's just not like that. So just saying, it's going to be at this time this day, and that time that day, and this time that day, and this time that day.\n\nAnd I know I have a big meeting then. I'm not going to do it at that point. I'm going to do it after, before, whatever.\n\nAnd just preceding it in our mind through planning like that will always increase our mindfulness with any practice. But especially this. Thanks so much.\n\nSuzanne, yes, please."
      },
      {
        "speaker": "Suzanne",
        "time": "45:14",
        "text": "I just wanted to mention that I think it's funny that you were saying no distractions during the meditation, and the cat jumped on the computer, and the Zoom went out, and so now I'm on my phone. So I didn't do so well with that. The six-time-a-day practice, I started out really strong.\n\nAnd as the week went on, I noticed that I was getting worse at it, which is not the direction you want to go. And then I started to think about what do I really need, maybe if I gear it towards what I really need, which I realized was patient acceptance. Because I've kind of been in a flare-up for a month, a headache every day, and I just â€“ I lost that whole patient acceptance mind when I was feeling somewhat better.\n\nSo I think I really need that, maybe more than one session a day, and hopefully that will help."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "46:07",
        "text": "I love that, Suzanne. Yeah, this is exactly part of the crafting of the six sessions to make them what we need, and to make them work for us based on our own mental disposition, our kind of mental flora and fauna, the stuff that's inside of us, which is different for each one of us. And if it becomes something that we need, like medicine, then we're going to love taking it.\n\nLike if we've ever had a serious surgery, and we're allowed to take a little painkiller or something every X hours, we just can't wait to take that thing again, because we're in so much pain. And we know we can't take it more often than that, but when the time comes and we get that relief, we're really looking forward to it, to the little temporary freedom. And our Dharma practice is like medicine for our mind, but it has to match up with our specific delusions and our specific inner problems.\n\nSo if I was you, what I might do, if I wanted to make it all about patience, is maybe I would take a few awesome lines from how to solve our human problems, like on patience, right? And take one for each of the successions, like a different line. And it's like, in one of them, it's maybe the definition of patience, and I just recite that again.\n\nPatience is a mind that welcomes wholeheartedly whatever arises, having given up the idea that things should be other than what they are. And that's like your morning one."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "47:41",
        "text": "And then after that, maybe it's about expectations, like most of our emotional problems come from not accepting the way things are. And most of the problems with our spouse, for example, come from thinking that they should be other than what they are. You know, like that little bit.\n\nThen you have that one, and then... Anyway, you get the idea."
      },
      {
        "speaker": "Suzanne",
        "time": "48:01",
        "text": "Yeah, I kind of did that, but I did it all together. But yeah, I like your idea, separate things on separate meditations."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "48:07",
        "text": "Yeah, just make it fun, and kind of nuanced. And it's like, maybe you have one on the patience and not retaliating later in the day. Just like the things you just love, you know, that speak to you.\n\nBut there's a little diversity in it, a little bit like a nuance to it. So it's exciting still. Yeah, thanks, Suzanne."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "48:31",
        "text": "Amini, yes, and then Dale after that."
      },
      {
        "speaker": "Mimi",
        "time": "48:34",
        "text": "Hi. So, number one, I practice the six sessions. And it was a combination of doing Dakini Yoga Sadhana, or the prayer, or mantras, just depending on what was happening.\n\nAnd I initially said that, you know, the two morning sessions and the two evening sessions were going to be easy. And they were not. And the two sessions in the office were going to be the hardest.\n\nAnd they ended up being the easiest. So it was like all jumbled around. But that's okay.\n\nThat's okay. That's what I noticed. And, you know, I noticed that because I'm such a perfectionist, that I just needed to be gentle, just really gentle with myself, and not pushing, and just being creative.\n\nSo just working with whatever was happening. So, you know, and Kadam, you said last week that, you know, to be aware of these pain points. I was like, I'm not going to have that.\n\nI'm not going to have any pain points. I don't know what Kadam was saying. Well, the whole entire week was a massive amount of pain points.\n\nSo I just, like, watched my mind. I was like, whoa, look at this. And I applied a lot of what we were studying in Mahamudra, Tantra.\n\nIt's all mere appearance to mind. It's a dream. Yeah, so just really used Mahamudra in those moments.\n\nAnd then also kind of noticing, like, what was triggering me, and then having a strategy, like, okay, this is what I'm going to do when this happens. And that was kind of like putting guardrails around. So that was really helpful.\n\nI mean, keeping a log."
      },
      {
        "speaker": "Mimi",
        "time": "50:41",
        "text": "And my conclusion, I just want to work on the morning session and the evening session. So the morning session, I'm doing, you know, the yoga of waking. But, you know, like, I try to be so perfect about it.\n\nBut now I'm just like, you know what? Don't worry about it. Just make your coffee, and just pretend that you're having coffee with Geshe-la.\n\nSo that's what I'm doing. I'm just hanging out with a guru in the morning."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "51:10",
        "text": "Yeah, thanks, Mimi. That's great. Yeah, yeah.\n\nYeah, it's great. I really like what you're doing, which is just you're trying something, you're learning about it, you're experimenting, you're tinkering with it. Succession practice is a lifelong practice.\n\nIt's not a week-long practice. And it's something that we're going to get to know really well about our life. And it's really nice that that's what you're doing, right?\n\nAnd so you learn some key things this week. It's like, wow, those morning and nighttime ones were the harder ones, not the midday ones at work. It's like, okay, great to know.\n\nAnd then, hmm, my perfectionism is really getting in the way of my tantric practice and my practice in general. Okay, great. So I'm going to have to try to be a super imperfectionist in how I approach this.\n\nFantastic, right? And then realizing that, yeah, you want to work on maybe even those nighttime ones and explore what that looks like for you. Yes, it's really nice.\n\nAnd we just kind of keep learning like this, like with error correction, right, trying things and learning and correcting along the way. Thank you very much. Dale, yes, and then Maura."
      },
      {
        "speaker": "Dale",
        "time": "52:18",
        "text": "Hi. So first I want to thank Fran for the suggestion about keeping a log. And I have a cute little butterfly booklet that I started.\n\nI wrote down times that I thought would work for me for the whole day. So far that's doing pretty good, keeping to that. And I'm doing the six-session yoga, the Vajrayogini.\n\nAnd I find that most of the time, not all the time, most of the time I'm looking forward to it because it feels like it gives my mind a place of refuge and rest, that whatever's going on, craziness out there, okay, for this little while I'm bringing my mind back to my heart. And it's softer and it's quieter and it's helpful. So not every single one, but most of the time.\n\nAnd I had pretty good success with keeping to the times in my logbook, except when I'm out with, you know, having a lunch or, you know, then I have to go back and say, oh, I didn't do that one, or I go back and try to make up for it. Anyway, it's good. I think it's good.\n\nVery good. Thank you."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "53:49",
        "text": "Thanks, Dale. We all want to see the butterfly notebook. Come on.\n\nYou send us a picture of that. You don't have to send us the details of which ones you did or not, but we want to look at the cute butterfly notebook. Yeah, the log just makes a big difference.\n\nIt just might seem like a small thing, but it really helps having this kind of record keeping mechanism. Yeah. Thank you very much.\n\nLaura, yes."
      },
      {
        "speaker": "Fran",
        "time": "54:17",
        "text": "I identified with columns, identified times, and then I identified what I would do in each of those times. And I think there was something missing there where it was not inspiring me. So I'd sit down.\n\nI'm like, well, that's not really what I want to do now. I never made it to six. And I think I might have missed something in the teaching about what to do in each of the six sessions, or I just need some additional inspiration in hearing what other people are doing in those six sessions.\n\nI could default to just breathing for a couple of minutes, but I think that the teaching was more than that. So that's where I'm at. Yeah."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "55:02",
        "text": "Fantastic. Yeah. Thank you, Maura.\n\nYeah. And so finding that you only have maybe three or four or whatever throughout the day, this is totally fine, right? We're just working towards six.\n\nWe're just doing our best. We're trying to move in the right direction. And we're not going to be at our perfected form until we're a Buddha.\n\nSo anyway, that's lovely that you kind of made a plan, tried it out, able to hit some of the sessions, and you noticed a really important thing, which is like some of the things were just not inspiring. And this is like a great lesson, right? What's going to inspire me?\n\nWhat's going to excite me about those sessions? What are going to be sessions that I love from the depths of my heart? And some of that will come with familiarity and seeing its panacea-like effects on our mind.\n\nBut the sort of short-run approach is like trying to find stuff that we just love to do, that we enjoy, that we appreciate and delight in anyway, and it just makes it a bit easier. With respect to your point about what we should do, there's sort of the general buy-the-book version, and then there's the choose-your-own-adventure bit. Buy-the-book version is to either take the bodhisattva vows, if you have bodhisattva vows, six times a day, retake them.\n\nOr if you have tantric vows, take the bodhisattva vows and the tantric vows. So that's the technical succession guru yoga practice, which is doing those practices six times a day. Actually, it's technically just the tantric vows six times a day, but often we'll put in the bodhisattva vows, because we also have vows to do them six times a day anyway.\n\nSo this is like the buy-the-book bit, but what I was trying to encourage us is like these two practices contain all dharma. So like bringing out some nuance in our practice that we love isn't going against these two practices. It's just drawing out some aspect of the dharma that's going to delight us and be medicine for us based on what we're dealing with in that time of day.\n\nSo it's not like we're sort of breaking out of it by customizing each of these successions. It's more like we're making sure we're connecting to it so it's not purely rote. So yeah, the bodhisattva vows, we have them.\n\nThere's a long version, but the short version is I go for refuge to the Three Jewels and confess individually all negative actions. I rejoice in the virtues of all beings and promise to accomplish a Buddha's enlightenment. And mostly you're just connecting to that mind of Bodhicitta at the end.\n\nI want to become a Buddha for the benefit of all. And then the tantric vows, I go for refuge to the Guru and Three Jewels, holding Vajra and Bell, I generate as a deity and make offerings. I rely on the dharmas of Sutra and Tantra, refrain from non-virtuous actions, gather only virtuous dharmas to help all beings by the practice of the four givings.\n\nAnd that contains the 19 vows and commitments of the five Buddha families. And the core of that really is just a little mini self-generation, generating yourself as a Buddha. But then there's also the other 18 vows in there.\n\nAnyway, if anyone needs the text, you can always get this little booklet. It's very nice. Or I can even just try to write it out in the little WhatsApp group so we have the words.\n\nOkay. Time maybe for one more thought before we get in the text. David, yeah."
      },
      {
        "speaker": "David",
        "time": "59:18",
        "text": "So my goal was to make the six sessions like part of the flow of the day instead of just at the times, and then also connect with it more deeply, make it less rote. Didn't totally succeed. I found that when I took the subway, those were two of the times that somehow triggered it.\n\nI remembered to do it and just had tried to get to a place of cherishing love for the people on the subway and the people I knew I was going to come across at work that day. So that was really good. But I feel like other than that, I have an alarm that tells me to do it.\n\nSo I was able to do that. But I feel like, in general, the alarm isn't as good because I could be in the middle of something else and then I have to just kind of like bang it out real fast or else I'm not going to do it. There were times when the alarm would go off, and I'd be like, okay, I have the time.\n\nI'd set like a little timer for like one minute, and then that worked well too, generally remembering either cherishing love or emptiness or just holding the guru at the heart for a minute. Those were really nice when I was able to do those minute sessions, but it's kind of a mixed bag. But step in the right direction compared to where I was the week before."
      }
    ],
    "shantidevaReading": [],
    "postReading": [],
    "mainTeaching": [
      {
        "speaker": "Kadam Kyle",
        "time": "1:00:37",
        "text": "Thanks, Derrick. One day you can teach a day course called Banging Out the Sixth Session Guru Yoga with David Hurston. We will all go to that.\n\nNo, that's lovely. Yeah, it's a good point about the alarms. They can really help because they do tell us six times a day that it's happening.\n\nAs you mentioned, you point out the flaw of the alarm, which is sometimes we just go, no thanks. If we ignore it enough times, it's just like the breeze and the wind. It just doesn't even mean anything to us anymore.\n\nBut it can help. I know people who are really diligent with their succession practice that have been doing it for years every day, and that's what they use. They just have a three-hour alarm.\n\nSometimes they miss one, and then they say, I just punted along an hour later or whatever. It does work. It's just one of the many kind of ways to do it.\n\nOkay, thank you very much. Thanks, everyone. That was very delightful data sharing, nice formatting, no preambles.\n\nVery happy about that. No offense to our preambles, but they're very nice stories. That was like a million people in about 25 minutes, so that's very nice.\n\nI learned a lot. I hope you did too. Okay, let's take a look at the book, the text.\n\nAn Introduction to the Text, page 4. How is Shantideva's Guide put together, and what does it contain? It is composed of ten chapters, and we should try very hard to understand the meaning contained in each one of them.\n\nOtherwise, we are like the foolish person who was sent to a shop by members of their household to see what was sold there. When they returned home, they asked what was available, and he had to reply, I don't know. I have forgotten.\n\nHis journey to the shop was a complete waste of time. Similarly, if upon completion of this text we are unable to recall what is contained within each of its chapters, we should be ashamed of ourselves. Oh, my gosh.\n\nGuns blazing. We're just going right for the throat right away. If our study of this text is to be worthwhile and not a complete waste of time, it's fantastic.\n\nWe should not only read the words, but also try hard to learn their meaning. There now follows a brief description of the contents of each of the next ten chapters of the root text. Lovely language here.\n\nNot a complete waste of time. Yeah, let's make sure our study of this book is not a complete waste of time. It can sound a little harsh, but I would say if we don't change by the end of the book, it kind of is a waste of time.\n\nIt's a lot of time to be on TTP. It's sort of like a waste. It's like three and a half hours a week, plus any study and practice we put in.\n\nWe do want to get to the end of the book and feel like, I'm a changed person. I'm a different person. I don't even know the person who started that book.\n\nThat's kind of what we want to feel. Maybe when we've studied Dharma books, we've had times where we felt that. Like in a class, we were like, wow.\n\nStudying... I remember when I first studied New Guided Akini Land, for the first time, in TTP. At the end, I just thought, I'm a new person.\n\nHoly guacamole. I'm a new person. I can't even remember the old person.\n\nI can't even remember what it was like before I studied New Guided Akini Land for the first time. But I haven't felt like that in every book I've studied. Sometimes I'm like, well, I guess I learned a couple things.\n\nIt sort of feels like same old me with a few extra pieces of info. We don't want that to happen. We want to change.\n\nWe want to see our mind move. Part of this, I hope, we can consider this a little bit. This is something we can ponder this week.\n\nIt's just thinking, what's going to make studying this text help us change who we are? Which means, what are the delusions we want to change? How is studying Meaningful to Behold going to help with those delusions?\n\nThat's the change we're looking for, right? Obviously, it says here we should learn the meaning. That's part of it, obviously.\n\nAnd studying, that's part of it. But maybe we've done that before, to some degree. But maybe the delusions have stayed the same.\n\nAttachments stayed the same. Pride stayed the same. Ignorance has stayed the same.\n\nSo we want to apply Dharma in a way that our delusions are actively decreasing. This would take making a plan of some sort. Maybe it's using the succession practice, which I think would be probably key in doing this.\n\nBut we're thinking, maybe there's one specific delusion or some iteration of that delusion that we want to particularly see reduce. And I'm like, OK, how am I going to use studying this text to do that? Being in TTP and being with the Sangha, how am I going to do that?\n\nWhat's it going to look like to make that change for me? Sumit?"
      },
      {
        "speaker": "Student",
        "time": "1:07:20",
        "text": "Before you started this book, you asked us, what's a delusion? And I said renunciation. And then you characterized this book as all about renunciation.\n\nAnd I was surprised by that, because I thought this book was all about bodhicitta. And so that's the delusion I want to work on, is renunciation. And maybe this is the wrong time to ask this question, because we're just starting.\n\nSo if that's the case, please say so. But my question a little bit is, that's what I want to work on, is renunciation. And I'm looking through it, and I'm like, where is the renunciation here?\n\nSo is there some sort of guidance you can give on that? Because it looks to me, like I've read this book before, it looks to me about bodhicitta. Or if I should table the question, that's also okay."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:08:02",
        "text": "No, it's a good question, Sumit. This is about reading practically. Because every book can teach us any dharma object.\n\nLike I could take How to Solve Our Human Problems and extract the meanings on generation stage from that, if I wanted to. We can get dharma from We can get any dharma from any other dharma. Because it's all connected, it's all linked in like a system.\n\nBut it involves reading practically. And so the overarching topic is the six perfections. But as we go through, Ashanti Dev is going to be repeatedly hammering home, for example, the faults of attachment.\n\nThat's like half of chapter eight is all about that, which is the key to developing renunciation. He's going to be hammering home the faults of delusion and negative karma. That's the chapter on purifying evil, purifying negativity.\n\nThat's going to teach us renunciation, seeing what happens when our negative karma doesn't go purified. His famous line is like, basically, if I die and I have not purified, what happens then? And then he tells you.\n\nAnd it would give us incredible wisdom fear. It's so potent. Chapter four, there's a ton about death and impermanence and faults of delusion and what happens with delusions.\n\nThat's teaching us the second noble truth, right? We should abandon origins and implicitly teaching us the third and fourth noble truth. We should practice the path, uproot the delusions and attain cessations.\n\nAnyway, I'm not going to go through every chapter, but if we look with those eyes, like, I really want this to oppose my attachment. I really want this to destroy my interest in samsara. I really want this to make me think destroying my delusions is the most important job in my life.\n\nOr, I really want to realize emptiness and develop concentration. That's the third noble truth. If those are our intentions and our wishes, as we go through the text, we will be bombarded with teachings on how to do that everywhere.\n\nWe just have to read practically, really looking for that. It's like you are a lawyer. If you're sent to read documents to try to prove the case, the lawyers are very skilled at this.\n\nThey can see ways to prove the case in things that other people would go, oh, that's just something that happened. And the lawyer is going, no, this is going to crush the opponent. Like that.\n\nIt's like reading critically. Seeing something that other people might not see is there based on an intention. So we always want to read this way.\n\nIt's like reading practically. What am I trying to get out of this? And then as we read the text, how is this teaching me that?\n\nAnd then we'll definitely get those lessons. Thanks. Ben, you had a mystery hand up there.\n\nIs it gone?"
      },
      {
        "speaker": "Fran",
        "time": "1:11:46",
        "text": "I don't have the question anymore."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:11:49",
        "text": "Cool. Okay. We're just going to have to suffer.\n\nJust wondering. I was going to think it was like... No, anyway, I'm not going to go there.\n\nRyan, yes."
      },
      {
        "speaker": "Ryan",
        "time": "1:12:08",
        "text": "You asked us to ponder about delusion. We want to get rid of how this book can help us. And I'm thinking I want to get rid of these two sets, attachment and discontentment, which is specific to this book, especially Chapter 8, Concentration.\n\nAnd I'm thinking how is this book and being in TTP going to help me with attachment and just counter-discontentment, jumping from thing to thing. And I don't know the answer. I read many books before.\n\nI've been to quite a few teachings, quite a few retreats, still have attachment, still occasionally discontent. So I can't answer the question. I wonder how will I know?\n\nHow do I know even to answer this question? How can this book and being in TTP with this anger help me with getting rid of discontentment once and for all? Yes, good question."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:13:24",
        "text": "You'll find out. I would encourage you to choose discontentment and not attachment as a whole, too. Because often when we're working with delusions, there are many different ways it manifests.\n\nSo for example, if we're trying to develop patience, it can be patience around lots of different things. So for example, being patient with ourself. That's different a little bit than being patient with others, or being patient with our spiritual practice, or being patient with sickness.\n\nAnd it's like, yes, they're all patience, and yes, we can work on all of them, but it's actually quite nice to choose an area or a little nuance on how to work on it that's very practical and relevant to what we need. And so, yeah, of course, we want to work on attachment as a whole, and working on attachment as a whole is going to help with discontentedness. But discontentedness is just attachment.\n\nIt's just a version of how attachment manifests. So it's like attachment to the future, mostly, or attachment to something we don't have. So, yeah, make that the focus, and then you'll figure out how to make this book work for that.\n\nOkay, let's continue. Okay, so let's not make it a waste of time, that's the point. And having a clear focus, a clear aim, will help us do that.\n\nThere now follows a brief description of the contents of each of the ten chapters of the root text. Chapter 1. The ultimate goal of the Buddhist spiritual practice is the attainment of a fully awakened state of mind.\n\nThis completely perfected state, variously known as enlightenment, Buddhahood, or the highest nirvana, can be achieved by anyone who removes the gross and subtle obstructions clouding their mind and develops positive mental qualities to their fullest potential. However, we will not be able to attain this fully awakened state if we do not first develop bodhicitta, the mind of enlightenment. What's bodhicitta?\n\nIt's the continual and spontaneous state of mind that constantly strives to attain this perfect enlightenment solely for the benefit of all living beings. As will be explained later in this commentary, bodhicitta is developed by training the mind in either of two ways, practicing the sevenfold cause and effect meditation, built around the remembrance of motherly love, or exchanging self with others. In order to generate this precious bodhicitta, we must think deeply about its many benefits.\n\nA business person will put a lot of effort into a particular transaction if they understand beforehand that there is much profit to be gained. In the same way, if we see the many benefits of bodhicitta, we'll strive continuously to develop it. For this reason, the first chapter consists of a detailed explanation of these benefits.\n\nSo we love this. This is like Shantideva understanding Buddhist psychology perfectly. From faith comes aspiration, from aspiration comes effort.\n\nSo of course, what else would you do in the first chapter? In a book about developing bodhicitta, the only thing you could do first is talk about its benefits. Anything else would be unwise and superfluous.\n\nBecause we need effort, joyful effort. To get effort, we need a wish. We don't need a wish.\n\nWe need to appreciate its benefits. We need faith. So of course, Shantideva starts with the benefits of bodhicitta as the first chapter.\n\nIt would make no sense to do anything other than that if one understood the mind, and how psychology works. So it's just very beautiful how this is all organized. It's a sign of a real spiritual master.\n\nAnd it can teach us about how to prepare our own teachings, the way the book is designed. Let's see, this is based on understanding human psychology. We're going to look at bodhicitta a ton throughout the whole book, so we don't need to get into it in too many details right now.\n\nOne thing I will say is that we might know that bodhicitta, that the path that the bodhisattva is the practice of the six perfections. The six perfections are giving, more discipline, patience, effort, concentration, and wisdom. There are six of them.\n\nAnd so, for example, let's say you tried doing your six sessions of guru yoga practice this week, and it was just dead, and uninspired. Maybe you want to make one each of the six perfections. So your first morning one is your giving a few hours.\n\nAnd then you got your moral discipline a few hours. And then you got your patience a few hours. And then you got your effort, and then you got your concentration.\n\nAnd then, yay, for evening, it's wisdom. Think about emptiness. Like this.\n\nIt could just be really simple like that. Or when you go through the six sessions, you could just simply remember the six perfections briefly and just think, okay, for the next three hours, how am I going to bring in the six perfections? Okay, maybe I'll bring giving here by being generous with my time, with that person who's a little bit difficult to be around.\n\nAnd then I'll bring a moral discipline over here by opposing myself cherishing in that incredibly boring meeting I have to go to. And then over here, I'll practice patience when that one person talks in that boring meeting, and I want to scream at them. And I'm just going to welcome that wholeheartedly, thinking that's my karma from all the times I've talked in boring meetings and bored everyone's minds to pieces.\n\nAnd then I'll bring in one of the efforts. Maybe I'll bring in the effort of non-discouragement by remembering my Buddha nature at some point in those three hours. And concentration, I'm just going to not look at my phone too much and try to pose distraction a little bit.\n\nAnd then wisdom, I'll remember everything's like a dream here and there, and like maybe in this part and that part. It's not like a heavy thing, it's just fun. It's quite nice to do this.\n\nAnd we're just starting to put the six perfections into our life. I'm not saying you have to do that. I'm just trying to show an example of how we can bring these six sessions alive.\n\nSo it could just be a giving few hours, or maybe it's like thinking through those three hours how to bring in the six perfections. I often find if I'm in a bad mood, and I do a six perfection, like a little checklist, I will almost always find one that is highly deficient. And it's very helpful.\n\nIt's like a quick diagnostic. You know how the doctor checks to get your blood pressure, and checks your heartbeat, and this and that. Just like quick little things that get a broad overview of what's going on.\n\nYou just go, OK, do I have a mind of giving right now? Maybe that's not the problem. What about more discipline?\n\nOften that's it, because it's a self-cherishing mind. But maybe you're like, yeah, I don't know. Then eventually maybe you get to concentration.\n\nYou're like, wow, I'm just letting my mind wander all over, to the past and to the future. I'm just letting it be distracted on autopilot. Oh, that's why I'm unhappy.\n\nOh, that's simple. I'll just stop doing that. Put my mind somewhere a little bit more focused right now.\n\nOr we get to wisdom and go, ooh, yeah, I'm just too intense right now. I just need to live a bit more lightly. Get a light touch, feel myself like an actor, like an actor in a dream.\n\nSo these six perfections are just to be put into daily life, right? And we want to really let them be suffused in our life like this. Chapter 2.\n\nIf we're to develop bodhicitta, we must destroy all obstacles hindering its growth, as well as accumulate the necessary prerequisites for its cultivation. The main obstacle developing bodhicitta is evil. Thundercrack.\n\nEvil. It's a great word. I'm so glad this is the word used.\n\nGot to bring it back. Try to bring it back in your conversations with people. I mean, it kind of is back, actually.\n\nBut anyway, it can bring it more back. Because it's the delusions and negative karma that's evil. It's not people.\n\nPeople can't be evil. Because people are our mothers. It's only delusions and negative karma that are evil.\n\nBut yeah, bring it back. It's a great word. Defined as that which has the potential power to produce suffering.\n\nSo it's great to know. No humans have the potential power to produce suffering for us. Isn't that nice to know?\n\nNo living beings have the potential power to produce suffering for us. None of them. As we know in How to Solve Our Human Problems, Geshe-la says, circumstances and other people have no power to make us feel bad.\n\nBut the most they can do is trigger the potentials that already exist in our mind, which is our karma. So there is lots of talk about blaming other people for suffering in the world. And it's very nice as Buddhists to not buy into that rhetoric and to be courageous and to be brave and understand the truth.\n\nSo it's never people. People can't actually create our suffering, which is great news. It's only delusions and negative karma.\n\nBecause we have a large accumulation of such misery-producing tendencies from the non-virtuous actions we've done in the past, we find it extremely difficult to give birth to the precious and virtuous thought of bodhicitta. Yeah? Agreed?\n\nYeah. 100% agreed. It's quite tricky to give rise to this thought.\n\nSo this is just due to all the negative karma in our mind. The misery-producing tendencies. They're just tendencies, though.\n\nWe can purify every single one of them. We do have a Vajrasattva special day course coming December 6th, which I'm very excited for, so in a month or so from now. So please do come along if you'd like to learn more about destroying evil.\n\nWhile poisonous plants grow together in profusion, it is virtually impossible for a medicinal seed to sprout. Similarly, the virtuous thought of enlightenment will not arise in a mind choked by the weeds of non-virtue. Therefore, in Chapter 2 of his guide, Shantideva explains how to prepare the mind for the cultivation of a supremely altruistic attitude by uprooting and weeding out all that is potentially harmful to its growth.\n\nThis purification of evil is accomplished by exposing our accumulated non-virtue and then eradicating it by means of the four opponent powers explained in this chapter. Yes. Good riddance.\n\nI'm just going to say, we're not going to spend time on the summary much. I'm just going to say a couple of little words here, and then keep going. This phrase, exposing our accumulated non-virtue, is very important.\n\nAs we might know, the word confession in Tibetan means cracking open a rotten log and exposing it to the sun. That's the word. I don't know why they have a word for that, but that's the word.\n\nI guess it's a thing you do a lot in Tibet. But that's the word for confession. Cracking open a rotten log and exposing it to the sun.\n\nSo we live in a world where it's very easy to hide. Hide away. The digital world has not helped this at all.\n\nIt has made it much easier to hide away, run away, and disappear off into a little corner, and to basically become more and more private, cut off. This is an outer thing that's happened, and COVID and stuff like that hasn't helped. But there's also a related inner effect.\n\nIt's one of running away. Running away. It's escapism, basically.\n\nWhat we definitely don't want to do is run away from our own mind and the stuff in there. I'm going to butcher the famous quote from Mr. Dostoevsky about this, but it's something like this. Whatever you do, don't lie to yourself.\n\nIf you lie to yourself, you're not able to be kind to yourself, and you're not able to love others. By not being able to love others, all hope is lost in the world. Something like this.\n\nThat's my butchering of it. But the main point is, whatever you do, don't lie to yourself. It's one thing to lie to others, which at least has some strategic reasons.\n\nNot good karmic reasons, but at least it's strategic. Lying to ourself doesn't even have strategic reasons. It's just completely pointless.\n\nBut we have psychic defenses against the truth in our mind. We have, really. Some of us have built up walls over the truth in our mind.\n\nParticularly if we have habits around perfectionism, this will almost definitely be true, because it feels too painful to see the imperfect. So we create walls around that. This image of confession, cracking open the rotten log, exposing it to the sun, is so lovely.\n\nIt's just like saying, it's not by hiding it that it goes away. It's by exposing it to the sun that it goes away. So we don't want to lie to ourself.\n\nWe can ask ourself if we do that, and why we do that, if so. We want to become super, super, super good at seeing the flaws and delusions in our mind, and still feel just as kind to ourself as we did before we noticed them. That's a skill.\n\nCan I feel exactly as kind to myself before and after seeing even some severe delusions and negativity within me? Maybe if we feel like this is really hard for us, maybe that would be something that you'd like to get out of this book, studying this text. What an amazing gift to ourself if we could do that by the end.\n\nI could see all the ugly, yucky bits and just be as kind to myself before and after. Wow, what a gift to future me if I could do that. It would be so generous and kind to future me to learn that skill.\n\nThis is one of the nice things about our little data sharing at the beginning. I often do petition for attempts at something that don't work out at all. I get sometimes people share them, and I'm always so happy when people do.\n\nBut that's always the hardest stuff to share. I tried this, and it just went terribly. I hated it.\n\nI just totally forgot. It's just great to just say that, because that's part of our data collection. We're not just saying it's always going to work out.\n\nIt's always going to be easy. Please do feel highly encouraged to share that. Just frankly, it's not performative or something like that.\n\nIt's not feeling guilty and terrible about ourself. We're just going, yep, try that. Woo!\n\nThat was terrible. That didn't happen at all. Ha, ha, ha, ha, ha.\n\nLike that. Just totally honest and frank. No one cares.\n\nThey're probably happy that you said it. They're probably thinking, phew, them too. Nice.\n\nWe both didn't make it happen. Great. Let's learn from that.\n\nThis is a part of that aspect of the class. It's not just the woo-hoos. It's the, like I tried this and it didn't work at all.\n\nThis is what I learned. That's about cracking open the rotten log. Last bit.\n\nWe'll take a breather. Chapter three. However, purifying negativity is not by itself sufficient for our purposes.\n\nWe must also accumulate a great deal of merit or positive potential energy. This comes from the practice of virtue. In the same way that it would be unsuitable for a beggar to receive a king and shabby unkempt surroundings, so too it is impossible for a mind bereft of merit to entertain the precious bodhicitta, the king of all thoughts.\n\nThose who wish to invite this honored guest into their minds must first acquire a great wealth of positive mental energy. After this is done, it is then possible to seize and maintain this precious mind of enlightenment. Therefore, in chapter three, Shantideva explains how to acquire and hold on to bodhicitta.\n\nSo I'm just going to say something briefly here about depression. Because this is endemic. And if this is something that we personally deal with, it's okay, right?\n\nIt's very common these days. But one component of it is like a lacking of merit in our mind. Which is a totally fixable thing.\n\nIt's creating more merit. As human beings, we use a ton of merit up, having this precious human life, with all of its freedoms and endowments. We're like using a large swath of our merit, kind of day by day, just by existing.\n\nAnd so, that's fine, to use the merit that we have, to be a human. But we need to also be replenishing that merit, purposefully, through creating it and dedicating it. It's not complicated to create lots of merit, mandala offerings, water offerings that we do in our shrine each day, generating a little bit of bodhicitta, whatever.\n\nIt's not complicated. But if we do find ourselves in those kind of states, and maybe that's something you want to work on through the book, if that's your experience, like kind of being plagued by these kind of depressive states, you can think like, hmm, I want to get to the bottom of that, and maybe being very focused on merit creation could be one of the answers here. I'm not saying the only answer, but there's a link between creating a lot of merit and having this sense of incredible vitality, and energy, and confidence, and strength in our heart.\n\nAnd a lot of those things go a long way to the symptoms that are associated with a depressive mindset. It really does help with a lot of those kind of symptoms. I think this is something to really ponder and think about.\n\nIf you've never really done an experiment where you really, really, really, really focus on accumulating merit principally for a period of time, then I would invite you to do so. If this is a kind of problem that you find, that there's minds and symptoms associated with a depressive mindset, do an experiment where you just think like, okay, my other meditations are going to put on the side for a bit. I'm not going to focus so much on the comprehension of things and acquiring new information.\n\nI'm just going to focus on accumulating tons of merit, like a madman, just like someone who's obsessed with making wealth and devotes their life to accumulating wealth. It's like that. But I'm going to do it with merit.\n\nI'm going to just see what happens and do an experiment and see if Buddha is telling the truth. And just like, are you telling the truth or not about the effects of merit on my mind? Let me see.\n\nOkay, so those are just a few little bits and pieces. The main point of this whole section, again, just to drill at home, we want to have this feeling like, I want to change from studying this book. I want to pop out a different me.\n\nI mean, we're going to change, but I want to change for the better from studying this text. And to change for the better, we want to have a clear aim. It's very nice.\n\nSamit and Ryan both share their aims. Samit, improving pronunciation. Ryan, posing discontentedness.\n\nBut each one of us, it would be really nice to have a clear focus. And it might shift and change as we go, but have something that we're working towards about this text. Okay, I think that's it for now.\n\nWe're going to take a break and come back and get into some other extra fun stuff. And we'll come back at 6.10. Just a reminder that we do have our paint night this Friday, held by the world-famous Grady Barker of papier-mÃ¢chÃ© monkey fame. And we're painting the eight auspicious symbols.\n\nSo it should be a lovely night. So 7 to 9, Friday. Okay, let's dedicate and then we'll come back at 6.11. We can think through the virtues we've collected, through practicing, meditating, discussing. May all living beings find lasting peace of mind, enlightenment. Okay, thank you. All right, see you soon.\n\nThank you."
      }
    ]
  },
  "session2": {
    "chantedPrayers": {
      "time": "1:51:00",
      "text": "LIBERATING PRAYER\n\nO Blessed One, Shakyamuni Buddha,\nPrecious treasury of compassion,\nBestower of supreme inner peace,\nYou, who love all beings without exception,\nAre the source of happiness and goodness;\nAnd you guide us to the liberating path.\n\nYour body is a wishfulfilling jewel,\nYour speech is supreme, purifying nectar,\nAnd your mind is refuge for all living beings.\n\nWith folded hands I turn to you,\nSupreme unchanging friend,\nI request from the depths of my heart:\n\nPlease give me the light of your wisdom\nTo dispel the darkness of my mind\nAnd to heal my mental continuum.\n\nPlease nourish me with your goodness,\nThat I in turn may nourish all beings\nWith an unceasing banquet of delight.\n\nThrough your compassionate intention,\nYour blessings and virtuous deeds,\nAnd my strong wish to rely upon you,\nMay all suffering quickly cease\nAnd all happiness and joy be fulfilled;\nAnd may holy Dharma flourish for evermore."
    },
    "teaching": [
      {
        "speaker": "Student",
        "time": "1:59:33",
        "text": "That doesn't make sense. But then you're just running out there and that's, you know, I mean, I thought... Yeah.\n\nI'm running out of time."
      },
      {
        "speaker": "Student",
        "time": "1:59:42",
        "text": "I'm running out of time. You're running out of time."
      },
      {
        "speaker": "Student",
        "time": "1:59:50",
        "text": "I don't think you're running out of time. There was a co-op, and it was a lot of different lawyers and people that lived there, and that was not the way they delivered it. I want to see it everywhere.\n\nI want to see it right now. I really don't know who any of them are. I know.\n\nI know. I know. I know.\n\nI know. I know. I know.\n\nit's Sunday morning."
      },
      {
        "speaker": "Student",
        "time": "2:05:36",
        "text": "I feel really comfortable being here with you. We really do, like, in the beginning ourselves, talk about the actual experience. It's not like sometimes we're real dangerous.\n\nAlmost."
      },
      {
        "speaker": "Dale",
        "time": "2:05:45",
        "text": "It's just like, okay, so I'm a warrant officer."
      },
      {
        "speaker": "Student",
        "time": "2:05:48",
        "text": "Who's that? I don't know. I know, I'm just saying.\n\nI can see it, like, it could be just as simple as it sounds to me. You know. I think what I found yesterday.\n\nI was like, okay, I don't do it. So you need to get your actual experience. Get a job interview.\n\nI was like, okay. I was pretty bad. I'm gonna need to go to hell.\n\nAnd basically all of that is very, very simple. But that is just what we do. You just have to get the job.\n\nIt's pretty good. I'm glad you're having all of these. Yeah, I'm not going to have that because it's my job.\n\nYes, it's just like, it was great. Yeah, I felt like I was like, it's like I'm abroad. I made some friends.\n\nMonday night. I'm amazing at that. I'm really good at art.\n\nI feel like I'm out there. It's just like, No, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no"
      },
      {
        "speaker": "Student",
        "time": "2:07:49",
        "text": "My son, Richard, is he... What?"
      },
      {
        "speaker": "Student",
        "time": "2:07:51",
        "text": "He is over there Oh, yeah, he's there I don't see anything I don't see anything I've seen him I think he is over there I don't want to miss out, yeah I don't want to miss out. I don't want to miss out, yeah I don't want to miss out, yeah I don't want to miss out. I don't want to miss out, yeah I don't want to miss out, yeah I don't want to miss out, yeah I don't want to miss out, yeah I don't want to miss out, yeah I don't want to miss out, yeah I don't want to miss out, yeah I don't want to miss out, yeah I don't want"
      },
      {
        "speaker": "David",
        "time": "2:10:19",
        "text": "to miss out, yeah I don't want to miss out, yeah I don't want to miss out, yeah I don't"
      },
      {
        "speaker": "Student",
        "time": "2:10:49",
        "text": "want to miss out, yeah I don't want to miss out, yeah I don't want to miss out, yeah I don't want"
      },
      {
        "speaker": "Fran",
        "time": "2:11:37",
        "text": "to miss out, yeah I don't want to miss out, yeah I don't want to miss out, yeah I don't"
      },
      {
        "speaker": "Student",
        "time": "2:11:49",
        "text": "want to miss out, yeah I don't want to miss out, yeah I don't want to miss out, yeah I don't want to"
      },
      {
        "speaker": "Kadam Kyle",
        "time": "2:17:15",
        "text": "And also our study and practice of this book with our Sangha here. Envision what it would look like to have made that change, to experience the shift in that delusion, and admire how beautiful that would be. And in our own time, it can gradually arise.\n\nMore practice. More practice. Alright, so this is a nice exercise to do anytime you'd like.\n\nIt's like a mini tantric meditation, where instead of imagining enlightenment, we take a personal change we want to see in our mind, and try to envision, imagine what that looks like, and then admire its beauty. And this will start to make us believe that that's possible, and then we'll develop the wish to attain that state for ourself. And it's a very encouraging activity.\n\nSo for example, when you do the six sessions in Guru Yoga practice, you might think, sometimes we might feel like, imagining myself as Vajrayogini or Heruka, it's a little bit distant right now. Okay, let me do like a little bridge imputation, like something on the way to that. Okay, let me imagine what it would be like to have a mind of renunciation, no attachment, just looking for happiness from within, and admire how beautiful that is.\n\nOr imagine what it would be like to have joyful effort, mind that delights in virtue, and then just admire how beautiful that would be, etc. Okay, so that's a very, very useful activity. And from a teaching point of view, if we teach general program classes and so on, this is a really nice thing to do, to bring into any class that we teach.\n\nIf we talk about a subject, it's nice to paint the picture of what it looks like, to have experience of that subject, and let people appreciate that and admire that. And we can even bring that into the meditation that they do in the class. Like, imagine what that looks like and admire it, and find how beautiful it is, and then wish for it a bit.\n\nAnd then maybe you do the traditional meditation on that object after that. And in that way, we kind of develop this faith in what we're actually working on, in the mind's full of blessings and inspiration. Okay, so that's just a little bit about that.\n\nAnd then, let's look a little bit more. Chapter 4. Once we've taken hold of the precious bodhicitta, we must prevent it from decreasing.\n\nThis is done by conscientiously attending to the virtuous actions of our body, speech, and mind. This conscientiousness is the subject of Shantideva's fourth chapter. So we're talking about this a little bit in the break.\n\nConscientiousness is a really special mental factor. What does it say to mind? It's the part of the mind that cherishes virtue and basically hates non-virtue.\n\nLike, hates delusion. Doesn't hate herself, but hates delusion and non-virtue. Again, we don't ever direct that mind towards people.\n\nBut it's great to basically despise delusions, non-virtue. Fantastic. So we'll develop this mind of conscientiousness, which loves, cherishes virtue so much.\n\nIt loves virtue and is deeply anti-non-virtue and delusion. So that's chapter 4. You can even write a poem, if you like.\n\nHow much you hate your favorite delusion. It'd be great. Great activity.\n\nI actually did this when I first became a Kadampa Buddhist. My most painful delusion was addiction, basically, which is attachment to substances. So I wrote a poem.\n\nHow much I hate that delusion. I shared it with my teacher and he said, Ah, very good. Very, very good.\n\nHe was very happy with me. Like, good job. Very, very happy.\n\nIt's a total change, right, to turn on the delusions. Instead of turning to ourselves or other people. It's a total change.\n\nIt's a dharma gift. Okay. Yeah, we want to hate them.\n\nExactly. Exactly. Yeah, you don't hate your attachment.\n\nWe like it. We like it. Oh, it feels good."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "2:25:59",
        "text": "It's got me very popular and rich and whatever. Yeah. It's keeping me safe, my attachment or my anger, right?\n\nThat's what we think about anger. It's protecting me. It's like my alert system.\n\nKeeps harm away. There's all sorts of ways that we really actually view our delusions as friends. But they're not.\n\nAs Geshe says in How to Understand the Mind, the only function of delusion is to cause harm. That's a lovely thought to ponder. The only.\n\nChapter five. Having developed and then stabilized bodhicitta by means of conscientiousness, we must strive to bring this mind to its complete fruition, perfect enlightenment. This is done by taking the bodhisattva vows and practicing the six perfections.\n\nGenerally, the first perfection to be explained is giving. In this text, however, Shantideva discusses giving in his tenth and final chapter, together with his dedication. His reason for doing so is that giving or generosity is part of the general dedication to all living beings of the good and beautiful things in the universe.\n\nTherefore, Shantideva begins discussion with what is generally presented as the second of the perfections, the practice of more discipline, and a chapter entitled Guarding the Mind with Alertness. If you ever do anything particularly virtuous, you can use the tenth chapter, the dedication chapter, especially using Shantideva's words in Guide to the Bodhisattva's Way of Life. So, for example, if you go on a long retreat, this is a great way to end a retreat.\n\nYou just go through the verses in Chapter 10, and you make this huge, extensive dedication. It's often people will do this even formally, like in a long retreat, like up at the temple, we do this often, the last session, we'll read out maybe the verses from there. Or from our own life, like we complete a spiritual journey, like we complete one of the preliminary guides and we work on something for a long time, and we kind of reach a sense of fruition, and we're really proud of it.\n\nThen we can do like an extra, sort of voluptuous dedication using the tenth chapter. And this is very nice. It's incredibly like evocative and imaginative and powerful and vast, and hits every kind of scope and every little nook and cranny.\n\nAnd so Geshe is just here, he's clarifying also why we start with guarding alertness. Chapter 6 to 10, each remaining chapter is devoted to one of the perfections. Chapter 6 to 8 discuss patience, effort, concentration, while Chapter 9 is devoted to an extensive explanation of wisdom.\n\nAs stated before, the tenth chapter deals with giving and dedication of merit. As we know, Chapter 6, right, has basically became how to solve our human problems because it's so uniquely useful. That's all how to solve our human problems is.\n\nShantideva's Chapter 6, sliced and diced, and some little bits left out that are a little bit too complicated for a beginner, and slight rewording of a few things. So just like, it's amazing, right, to think like this book, which if you teach Dharma, you know like how often you end up relying on it because it's so incredible. It's like almost the most beginner, some of it is just like some of the most beginner-friendly accessible stuff, and Shantideva just spouted it spontaneously 1,300 years ago.\n\nJust riffed it on the throne, just like, da-da-da-da-da-da, da-da-da-da-da-da. It's just so incredible, right, this beautiful little book. So, yeah, we can just see how closely connected we are to this book, Meaningful to Behold, and Shantideva, and how the people who come to our centers are too, because they're so connected to that text often, and so thankful for it, and the wisdom contained in it.\n\nMaybe actually we'll look at the nugget from in there in a second. The development of bodhichitta takes place in three stages. The ten chapters of Shantideva's book cover this three-fold development, which is outlined concisely in the following often-recited dedication prayer.\n\nMay the precious supreme bodhichitta grow where it has not yet grown. Where it has grown, may it not decrease, but flourish forevermore. This is a lovely practice not just in ourselves, but in other people that we see.\n\nMay bodhichitta, the precious supreme bodhichitta, grow in that person's heart, and in that person's heart, and in that person's heart. We can just make that prayer as we go around everywhere. We're like bodhichitta gardeners trying to help it grow in the world.\n\nThe mind of bodhichitta is like this engine, this virtuous engine that is self-perpetuating, as explained later in the benefits of bodhichitta with respect to the exhaustible and increasing merit created from bodhichitta. The effects even happen when we're sleeping. It just keeps multiplying merit in our mind.\n\nIt's a nice view to have just to think may I be like a gardener of bodhichitta in this world, the engine of bodhichitta in the hearts of the people of this world. May I become like a gardener, tending to that mind and people. I think with respect to my life, if I die knowing that I helped, there would be more bodhichitta in the world.\n\nIt was a good life. It's a life that was valuable. What an honor because that will continue to go forever and spread.\n\nWe want to be like this. We want to help nourish and let it grow. We want bodhichitta to be nourished in the hearts of others and grown obviously in our own hearts but also in others too because it's forever supportive.\n\nIn the first two lines we pray that those sentient beings including ourselves who have not yet given birth to bodhichitta may do so. Next we pray that those who have already given birth to this altruistic mind may be able to maintain it without letting it decrease. In the final line we pray that those who have cultivated and stabilized bodhichitta may be able to bring it to its full completion.\n\nIn the same order the method of giving birth to bodhichitta is explained in the first three chapters of this text. The way to stabilize it is the subject of the fourth chapter. Whilst chapters five to ten describe the methods whereby the stabilized bodhichitta may be continually increased until full enlightenment is achieved.\n\nPerfect structure. If we practice in accordance with the instructions set forth in the ten chapters of Guide to the Bodhisattva's Way of Life it will not be too difficult to attain the exalted state of mind known as enlightenment or full and complete Buddhahood. In this state all our human potentialities will be fully developed and we will be able to benefit others to the greatest possible extent.\n\nExplanation in the actual text This has four parts. The meaning of the title, homage to the translators, explanation in the meaning of the text, meaning of the conclusion. This is a traditional way of presenting these texts.\n\nGeshe was doing this in line with tradition when he taught these books originally. So this is why it's approached this way. He's respecting the tradition like the old way of doing things.\n\nMeaning of the title The original Sanskrit title of this text is Bodhisattva Karyavatara the Tibetan translation of which is jang chÃ¶b senpai chÃ¶pa lo jigpa In English this can be rendered as a guide to the Bodhisattva's way of life. So we will be using this quite a bit in this class including reading it together a lot once we get to the actual verses. So that's very delightful.\n\nIt is a custom for all works translated from Sanskrit into Tibetan that the original title be presented first. Why is this necessary? There are two reasons for this practice.\n\nFirst of all Sanskrit is considered the most sublime of all languages as well as being the one in which Buddha himself taught. Therefore having the title in Sanskrit helps plant imprints of his holy language on the mind streams of those reading the text. Good to know.\n\nSecondly the title is given in the original language to help us recall the great kindness of those who translated the text from Sanskrit into Tibetan. It is only through the compassion and diligent effort of these translators that Tibetan people and subsequently the western world have had the opportunity to study, meditate on and practice the profound methods contained within this holy scripture. So the meaning there is to develop gratitude especially for those who translated this holy scripture because we can't read Tibetan.\n\nSo yeah we are thankful to some degree for the people who took Guide to the Bodhisattva's Way of Life from Sanskrit into Tibetan but we should be particularly grateful for those who took it from Tibetan into English and taught these texts. Has anyone here done extensive translation work anywhere? It is mind-numbingly challenging to do.\n\nIt's a lifelong endeavor, right? And it's very difficult to translate the meaning. It's not that hard to translate words but to actually translate the meaning you have to do reverse translation which means you translate it both ways.\n\nYou translate it one way and the people who speak that language translate it back into the original language to see if it actually matches and if it doesn't match you redo it again because you got the meaning wrong, right? It's very difficult to do this. And so as we might know when Geshe came to the West he taught in Tibetan and then realized no one is going to learn Tibetan.\n\nNo one is going to learn Tibetan. He was just like they tried for a few years and it was just very pathetic and sad as everyone tried at Menjushu Center to learn Tibetan and he was like well writing is a little on the wall so I'm just going to learn English because this is pointless waiting for everyone to learn Tibetan. So he went to English speaking classes.\n\nThis is where he said that you know they videotaped them as they spoke and made them watch the videos back and so he said it's really good to do this in TTP when people practice teaching like get the video of them and have them watch it back because you see yourself and watch yourself and all the weird things you do. Like I always do this when I'm teaching. Why do I do that?\n\nWhat's wrong with me? So sometimes I'll watch it and just cry. What is wrong with you?\n\nStop rubbing your knees. Who taught you to do that? I see that I have a hole in my sock which I have today.\n\nWhy did you wear a sock with holes in it? What's wrong with you? Today I didn't need the video to see that.\n\nI actually felt the cold floor through my sock. And I was like maybe I shouldn't do a full prostration because then everyone will see my hole. And I thought no I'll let everyone see my sad little dirty sock in my heel.\n\nAnyway the point is the video is very helpful and he learned that from his English study and he just put some time into this translating these texts into English for people of the present generation. And so we can just have incredible gratitude. It's like we didn't do it.\n\nWe didn't learn Tibetan. And even if we learned Tibetan who knows that we would find things that were practical and accessible to us. And Geshe along with a handful of students did all the work of 23 books.\n\n23 books translated and written that's remarkable. It's a miracle basically. So we should be incredibly grateful.\n\nAnd a sense of like like indebtedness. Homage of the translators. Before starting their work on the text the original Tibetan translators paid homage and made prostration to all the Buddhas and Bodhisattvas in order to remove hindrances and ensure completion of their work.\n\nSuch homage is in accordance with the tradition laid down by the great Dharma kings of Tibet. This tradition stipulated that the translator's homage should indicate to which set of basket pitaka in Sanskrit of Buddha's teachings the original Sanskrit text belongs. Thus if a particular text belongs to the set of Vinaya dealing mainly with the training in higher moral discipline then the homage would be to the omniscient one.\n\nIf it belongs to the sutra pitaka dealing mainly with the training in higher concentration then homage should be paid to the Buddhas and Bodhisattvas. Finally if it is contained within the third set the Abhidharma pitaka dealing mainly with the training in higher wisdom then homage is paid to youthful mandugosha mandushri the embodiment of enlightened wisdom. Thus by reading homage we can easily tell into which of the three scriptural categories a particular text falls in this case homage is made to the Buddhas and Bodhisattvas thus it is clear a guide to the Bodhisattva's way of life belongs to the sutra pitaka the set of discourses mainly concerned with meditative concentration.\n\nOh that's nice to know you can tell also by the cover which is some lovely fellow probably Shantideva hanging out meditating in the woods you can be like oh okay that's kind of the point of the book yeah so it's about making our meditative concentration work obviously we don't go hang out in the woods to do this we just do this by seeing dharma and everything and that's a concentrated mind because that's a mind with no distractions Benefits of Bodhicitta the explanation of the meaning of the text the main body of this commentary is divided into two parts the preliminary explanation the actual explanation of the stages of the path to enlightenment preliminary explanation this is three parts expression of worship promise of composition reason for composition EPR E-P-R easy to remember EPR expression of worship promise of composition reason for composition expression of worship the actual text begins with Shantideva's homage or prostration to the buddhas literally to the sagatas those who have gone to bliss the noble sons and daughters and all other venerable objects of worship this prostration is in fact Shantideva's way of paying respect to the three precious and sublime jewels of Buddhist refuge Buddha, Dharma, and Sangha a more detailed explanation of these three jewels will be given later in this commentary for now it is sufficient to state that Buddha is a fully awakened being Dharma is the spiritual teachings such a being gives others to lead them from suffering into satisfaction to temporary and ultimate happiness while Sangha is the community of those following these enlightened teachings why is it necessary to go for refuge to these three objects if a sick person is to get well again they must rely upon a skillful physician effective medicine and sympathetic and attentive nurses in the same way sentient beings caught up in the vicious circle of cyclic existence samsara are all afflicted by the sickness of their delusions having found nothing in which they can take true refuge only by entrusting themselves to Buddha the perfect physician the medicine of Dharma and the Sangha nurses will they ever be cured of their ailments therefore if there is to be an end to our dissatisfaction and suffering we must discover and entrust ourselves to these three precious and sublime jewels okay so as always you know as we're reading this text again we just want to be asking like what's the practice here what are the practices sorry it's like full of Dharma practices all these sections so let's just take an example right so it's like okay why do we go for refuge well if a sick person is to get well they must rely on a skillful physician effective medicine sympathetic attentive nurses and so we ask ourselves maybe like how's my refuge practice like truly relying on the physician of Buddha their medicine of Dharma and the sympathetic and attentive nurses of Sangha you can also ask are we a sympathetic and attentive nurse to our Sangha friends I think we all are so we ask ourselves is that happening for me and if not it's often a sign that our renunciation is weak our renunciation is weak for some reason so we want to improve it right so we're thinking okay my refuge is a little funky a little bit weak that means my renunciation is weak because Buddha Dharma and Sangha matter because of renunciation they're about liberating me from samsara they're not about improving samsara so ah my renunciation okay great how can I improve it what's going on there why is it a bit weak lots of different reasons obviously but like let's just take an example of a practice from how to solve since this is related to Shantideva's work so Geshe says here there are many benefits to be gained from contemplation accepting suffering not only does it enable us to maintain a peaceful and positive mind in the face of distressing circumstances but it also helps us to gain a clear and dispassionate view of the nature of our samsaric situation there's a certain mental stability to be had merely from recognizing that every experience uh oh someone got a Buddha on there sorry about that yeah I don't want that there's a certain mental stability to be had merely from recognizing that every experience of pain or discomfort is the fault of our being caught up in samsara of our being born living and dying in a state of unknowing and confusion ok so this is like um this is a lovely medicine to our pain and our unhappiness this meditation so there's like the fact that there's the pain of being in samsara all the problems right we all know those birth sickness aging death counting what we don't like feeling dissatisfied desires uh being separated from what we do like and more uh so there are those pains and then there's the pain of thinking it's not supposed to be this way and that pain is actually worse than the first pains because it's a total non-acceptance and the pain of non-acceptance is actually much more painful than sickness is because you can have sickness and acceptance then you can be okay but non-acceptance plus sickness is incredibly painful right that's torment so this is such an important meditation right and this is going to make us very interested in refuge but it's also going to give us a tremendous sense of patience in this world it's like um it's basically like we're going through life um uh with it's a little bit like um I don't know uh if you are an actor and you're given a part to play with someone else you're told by the director uh you're let me look at this a little bit in the Sunday class I'll just give a similar example so it's like you're you worked all day and you're really upset um because you're just tired and worn out and you don't feel appreciated and you come home completely burnt out okay that's you and then another person who's doing the acting it's like and you're the spouse and you just sat home all day and but you're lonely uh you can't find a job but you did just sit at home all day and um you're feeling like not appreciated by the spouse who's out all day okay and uh and now you two act together right and we can think like what would happen as they play those parts they would probably get in a fight of some sort right they'd think like okay we're supposed to get in a fight because what we value and what we think is important and what our views are it probably would be a fight right in in reality if the director told one of those people like the person um uh who uh was the worker person right um okay you worked all day and you you know did your job and you're like a bodhisattva you know and you know about your spouse and how frustrated they are and not being able to find a job and how lonely they are and how disappointed they are and they've just been sitting alone feeling inadequate all day and like not good enough and like and you're just so caring and like okay now play the part something like that and so with this meditation what we're doing is we're like cutting in like getting into those preconceived notions the subtext in our mind right and we're saying I'm not gonna let that be pre-programmed in my mind and one of the pre-programming thoughts that is almost always happening unless we explicitly have a thought of renunciation is everything is supposed to work out today I'm supposed to not be in a body that's getting sick that's aging and dying I'm not supposed to be disappointed today I'm not supposed to have uncertainty I'm not supposed to lose what I like I'm not supposed to encounter what I don't like and it's like these thoughts are like they're actually implicit biases being held actively in the mind right so it's like the director is saying okay you're the kind of person who thinks all of those things okay good now go live in New York right and like go to work and get yelled at all day by everyone and like whatever right good luck right well what's gonna happen we're gonna be having an absolute terrible time all day so this meditation is amazing because what we do is we question all those assumptions and we flip every single one of them we just think I'm in samsara so things don't work out ever if they do work out it's shocking and still not technically working out it's just an upgrade in our prison so it's really not much better I'm in a body that's that is a pain magnet it's like a pain vortex it's just designed to get to be filled with pain and suffering and sickness that's the only thing it ends up doing and it's incredibly hard and complicated to not let that happen I'm stuck in one of those oh my god and uh everyone I meet is completely plagued with delusions they're basically hallucinating a reality that's not there uh and they've been in samsara forever they've been wandering forever so have I so we're all the like bottom of the barrel like the buddhas have liberated countless beings we're the bottom of the barrel kicking around together trying to figure out things and make world peace happen and so on right and it's like if we just if we actually make that essentially the expected situation because that's samsara that's just what samsara is those are all just qualities of samsara if we make that kind of the expected situation like yeah that's how things are then when things are that way we just go of course of course they are and and all it does is it makes us want to realize emptiness more we just think of course it's like this I want to realize emptiness more which is the heart of renunciation right I want to go to a place of permanent freedom and we don't fight the samsara truth that's right in front of us we repeal the expectations that it's supposed to be different so this practice is just so helpful right just like practically going through the day again we could do this like six times a day if we think about the three hours that are gonna follow and we're just like okay what expectations do I have of samsara working out for the next three hours like this is gonna be good and that's gonna be good I'm not gonna be in pain and I'm not gonna have a bunch of delusions and they're gonna be nice to me and there's not gonna be weird bad news news whatever right we just like identify all those and then we just repeal all those expectations and we just think I'm in samsara those things are almost like definitely gonna happen and we don't expect it to be other than it is and then we go into those three hours right and and sometimes they will those things will happen and then that will increase our renunciation sometimes they won't happen we'll be pleasantly surprised and then we'll just keep going so this is just a lovely practice and it's like this will make us very interested in refuge right because buddha dharma and sangha matter because they can free us of that situation buddha because he's realized emptiness and the two truths directly and can bless us dharma because it's the dharma of emptiness that frees us of samsara and sangha because those are the people who have realized emptiness the real sangha right it's only buddha dharma and sangha that can help us realize emptiness directly which is what our real freedom is so this is like a way to practice renunciation throughout the day but more like leading towards patience but on the basis of that patience the renunciation will dawn in our mind as we might know Geshe follows with these like beautifully poetic words it says a real problem is not the physical sickness, difficult relationship or financial hardship that we might be currently experiencing but are being trapped in samsara is the real problem this recognition is the basis for developing renunciation the spontaneous wish to attain complete freedom from every trace of dissatisfaction which in turn is the foundation of all the higher spiritual realizations leading to the boundless happiness of liberation and enlightenment but this recognition can only dawn within the clear and open mind of patient acceptance for as long as we're in conflict with life's difficulties thinking that things should be different from the way they are and blaming circumstances or other people for our unhappiness we'll never have the clarity or spaciousness of mind to see what's really binding us patience allows us to see clearly the mental habit patterns that keep us locked in samsara and thereby enables us to begin to undo them patience is therefore the foundation of the everlasting freedom and bliss of liberation yeehaw yeah so we just want to um try to bring this into our life in some way just like repealing these unrealistic expectations of samsara ever working out as Geshe says in samsara all our dreams are broken in the end which is a lovely phrase too we should put that on our sign up front a holiday sign yeah so we're having a special holiday uh thing in our uh window so we'll tell Curtis to put that up in there um and what we'll see is like that that really helps us start to relax like we become a lot less anxious when we live in that truth we become a lot less frenetic we become a lot less controlling of other people we become a lot less perfectionist definitely because we realize how can you be perfectionist in samsara it's impossible almost right it is impossible and so i'm sharing about like how to bring some of these little nooks and crannies purification accumulating merit um thinking about uh renunciation into the succession practice not as encouragement to do all of those things it's impossible to do all of them i'm just trying to share some of them uh because maybe one of them for us specifically is appealing and practical and feels useful like medicine for us and then if we bring it in it might be more like medicine for us not like something we're just checking off in our day and then uh it'll actually help us and bring benefit okay so we'll have um oh sumit you have a hand"
      },
      {
        "speaker": "Student",
        "time": "3:02:27",
        "text": "so what you were saying is great and works a lot what you just said but what um and it's been very helpful for me exactly what you said and i'm i've always been a big fan of you know the lord expectations um but i want to ask a question about this with respect to other people um i've had this i've had this flavor of a conversation i imagine many other people have too which is basically like i look out into the world and in my case this is often in the political context and it's this thing of like how do you expect people to act right and it's like and other people are like i was talking to a this person he's an older black man and he said to me i had a lot of experience and he was basically like uh he said some saying that was basically like uh i had hope and when i stopped having hope i felt a lot better and i'm not espousing his view but it's just like when you realize people suck it's all good right yeah and so anyway so i wanted i wanted to ask you about because this has helped me in so many other contexts and then when i try to apply this to um expectations towards other people it's like well there is no there's no love there right and so i wanted if um yeah i wanted to hear your thoughts on that please"
      },
      {
        "speaker": "Kadam Kyle",
        "time": "3:03:42",
        "text": "do you mean expectations towards other people about like telling them this truth or about how we deal with them being ridiculous the second one yeah yeah that's interesting i'm the exact opposite i find this to be the basis of love for other people because i just think this person is absolutely walloped by delusions so i have no expectation for them to behave reasonably and when i get rid of that then i can love them because i say oh they're just exactly like me there's a little buddha nature in there that is incredibly beautiful and it's so precious that buddha nature and one day it's going to be so exciting when that thing comes out but right now it's covered up profoundly by all sorts of muck and i'm seeing a lot of the muck part of that's my own muck i'm seeing part of it probably is their muck too uh their delusions and so it doesn't make me scorn anyone or look down on anyone disrespect anyone if i can keep that view like it's like a humble mind for me when i can get there it's not like oh you're so terrible it's the delusions are terrible and no surprise that the behavior that comes when someone's controlled by delusions is terrible"
      },
      {
        "speaker": "Student",
        "time": "3:05:06",
        "text": "how is there space in that mind to have a um we talk about like appreciating love for example right like that like that kind of thing where like or cherishing love right um because it's like yeah how is there space in mind to have those two both of those things"
      },
      {
        "speaker": "Kadam Kyle",
        "time": "3:05:23",
        "text": "yeah it's just so strongly seeing that people aren't the delusions so we're always loving the person not the delusion right we're loving the person right and so our affectionate love which i think is what you're referring to is for the person but the delusion and the person are completely different as we know in the um famous sections in um new eight steps on living beings have no faults for example right so the love is for the person it's not for the delusion and actually for me i love people more when i think that the delusions are so horrible and they are not them because i see everything i don't like about that person is actually not the person it's the delusion so yeah we have to revisit those those teachings over and over and over and over and over and over and over and over again and as we know that they're they're taught a lot in dharma centers partially because people don't get them and partially because they're a remedy for a lot of our issues in the world with ourself and with others yeah yeah thanks to me okay let's have the time for discussion uh let's see um let's have jose and ann and fran and byron and ryan and neil and uh sumit and p and maryann and sharon and david thank you hopefully that's everyone"
      },
      {
        "speaker": "Student",
        "time": "3:10:08",
        "text": "I'd love to wear a gun, but you know I don't believe in that."
      },
      {
        "speaker": "Anne",
        "time": "3:10:11",
        "text": "I'd love to get that out of the back of my head. I want to get some sort of renunciation. You know, you're just like, you hear all these stories, and you're like, that looks really amazing."
      },
      {
        "speaker": "Student",
        "time": "3:10:24",
        "text": "You know, you're just like, that looks amazing. And I've got the swag. You know, like that.\n\nWhich is, you know, you could say it's, you know, food design, or whatever. But however, you know. Yeah.\n\nYeah. Yeah."
      },
      {
        "speaker": "Student",
        "time": "3:10:50",
        "text": "Yeah. Yeah. Yeah.\n\nYeah. Right. Right."
      },
      {
        "speaker": "David",
        "time": "3:11:01",
        "text": "I mean, I'm not supposed to do that."
      },
      {
        "speaker": "Student",
        "time": "3:11:25",
        "text": "I kind of bringing real life things. So, I guess I kind of missed it. So the point is, like, it could be something that you just knew and you sent off."
      },
      {
        "speaker": "Student",
        "time": "3:11:36",
        "text": "And then, you're bringing in something that you don't remind."
      },
      {
        "speaker": "Anne",
        "time": "3:11:40",
        "text": "And then, you're just trying to build. So I think that's one way of doing it, kind of how I think your book was, was to like, actually match it with this Brazilian bridging and stuff."
      },
      {
        "speaker": "Student",
        "time": "3:11:55",
        "text": "from the next session to the next session, from here to there. Yeah, when I know that's clarified for you, I was just thinking, what if it isn't very long, and then I drop it, and it's just too late. It's just too late, because I thought that was the exercise, but I was so happy to drop it, and it's like, why was I having to drop it?\n\nI mean, you know, it's like my distractions are extremely bad, so."
      },
      {
        "speaker": "Student",
        "time": "3:12:26",
        "text": "I'm pretty well, I'm pretty well."
      },
      {
        "speaker": "Student",
        "time": "3:12:30",
        "text": "I'm very well-planned for the week, like you said, Marge, I could definitely pack away, but I'm not gonna do it all the same day."
      },
      {
        "speaker": "David",
        "time": "3:12:38",
        "text": "I've been on the weekend a lot of times, but I'm not gonna do it every month. I have to wake up, I have to wait for breakfast. I have to work.\n\nI have to work. And those aren't gonna happen."
      },
      {
        "speaker": "Student",
        "time": "3:12:49",
        "text": "I mean, other people were frustrated or upset, you know, just being, okay, just being, I guess, you know, the lack of choices in this world, or, you know, yeah, you know, yeah, yeah, yeah, yeah. I mean, the illustrations were a good sequence, but when you came in, it really, you know, I don't know, like, it was strange."
      },
      {
        "speaker": "Student",
        "time": "3:13:14",
        "text": "It was a distraction. I was afraid that it would hurt me. Actually, like, because I do feel like, I think it's a distraction to life, but I don't know.\n\nAnd I just like to just imagine that I'm just, you know, which I think probably makes too much. I'm trying to be a bit more meritorious to the situation, but just give it to my magic."
      },
      {
        "speaker": "Student",
        "time": "3:13:38",
        "text": "It was delicious. It was good, because I didn't have a lot. Actually, yesterday, it was just horrible.\n\nBecause I was just sitting with a power bench, and I had a computer, so it was really great. At that moment, I shouldn't have said anything. But today, it was hopeless.\n\nYeah, it was horrible. And that was horrible, because it was too bad."
      },
      {
        "speaker": "Student",
        "time": "3:14:08",
        "text": "But I think that's what I was like. Because it's all based on them."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "3:14:13",
        "text": "That's how you debug the base. It's just so easy to realize. Like, there's no way.\n\nYeah. Yeah. I admire you.\n\nThank you."
      },
      {
        "speaker": "Student",
        "time": "3:14:31",
        "text": "What a relief. To not be bringing up the same subject in a stupid way."
      },
      {
        "speaker": "Student",
        "time": "3:14:39",
        "text": "It's going to be a little different. Yeah, the problems are more or less going to be polarizing. Yeah.\n\nYeah. That's just the self-denial. It's really normal.\n\nWell, I don't think it's going to be the same. It's going to involve a lot of things. That's a problem I have.\n\nMerit patients. Yeah, there you go. I know.\n\nYeah."
      },
      {
        "speaker": "Student",
        "time": "3:15:07",
        "text": "That's weird. I don't know. Merit patients.\n\nYeah. Merit patients. So what I did was...\n\nI said, like, oh, I can't trick the baby."
      },
      {
        "speaker": "David",
        "time": "3:15:20",
        "text": "Because part of the problem I have is, like, I get myself into a panic. I'm not going to make it. I should be doing stuff.\n\nAnd then it's just like, well, some things are joyous and some things are not. I should try harder. Yeah.\n\nYou don't know when things are going to hit. You don't know. Like, finally, it was this week.\n\nLike, finally. Amazing."
      },
      {
        "speaker": "Student",
        "time": "3:15:41",
        "text": "But then when I got home, I was like, all right, I might have had guilt for it. Don't put me in a situation like that. No.\n\nSo I got it. Yeah. I don't know.\n\nWell, I got home. See, just turn it off."
      },
      {
        "speaker": "David",
        "time": "3:15:51",
        "text": "It took a long time. Exactly. Yes.\n\nYou don't know, right? Yeah. There was nothing that...\n\nYeah. It took a while. Also, just, like, I had so many people."
      },
      {
        "speaker": "Anne",
        "time": "3:16:05",
        "text": "That's what I didn't realize."
      },
      {
        "speaker": "Student",
        "time": "3:16:06",
        "text": "I thought there was, like..."
      },
      {
        "speaker": "David",
        "time": "3:16:07",
        "text": "Before I switched jobs, I was able to do that."
      },
      {
        "speaker": "Student",
        "time": "3:16:11",
        "text": "Yeah. I mean, they had the lowest numbers in the industry."
      },
      {
        "speaker": "Student",
        "time": "3:16:17",
        "text": "And it's... There's so much change going on. Everyone wants to do something new.\n\nThey don't. They probably do, though. Because it's like...\n\nThat is affecting that much energy. Well, it's interesting, you know? Right?\n\nBecause it's... Yeah. And it's good.\n\nAnd a lot of it is our traditions. So, remember... Sure.\n\nWe both have a negative relationship."
      },
      {
        "speaker": "David",
        "time": "3:16:45",
        "text": "Apparently, I've heard there's something unique about this."
      },
      {
        "speaker": "Student",
        "time": "3:16:47",
        "text": "Bottom right. Bottom right."
      },
      {
        "speaker": "David",
        "time": "3:16:51",
        "text": "It is. Apparently, something about the flowers is unique. And most white tarots don't have that."
      },
      {
        "speaker": "David",
        "time": "3:16:58",
        "text": "I'm looking forward to it. I think she has two."
      },
      {
        "speaker": "Student",
        "time": "3:17:00",
        "text": "Is there one? Oh, she has the eye. She does have the eye.\n\nShe does?"
      },
      {
        "speaker": "Dale",
        "time": "3:17:04",
        "text": "Yeah. Yeah, I think she has the eye, too. Yeah, I think she has the eye, too."
      },
      {
        "speaker": "Student",
        "time": "3:17:07",
        "text": "Wow, we have two tarots. That's amazing."
      },
      {
        "speaker": "Dale",
        "time": "3:17:10",
        "text": "I haven't heard of that. I guess I haven't really. I just thought she was looking for the green tarot.\n\nYeah. Yeah, there's two, so..."
      },
      {
        "speaker": "Student",
        "time": "3:17:17",
        "text": "Yeah, like, for example, I had never really noticed it. But then in the last part, it goes to like the low-leveling friends."
      },
      {
        "speaker": "David",
        "time": "3:17:25",
        "text": "And... It's strange. That means one of the three.\n\nIt means one of the three tarot cards would be... I would say this. We found that you're gaining a pretty good relationship."
      },
      {
        "speaker": "David",
        "time": "3:17:33",
        "text": "It was like a Brooklyn pre-story with an arm on the sidewalk. You're kidding."
      },
      {
        "speaker": "Student",
        "time": "3:17:39",
        "text": "It was like a four-leaf clover. She was like at the University of New South Wales."
      },
      {
        "speaker": "David",
        "time": "3:17:44",
        "text": "Yeah, she was at the University of New South Wales."
      },
      {
        "speaker": "Student",
        "time": "3:17:50",
        "text": "Oh yeah, I'm actually over-hyped. I'm not over-hyped. You know, it's the thing.\n\nYeah."
      },
      {
        "speaker": "David",
        "time": "3:17:55",
        "text": "So is that, so that's your, you're all yours. I like that, yeah. I admire, yeah, a little bridge generation."
      },
      {
        "speaker": "David",
        "time": "3:18:07",
        "text": "I don't know if that's necessarily a good joke, but I look behind me and I can do that."
      },
      {
        "speaker": "Student",
        "time": "3:18:11",
        "text": "Otherwise, I'm just doing a picture of myself walking through the six directions of a computer, like doing the move here. You want to do her FB? I think there's something that he said in the FB, though, maybe, like the guy who did it, or just like a mom.\n\nI knew her FB. Which version? I'm not sure.\n\nI was trying to do like journal, I was trying to do journal, and pretty much on every journal I would write at the end Today, I'm not going to work, you're definitely not going to work today And it really helped because you're definitely not going to work today And it really helped you too, like practice is especially important"
      },
      {
        "speaker": "Dale",
        "time": "3:18:51",
        "text": "And I think you might be able to do that"
      },
      {
        "speaker": "Student",
        "time": "3:18:53",
        "text": "I mean I think this is a good question I mean I think movies, you know, like incorporate the succession yoga that I'm so great about With my morning offerings I think the offerings also, like I do it, Mahalo, you know, and Ardha But I don't like, it's like if it's not live, I don't necessarily But I think to just do that with the understanding of, you know, today's question and like Yeah, there's going to be an element of these, you know, of the question"
      },
      {
        "speaker": "Anne",
        "time": "3:19:49",
        "text": "This knowledge, and if you bury it, and if you bury it, it just functions, I just don't go around And I do it in a positive way, but it doesn't depend at all"
      },
      {
        "speaker": "Dale",
        "time": "3:19:59",
        "text": "It depends on the time and the situation, but that's what I'm doing"
      },
      {
        "speaker": "David",
        "time": "3:20:07",
        "text": "That's the first two, you know, that I'm trying to do How are you doing?"
      },
      {
        "speaker": "Student",
        "time": "3:20:23",
        "text": "Alright, thank you everyone Order in the court Order in the court, order in the court Welcome to workshop or succession practice Any little nuance that we want to work on over the week?"
      },
      {
        "speaker": "Kadam Kyle",
        "time": "3:21:46",
        "text": "Or just sort of buyer's choice, based on what we need, delusion-wise, Fran?"
      },
      {
        "speaker": "Fran",
        "time": "3:21:55",
        "text": "Byron and I were talking about looking for ways to accumulate merit so that we can fight the delusions Yeah, great idea, yeah Sign me up Ann, yes?"
      },
      {
        "speaker": "Anne",
        "time": "3:22:07",
        "text": "I thought Jose had a great idea that one of the earliest sessions in the day Just like, notice that things are definitely going to go wrong Expect it"
      },
      {
        "speaker": "Kadam Kyle",
        "time": "3:22:20",
        "text": "Agreed It's like my first week when I came here, the center flooded Me and Byron sadly cleaned the basement with a mop that broke within one minute And then the classes I taught that week had water pouring in like a waterfall on the ceiling And then we just had a hole in the ceiling, just with water pouring in And then the hole didn't get fixed for three months And I was like, wow, this is great I thought like Brooklyn was going to be so classy and like It's like, this is like the dumpiest place I've ever been at People have no idea what's going on No one does the Dorje Sugden offerings There's a hole in the little ceiling And we're not fixing it till December It didn't get fixed till December, we just had a hole Squirrels could come in, you know But it was great, it was just fantastic It was just a smack right in the face Day one This is a dump It was like, oh, fantastic And it's just gotten better, you know It's just accepting the dump of Brooklyn So anyway, it's just a great, yeah, I agree It's a great early day practice, yeah Okay, I think that's good Let's do the dedications We'll just do the Nine-Line Mixed Sama, please Thank you"
      },
      {
        "speaker": "Student",
        "time": "3:25:21",
        "text": "And restore the covenants in me"
      },
      {
        "speaker": "Kadam Kyle",
        "time": "3:29:05",
        "text": "Thank you. Okay, thanks everyone. Thank you."
      }
    ],
    "conclusion": []
  }
}