{
  "classId": "2026-02-01",
  "date": "February 1, 2026",
  "teacher": "Kadam Kyle",
  "speakerMap": {
    "Speaker 1": "Kadam Kyle",
    "Speaker 3": "Prayer Chanter",
    "Speaker 4": "Sumit",
    "Speaker 5": "Fran",
    "Speaker 6": "Anne",
    "Speaker 7": "Student",
    "Speaker 8": "Mimi",
    "Speaker 9": "Dale",
    "Speaker 10": "Adriana",
    "Speaker 2": "Student (breakout group)"
  },
  "session1": {
    "chantedPrayers": {
      "text": "<strong>Liberating Prayer</strong>\nO Blessed One, Shakyamuni Buddha, precious Treasury of Compassion, Bestower of Supreme Inner Peace. You who love all beings without exception are the source of happiness and goodness, and you guide us to the liberating path. Your body is a wish-fulfilling jewel, your speech is supreme, purifying nectar, and your mind is refuge for all living beings.\n\nWith folded palms I turn to you, Supreme unchanging Friend. I request from the depths of my heart, please give me the light of your wisdom to dispel the darkness of my mind and to heal my mental continuum. Please nourish me with your goodness, that I in turn may nourish all beings with an unceasing banquet of delight.\n\nThrough your compassionate intention, your blessings and virtuous deeds, and my strong wish to rely upon you, may all suffering quickly cease and all happiness and joy be fulfilled, and may holy Dharma flourish forevermore.\n\n<strong>Going for Refuge</strong>\nI and all sentient beings, until we achieve enlightenment, go for refuge to Buddha, Dharma, and Sangha.\nI and all sentient beings, until we achieve enlightenment, go for refuge to Buddha, Dharma, and Sangha.\nI and all sentient beings, until we achieve enlightenment, go for refuge to Buddha, Dharma, and Sangha.\n\n<strong>Generating Bodhichitta</strong>\nThrough the virtues I collect by giving and other perfections, may I become a Buddha for the benefit of all.\nThrough the virtues I collect by giving and other perfections, may I become a Buddha for the benefit of all.\nThrough the virtues I collect by giving and other perfections, may I become a Buddha for the benefit of all.\n\n<strong>Four Immeasurables</strong>\nMay everyone be happy,\nMay everyone be free from misery,\nMay no one ever be separated from their happiness,\nMay everyone have equanimity, free from hatred and attachment.\n\n<strong>Visualizing the Field for Accumulating Merit</strong>\nIn the space before me is the living Buddha Shakyamuni, surrounded by all the Buddhas and Bodhisattvas, like the full moon surrounded by stars.\n\n<strong>Prayer of Seven Limbs</strong>\nWith my body, speech, and mind, humbly I prostrate, and make offerings both set out and imagined. I confess my wrong deeds from all time and rejoice in the virtues of all. Please stay until samsara ceases and turn the Wheel of Dharma for us. I dedicate all virtues to great enlightenment.\n\n<strong>Offering the Mandala</strong>\nThe ground sprinkled with perfume and spread with flowers,\nThe Great Mountain, four lands, sun and moon,\nSeen as a Buddha Land and offered thus,\nMay all beings enjoy such Pure Lands.\n\nThe objects that give rise to my attachment, hatred, and confusion, my friends, enemies, and strangers, our bodies and enjoyments — please accept these and bless me to be released directly from the three poisons.\nIDAM GURU RATNA MANDALAKAM NIRYATAYAMI.\n\n<strong>Prayer of the Stages of the Path</strong>\nThe path begins with strong reliance\nOn my kind Teacher, source of all good;\nO Bless me with this understanding\nTo follow him with great devotion.\n\nThis human life with all its freedoms,\nExceedingly rare and most meaningful —\nO Bless me with this understanding\nAll day and night to seize its essence.\n\nMy body, like a water bubble,\nDecays and dies so very quickly;\nAfter death come results of karma,\nJust as the shadow of a body.\n\nWith this firm knowledge and target of remembrance\nBless me to be extremely cautious,\nAlways avoiding harmful actions\nAnd gathering abundant virtue.\n\nSamsara’s pleasures are deceptive,\nGive no contentment, only torment;\nSo please bless me to strive sincerely\nTo gain the bliss of perfect freedom.\n\nO Bless me so that from this pure thought\nCome great unfailing conscientiousness,\nTo keep as my essential practice\nThe Dharma’s root, the Pratimoksha.\n\nJust like myself, all my kind mothers\nAre drowning in samsara’s ocean;\nO So that I may soon release them,\nBless me to train in bodhichitta.\n\nBut I cannot become a Buddha\nBy this alone without three ethics;\nSo bless me with the strength to practise\nThe Bodhisattva’s ordination.\n\nBy pacifying my distractions\nAnd analyzing perfect meanings,\nBless me to quickly gain the union\nOf special insight and quiescence.\n\nWhen I become a pure container\nThrough the karma path, bless me to enter\nThe essence practice of good fortune,\nThe supreme vehicle, the Tantra.\n\nThe two attainments both depend on\nMy sacred vows and my commitments;\nBless me to understand this clearly\nAnd keep them at the cost of my life.\n\nBy constant practice in four sessions,\nThe way explained by holy Teachers,\nO Bless me to gain both the stages\nWhich are the essence of the Tantras.\n\nMay those who guide me on the good path\nAnd my companions all have long lives;\nBless me to pacify completely\nAll obstacles, outer and inner.\n\nMay I always find perfect Teachers\nAnd take delight in holy Dharma,\nAccomplish all grounds and paths swiftly,\nAnd gain the state of Vajradhara.\n\n<strong>Receiving Blessings</strong>\nFrom the hearts of all the holy beings, streams of light and nectar flow down, granting blessings and purifying.",
      "time": "0:18"
    },
    "guidedMeditation": [
      {
        "speaker": "Kadam Kyle",
        "time": "13:17",
        "text": "We can begin by remembering the benefits of being guided by love. For example, we have a mind of love, do not have inner problems of unpeaceful feelings. We do not have the causes of those inner problems — anger, attachment, jealousy, self-cherishing. Love makes us engage in pure actions, so the effects are pure results. Because our intention is pristine, it helps us avoid actions and decisions made out of delusion or unhappiness. And eventually our love will lead to universal compassion, which will lead to our enlightenment. Our love gives us everything.\n\nJust reflect on what these benefits of love would do for you and for others. And through deeply admiring these benefits, generate some wishing faith to grow your love. Thinking, I really want this mind of love.\n\nAnd on the basis of this wish to really grow our love, we can look at a situation in our life where we're trying to make a decision and perhaps we're a bit stuck. Investigate what would it be like to approach this decision from the pure virtuous mind of love, not from a delusion. Just see if we can really shift to this mind of love and then let it help us make a decision.\n\nAnd then in our own time, we can gradually arise from our practice."
      }
    ],
    "postMeditation": [
      {
        "speaker": "Kadam Kyle",
        "time": "13:17",
        "text": "I think the other microphone is the one that works. Yeah. The one but not with the little rubber thing on it. Oh, it's behind the computer, I think. Try that.\n\nOh, how fun. Okay. Oh, the camera only has my little head poking up over it. I'm sorry. Does anyone... Oh gosh, I left my Guide to the Bodhisattva's Way of Life in the basement. Anyone want to be the lucky reader? Going once."
      }
    ],
    "shantidevaReading": [
      {
        "speaker": "Kadam Kyle",
        "time": "13:17",
        "text": "So it's verse 15 to 25.\n\n(15) In brief, you should know\nThat bodhichitta has two types:\nThe mind that observes enlightenment and aspires,\nAnd the mind that observes enlightenment and engages.\n\n(16) Just as the distinction between wishing to go\nAnd actually going is understood,\nSo, respectively, the wise should understand\nThe difference between these two bodhichittas.\n\n(17) From the mind that aspires to enlightenment,\nGreat effects arise while in samsara;\nBut an uninterrupted flow of good fortune does not ensue\nAs it does from the engaging mind.\n\n(18) For whoever takes up the engaging mind of bodhichitta\nWith the intention never to turn back\nFrom completely liberating\nThe infinite living beings throughout all realms,\n\n(19) From that time forth, for him there will arise —\nEven if he is asleep or apparently unconcerned —\nVast and powerful merit, equal to space,\nThat flows without interruption.\n\n(20) For the sake of those with lesser inclinations,\nThese benefits were explained with logical reasons\nBy the Tathagata himself\nIn Sutra Requested by Subahu.\n\n(21) If even the thought to relieve\nThe headaches of others\nIs a beneficial intention\nThat results in infinite merit,\n\n(22) What can be said of the wish\nTo dispel the immeasurable misery\nOf each and every living being\nAnd lead them all to countless good qualities?\n\n(23) Does our father or mother\nHave such a beneficial intention as this?\nDo the gods or the sages?\nDoes even Brahma himself?\n\n(24) If, before generating bodhichitta, these living beings\nDo not even dream of such a mind\nFor their own sakes,\nHow will they develop it for the sake of others?\n\n(25) This mind to benefit living beings,\nWhich does not arise in others even for their own sakes,\nIs an extraordinary jewel of a mind,\nWhose birth is an unprecedented wonder."
      }
    ],
    "postReading": [
      {
        "speaker": "Kadam Kyle",
        "time": "32:34",
        "text": "So we weren't together last week due to the snow bonanza. Hopefully everyone got out okay. And one or two pieces from that. Yeah, thanks so much for making it.\n\nSo we were looking at two weeks ago being guided by love. Cultivating love and helping it guide us in our decision making instead of getting stuck in overthinking or delusion or just not pausing and shifting the mindset. So yeah, that was kind of the main point from two weeks ago. Be guided by love.\n\nOkay, so does anyone have anything to share from the last couple of weeks? Any practice data? It could be specifically about that. It could be other random tidbits or things that you're thinking about or insights you had or whatever. Everything is open for business."
      }
    ],
    "practiceReports": [
      {
        "speaker": "Anne",
        "time": "33:57",
        "text": "I love this practice so much. It is the most useful thing ever. And I didn't intentionally set out to use it on a tendency I have to overschedule myself. I wasn't even thinking about that. But there were a number of issues that came up the last two weeks where I couldn't decide if I should spend my time doing this or not.\n\nAnd then it was so cool because over and over again what I would do is just think about all the living beings and how they were all very important and their happiness was important and their freedom from suffering was important. And I would just completely put aside the issue and the options. And I would just meditate on how important all these living beings were. And the answer would come up from behind. Kind of like a thought does when you're taking a shower. And I'd be like, oh, that's what I need to do.\n\nOften for me it was like I'd been thinking I need to spend three hours on this project or drop it. And the answer was often well, why don't you do it in this way that would take 20 minutes. Which I would never have thought of. I don't know why because my brain is dumb.\n\nBecause those are the options that my brain presents to me over and over again. And it seems like those are the only choices. But there's always some much smaller way I can accomplish the same thing with much less effort that I cannot figure out on my own.\n\nAnd I think that's a good part of why I feel overscheduled a lot or that I have too much to do because my brain operates that way. My mind of love is just like, no, Anne, you don't need to spend three hours on this thing. You could spend two and a half of those hours in some much more beneficial way. We don't know what that is yet but it would be dumb to spend three hours on this. It's not going to benefit others. You don't know why but I do.\n\nAnd then the other thing is these little things that I'm like it's got to go this way or I'm going to die. When I generate mind of love I'm like, oh, this just doesn't matter. And I just want to say the most helpful thing to do aside from just generating the mind of love is to really remember that we're so deeply connected that every little action I take ripples out and touches everyone immediately. And that the well-being of everyone else, my well-being depends on that completely. And just remembering those things has helped me avoid taking some kind of really ugly actions this week that I was on the brink of doing. It's really saving my behind.\n\nAnd I'm really, I feel unusually grateful to have this kind of new tool to be using. And it's a little awkward right now but I have a feeling that I'll get better at using it and it won't take quite so much time as it does now."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "37:15",
        "text": "Yeah, thanks so much, Anne. That's fantastic. Yeah, I think there's nothing else to say. I think this sounds fantastic. Yeah. Others, please. Anything from the field? Sumit, yes, thanks."
      },
      {
        "speaker": "Sumit",
        "time": "37:39",
        "text": "I just wanted to share a little bit about, everyone of course knows about Joshua and his passing. And one of the things, I guess a lot came up. I'll just share one of them.\n\nOne of the things that was coming up for me a lot was just sort of like, oh man, this feeling like it wasn't enough. Like he was giving his 110% and it wasn't enough. And I was really stuck in that mindset for a while. And even if intellectually I didn't feel it in my heart, it was really there.\n\nAnd I went to his memorial service today and there was a lot of love in the air. And in particular, his ex-wife was sharing about Joshua and in particular she was sharing a lot about this Buddhist stuff that he did. And like his happiest day was a day he was at the Greenwood Cemetery during the walk. That was like his happiest day and like how touched he was when everyone sang him happy birthday. His birthday actually is generally a very traumatic day for him. And was just such a turnaround. His last birthday, right? So beautiful.\n\nAnd just, it just really moved my heart. This person who had a lot of trauma, a lot of suffering, he was just changed so much by the Dharma. He was changed so much by the Dharma. It's so powerful. And it really moved my heart.\n\nAnd I, this can sound a little trite, but I wanted to kind of share like, that's kind of what I was saying at the beginning. Like, I've been walking around being like, it wasn't enough, it wasn't enough, it wasn't enough. That's what's been in my heart. And so for someone like that to show up, it was a big change. And it is enough. If we have to remember passing future lives, and it was massive. And I believe his next life is going to be in the Dharma. I believe that. And so, it really can be enough."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "40:14",
        "text": "Yeah. Thank you so much. I mean, it's a very meaningful reflection. And yeah, I think we've all been sort of touched by Joshua's passing in different ways. And yeah, it's very helpful. Like what you shared, I think it was that his ex-wife shared that point in the memorial service about how Buddhism was so impactful for him. And she sort of knew him the best, like everyone. And it was just the last year or so that he was really connected to us here. And so it's amazing, right, that like that year was so impactful that she was really bringing it up in the memorial service. And maybe even some of his other friends and stuff weren't as aware of that impact yet. So yeah, it's very touching.\n\nAnd it's the word that keeps coming up for me is this word important. And it's interesting because Anne in her share did use this word. And it's actually one of Geshe-la's words, right? And when we meditate on equalizing self and others, we think towards others, you are important. Your happiness and freedom are important. And this word is like, it's almost like a technical word. Even it's not just like a vague word because it's trying to get this sense of weight.\n\nAnd there's something about the mind that can, especially as we practice Buddhism, that can be a bit solipsistic, where the weight of others' value can actually go down if we're not careful in the way that we practice. It doesn't need to be like that, but it can be like that. We're like their weight can go down. And when we meditate on equalizing self and others and exchanging self with others, we try to actually increase the weight, the value of others and really feel like they're important. Their happiness is important.\n\nAnd so for me, when I think about towards others, you are important. Your happiness and freedom are important. Then I also think what we're doing here is important then. And like this sense of weight not in a heavy negative sense, but in a sense of like it's impactful. It's not just a trite, fun thing we're up to. It's not just a pleasant, delightful thing that we found. It's actually really important. And there are effects of what we do. And they really influence people's lives.\n\nI found that very, very helpful. So I was just doing publicity in between the classes. And I was just thinking, what we do is important. Just like as a mantra. It was just very helpful. When I meditate, it's really important. When I love others, it's really important. And just keep connecting to that sense of weight.\n\nAnyway, thanks so much, Sumit, for sharing. And I'm really glad that you and Adriana could go to the memorial service to represent KMC Brooklyn. Oh, and Esmeralda and James are there. Yeah, and Jimmy too. Okay. Yeah, so we had four people there to support.\n\nAnd then we'll have Powa Sunday. And it will be at 2 instead of 2:30. So we can have time for people to chill and hang out a little bit and chat before TTP."
      },
      {
        "speaker": "Mimi",
        "time": "46:17",
        "text": "So my data is this week I've been really thinking about what these past two weeks, actually, about your encouragement and thinking about what brought us to the Dharma. So like really kind of exploring and investigating that to see if there's any type of contamination.\n\nAnd so it's been a long time. And so I came to the Dharma and I was thinking about what brought me to the Kadampa Center to Geshe-la. Like what was the draw? And I'm not going to get into a lot of detail. I'll talk to you about it personally. But because I don't want to get over psychoanalytical.\n\nBut what came up for me was like my practice has always been devotional. So to me, it's all about the guru. And so it's like, why? Like, you know, I just absolutely love Geshe-la. I always have. And I was like never — I mean, Dharma and Buddhism to me has been Kadampa Buddhism and Geshe-la. And I just want to make sure that that devotion, my guru yoga is very pure and it's not coming from something missing. Or like, oh, this is my faithful companion. My companion that will never abandon me. So it's like, hmm.\n\nSo that's — I'm just kind of mulling over and kind of praying about it. And maybe what's going to happen is just going to even deepen my faith and admiration in Geshe-la."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "48:35",
        "text": "Yeah. Thanks, Mimi. Thanks for reminding us about that too. It's that idea of investigating what are our potentially contaminated motives that get us interested in the Dharma and trying to unravel them so that on our quest to become a Buddha, it's not just a manifestation of our original contaminated motives. It's like, yeah, which very well can be.\n\nIt's like you can start with that little seed, that contaminated motive, and that DNA can actually follow all the practice. So it's very helpful to kind of identify and start to shift it and understand. And, yeah, what you're talking about is the difference between attachment and faith, especially in the guru. And that's a very rich area of inquiry. And it's not clear at first, really, what the difference is. And we should all see why that's not clear.\n\nIf we can't see why it's really not that clear, then we don't understand the question. So that's the first step. Why is it so hard — precisely, technically — to understand the difference between attachment and faith in a guru? And then when we come up with an answer, it is very complicated or hard to understand because of such and such, then we can get an answer to that and then make a shift. Yeah, so it was a very healthy and important thing to ponder."
      },
      {
        "speaker": "Dale",
        "time": "50:16",
        "text": "So I'm finding it important to always remember the first line of the six-line practice. I go for refuge to the guru and the three precious jewels, especially when invariably three o'clock in the morning comes and the three o'clock in the morning mind sucks. It basically sucks.\n\nI mean, I am so good at finding the worst possible outcome to everything. It's ridiculous. So the minute that starts up, I go to the guru and I make a huge effort to calm that delusion. Because I don't want to bring that person into the world. I want a Dharma person. I want a love person. I want to be able to hear other people's talk and issues and to be able to be pure and clean for them as much as possible, not bringing my stuff.\n\nSo for me, the Dharma has really changed me in that way and I'm very grateful."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "51:46",
        "text": "Thank you so much, Dale. It's a great reflection and yeah, it shows the power of a mantra that becomes a bit repetitive for us that we use a lot because it becomes an impulse, a reflex. Yeah, it's probably the better word.\n\nIt's like a reflex. So then the 3 a.m. mind comes up and we have a reflex — like when they tap your knee at the doctor, you have this almost unconscious response. I go for refuge to the guru and three precious jewels, then you go there.\n\nIt's a very nice skill and the more we train our mind, that will happen more and more with more and more different things. And your point about not following it, not wanting to bring that person into the world — this is where the word Mara is helpful. Mara, demon. It's helpful because it's anthropomorphizing a mind, and it's making it clear it's not us. That 3 a.m. mind that goes to the worst possible things — it's so helpful to think that's not me, to just go, that's a Mara, that's a demon. I would never follow a demon. I don't want to hang out with a demon.\n\nAnd once we kind of anthropomorphize it or make it so clearly not us, then it's much easier not to follow. If we think that's me, 3 a.m. mind is me, then it's complicated, and then we end up bringing it into the world."
      },
      {
        "speaker": "Fran",
        "time": "53:35",
        "text": "I found the practice of making decisions or trying to make decisions from a place of love very helpful, particularly when it came to restraint. There's something happening and I want to respond, and I did the practice of, what are the two options? And if neither of them was from a place of love, I tried to come up with something, a way that was from a place of love, and if I couldn't think of anything, then I did nothing. And that was really the best thing to do at that point. There was nothing if I couldn't come up from a place of love.\n\nThen during the two weeks, I started to look at it very similar to Mimi, started to look at my motivations for the virtuous things that I was doing. And I found that very challenging because I was really noticing how a lot of things that I do that I think of as helping other people is not really from a place of love. There's this voice in there going, oh, I wish somebody else would do this, but nobody else is going to do it, so I'm going to do it. And that's not a place of love.\n\nAnd with my tendency to be very hard on myself and to not want to do things if they aren't perfect, I was just like, why can't I just do something nice without having to pick it apart? So I took a little step back and said, stop looking at every little thing. Just do what you're doing, do what you feel is right in the moment, and do the virtuous things. And then I started to go back to it with thinking, what would that action look like with a mind of love? And the action itself was the same. It was just how I was viewing it. So that's what I need to work on — keep doing the virtuous things, don't step back because my motivation isn't 100% pure, just purify the motivation."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "56:16",
        "text": "Yeah, that makes sense, Fran. We have to know ourselves, we have to know how we operate, and where we have little areas where we trip up a bit. Sometimes being overly introspective can be a bit agitating for certain people. For other people, they're so under-introspective that it's just good, always. But for others, they're so inwardly oriented that it just feels like a tight spotlight, and very agitating and cramped doing that. It can make us hard on ourselves or self-critical.\n\nWe have to know ourselves when we're doing any of these practices, and it sounds like you, through your self-knowledge, understood, I've got to shift my way of doing this one, and that's great."
      }
    ],
    "mainTeaching": [
      {
        "speaker": "Kadam Kyle",
        "time": "57:18",
        "text": "I think we're on developing great compassion. Anyone have a veto on that one? Oh, sorry, that was my mistake. Developing affectionate love.\n\nThe next stage in the development of bodhichitta is to look upon all beings with affectionate love. The state of mind will arise naturally as a result of meditating for a long time in the three previous stages. In general, whenever we see our child, husband, wife, or parents, a heartwarming feeling of affection naturally arises within us, and we hold them dear. But such affection does not arise when we see other sentient beings, especially those who disturb us. For to develop true bodhichitta, this warm feeling must be extended to embrace everyone.\n\nWow, that's a tall order. So we can ask ourselves where we're at on that spectrum. Warm feeling embracing everyone. We're at zero out of 100 right now, maybe, on the spectrum. That's fine. We've just got to know where we're at, though.\n\nIf as a result of long and continual meditation, our mind becomes accustomed to looking upon each being with affection and warmth, we have realized this fourth stage in the development of the mind of enlightenment.\n\nOkay, so warm, close, friendly. Those are the three words that Geshe-la uses about affection and love. Warm, close, friendly. They all have a slightly different connotation. Warmth is more like a description of the quality of the mind. Close is like an intimate feeling, or a tender feeling, closeness. Also comfortable — when you're with someone you just feel totally at ease with. Close, like you can just be yourself, put your guard down. Friendly is just like congenial, delighted to see them, happy to see them.\n\nSo it's nice just to use this little checklist. Warm, close, friendly. Towards people — what's it like to be warm towards this person, what's it like to be close to them, what's it like to be friendly with them? Like if someone comes to the center who's new, what's it like to really feel close to them, even though you just met? To feel a little bit intimate with them, or tender towards them. What's it like to have that kind of tenderness?"
      },
      {
        "speaker": "Kadam Kyle",
        "time": "57:18",
        "text": "[Jose asks: It's not 100% clear to me what's the difference between this and equanimity, because affection and love is one step closer to bodhichitta, so a little bit better, but it feels like when we were looking at equanimity, the final goal is kind of very similar to this. Can you clarify?]\n\nSo affectionate love is like a genre of a type of mind, but within that genre it has a lot of permutations and versions. Equanimity — yeah, it's warm, close, friendly, towards everyone equally, but the initial realization of it that we're trying to work on is basically the lowest hanging version, where we've overcome our anger and attachment and ignorance towards people. So it's like moment one, when we've moved from feeling angry towards people, attached towards people, or not caring about them at all, and we have a warm, close feeling instead — we could call that equanimity. So it's really like the first little step into these minds.\n\nThen on the grounds of that, we think about how all living beings are mother. So that takes that affectionate love to a higher degree, right? Because it's not just the most basic level of warm, close, friendly, which is basically letting go of the delusions towards people and not caring about them. It's now upgraded a bit further. Oh, they're my affectionate mother.\n\nAnd then it's about wanting to think about their kindness. Oh, they're so kind. Now I'm feeling kind of grateful too, and I'm not just feeling delighted about them being my mother, and I've known them for eons, and I'm thinking about all they've done for me, and I want to repay that. And now the affectionate love has increased even further.\n\nAnd so to me, this stage is kind of pointing to: on the basis of getting rid of our delusions towards them, and on the basis of thinking they're our mother, and their kindness, and wanting to repay their kindness — now I'm developing the crystallized maximum version of affection and love, a full-hearted closeness and affection, which is like an output of these previous meditations. So there's like an affectionate love continuum here that's growing each stage. I think from a practical point of view, the reason I like this stage being drawn out from the rest is you could think of the previous four stages as causes, and then this stage is kind of like an effect.\n\nSo there is love on all of them, but I like this one being broken out because it's saying: when you're working on those, you're kind of working on causes to affection and love. At this stage, you're just really trying to hold and maintain the effect of it."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "57:18",
        "text": "Okay, so developing great compassion. Great compassion is the state of mind that wishes each and every being to be free from all suffering. So sometimes people say, oh, I want them to be out of their misery. Even wishing someone to pass or to die so they're out of their misery — but we know that because there's future lives, you're not necessarily out of your misery. You might just be going into more misery.\n\nSo the Buddhist view when we're developing compassion is always encompassing future lives. It has to be thinking, I want you to be free of samsara and its causes. So I want you to have freedom from suffering in all your future lives, and the only way to do that is to be free of samsara ultimately.\n\nIf we've already developed affectionate love, and have extended it toward all living beings, then when we meditate deeply on the suffering that others are now experiencing, a feeling of great compassion will arise easily. So if you notice that when you develop compassion it doesn't arise easily, then you can work backwards. Okay, that means my affectionate love is missing. And then if you try to meditate on affectionate love and it's not jiving, then you move backwards. Okay, how's my thinking about wanting to repay the kindness? Et cetera.\n\nSo we can always diagnose the issue by doing this. One step back, one step back. It's very important, though, every time we're trying to develop compassion to just make sure there is some love there first. There's no love, it can't be developed. So there's no point skipping ahead or rushing it. You want to get the love going and then it's simply on the basis of that, we think about the suffering of others, and the great compassion arises naturally. It's like a dependent relationship. I don't know what the analogy is, but it's something like yogurt develops on the basis of milk. No milk, no yogurt, right? I'm not talking about the fake yogurts out there.\n\nSo basically, most of our compassion issues are love issues. There's one other type of issue that we might have, which is a renunciation issue. It's either a love issue or a renunciation issue. It's never actually a compassion issue."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "57:18",
        "text": "The mind of great compassion embraces all sentient beings without exception. At present, we're unable to bear our own suffering because we cherish ourselves so deeply. In addition, we cannot bear to see the suffering of our parents, family, and friends because we cherish them as well. However, when we see our enemies in pain, we take delight in the knowledge that they are suffering. Why? Because we do not cherish them at all.\n\nDoes anyone here think that they're above that? No. We're all mature enough to acknowledge that we are not above that. I don't want anyone wriggling out of this one. We all own it. Anytime you see bad news befalling someone and you go, hey, ha ha ha — that is not love. That's malice. It's delighting in the suffering of others. It's wishing others to suffer.\n\nAnytime we delight in their suffering and their pain and bad news befalling someone, even if we think, but they're really bad — that's not love. That's not a Buddhist way of thinking. We have to be very careful. There's a lot of this kind of thinking in the world. There's a lot of this thinking in the news and how people interact. It is the opposite of Buddhist thinking.\n\nIf we interact with it a lot, if we read a lot of things and we let that kind of way of thinking influence us, we are undermining our bodhichitta and we are undermining our whole Buddhist path. We need to be really wary of this kind of thinking and any influence that's supporting us thinking this way. I would have a wisdom fear around any influence that supports this way of thinking — like going where people are celebrating the downfall of other people or wishing them harm.\n\nI would be extremely wary of exposing my mind to anyone who talks like this or thinks like this. It's very odd because it's on all sides of the aisle these days. It doesn't matter where you land on any kind of news, political spectrum, whatever. It's everywhere, this kind of malice. It's very degenerate thinking."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:16:25",
        "text": "[Sumit comments on his tendency toward scorn when watching the news.]\n\nIf what we're consuming is supporting us thinking like that, we either need to not engage with it, or totally change our way of looking at it. And actually have compassion for anyone who's thinking that way. So let's say you're watching some pundit or whatever who's supporting that way of thinking — you can either not engage, or you can develop compassion for them, for thinking that way. Because that's a horrible way to think. Delighting in the downfall of others — it's an awful way to think, and it's everywhere. We can have a real compassion for that individual and think, may you be free of that way of thinking. But we don't want to be influenced by that, that's for sure.\n\n[Sumit asks: Is what you're saying — I just hear the news, and I develop anger and hatred towards people. Is that included? I do try to purify it, treat it in a Buddhist way, but I often don't.]\n\nYeah, so if our way of engaging with the news stimulates some kind of anger and hatred, what do we do with that? We might still feel like, okay, I want to be informed, I want to know what's going on. Maybe there's a way to do that without having it stimulate delusions in us. Or maybe there's a way that we can change our mind about how we look at it, where we can still be informed but not in a way that is stimulating anger and hatred. Because otherwise it's just like gasoline on the fire. And if there's no fire, then the gasoline is not the problem. But if there's a fire, the gasoline is really a big problem. The fire is our own anger. And if what we're engaging with is just pouring gasoline on that, then that's a big problem for us, and we need to have rules around it. It's hard enough to deal with them. But if we can get to a place where the fire goes out a bit, and we get to the root of it, then that gasoline has nowhere to land and doesn't rile us up in the same way. Sometimes what's nice to do is to have a breather, and then try to understand what's really going on in the mind. But it's almost impossible to know what's going on while we keep dumping the gasoline on the fire."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:20:35",
        "text": "[Sumit asks: The converse would be attachment, right? And Geshe-la was very explicit about not throwing away the relationship. Is the spiritual advice — with anger — to actually throw that away until you can handle it?]\n\nThe advice about working with minds like attachment isn't to just stay always. Sometimes it's to leave. Definitely. Especially with things — people can be a little more complicated because we might have a moral commitment to someone, like our kids. But things, the advice definitely is, if something is stimulating really disturbing attachment in our mind, the advice is not to stay with that thing. The advice is to create some space, remove the object for a bit, so that we can work on the inappropriate attention and get to a stronger place of contentment.\n\nSo there's three causes of delusion. There's the seed — that's the karmic seed. Object — that's the thing we're deluded towards. And inappropriate attention. Ultimately, we need to remove the karmic seeds. Until that's done, we need to work on the inappropriate attention, how we think about something. But if the way we're using our mind is just instantly stimulating inappropriate attention, a delusion, we can temporarily remove the object. And what that does is it gives us space to gather our strength and get stronger and wiser and more loving and happier, so that we can engage with that object from a place of that same strength.\n\nSo with anger, with attachment, with any delusion, we definitely need to use this tool. It's called guarding the doors of the senses. And later in the book, Meaningful to Behold, Geshe-la says it's a supreme way to practice moral discipline. Either remove the object or change the inappropriate attention. If we can be in battle with something and we're getting a little ruffled up, but we're seeing progress on changing the inappropriate attention, great, we don't need to remove the object. But if it's not really moving in an obvious direction, sometimes it's the right choice — remove the object.\n\nAnd it's not a moral failing, it's not a weakness. Sometimes because we hear these amazing stories about lojong practitioners who have leprosy — just one of those painful, horrifying illnesses — and they're blissed out. When we read those stories, we're like, yeah, that's basically me, I could do that, I can stay in the battle and change my mind. But these people are amazing. And we're amazing too, in our own ways. But we might have a ways to go. And so sometimes what we need to do is to actually cut the object for the short period of time. Not forever."
      },
      {
        "speaker": "Adriana",
        "time": "1:25:33",
        "text": "I was listening to a podcast from Kadam Morten recently about compassion. And he talked about how watching the news can be a really effective meditation on compassion, if we think about how we're all just swapping places. So whatever we see, it's an imprint that we have in our own karma. And so we never, ever judge other people, because that either was us or will be us. And I thought it was very effective to combine compassion and karma to make it feel really urgent and kind of scary."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:26:16",
        "text": "Yeah, thanks, Adriana. I love that. That's a beautiful reflection to always remember. It's like the fish story. Geshe-la gives this in Dangers of Lower Rebirths, and in Modern Buddhism and elsewhere.\n\nThe Yamdrakso Lake is visited by some yogi. And the yogi said, the people in this village are constantly switching places with the fish. It's a fishing village. And they just got stuck in this bizarre karmic loop of being the fisher and the fish. On the fish, I die, I become a fisher. I catch the fish, I kill them.\n\nIt's a great thing to think about. The people I'm really mad at and hate or delight in their suffering and misfortune — that was probably me not so long ago. It's a very helpful way to look at things. And it gets me out of my scorn mode. Because I don't like being in my scorn mode.\n\nOkay, so let's take a break. Next session we're going to talk about our own renunciation a bit. Because this is the other area that's going to trigger the great compassion.\n\nOkay, so then — yeah, we announced Poha next week, two to three, for Joshua; the silent retreat on the 7th, 11 to 5. And then we do have our world famous love panel on the 15th. Two Sundays from now. So come one, come all for that. And then Dorje Shugden Empowerment, 7th and 8th, here. So mark your calendar. Tell everyone you're busy that day, right now. If you need me to tell someone off who's trying to get you to do something else that day, I'll do that. I'll call them personally and say, you leave them alone. They've got something to do on the 7th and 8th.\n\nOkay, let's dedicate here. We can think through the virtues we've collected through practicing, meditating, discussing. May all living beings find lasting peace of mind, enlightenment. We can make any personal prayers. Okay, thank you.\n\nAll right, so we'll come back at 6:10."
      }
    ]
  },
  "session2": {
    "chantedPrayers": {
      "note": "Session 2 prayers were not captured in the transcript.",
      "time": "not captured"
    },
    "teaching": [
      {
        "speaker": "Kadam Kyle",
        "time": "2:09:05",
        "text": "[Reading from Meaningful to Behold:] An ordinary mind is trapped between over-excitement and despondency, oscillating between the two. But a mind of renunciation is constantly balanced and positive.\n\nSo we all know what that's like, to be trapped between the over-excitement and despondency, unbalanced minds. Just read a little bit from here and then we'll get into it.\n\nWe do this by familiarizing ourselves with the first four stages until we spontaneously look upon all beings as we do our kind mother. Then, by remembering their suffering and dissatisfaction, we will easily develop great compassion. The measure of this development is that when confronted by a former enemy, the spontaneous wish arises that they be free from all misery. As has been said, until we've developed affection and love for all others, we will be unable to develop this great compassion for them.\n\nThe two traditions regarding the development of affection and love, that of Indian masters such as Chandragomin and Chandrakirti, state that affection and love is the result of deepening the realization of the first three stages as explained above. According to the tradition of Shantideva, this heartwarming affection is developed mainly through the method of exchanging self with others, as will be explained later.\n\nThe only thing I'll say about this, because we've already looked at this in a lot of different ways already — when we read the text, sometimes we're just focusing on content, but because we're teachers, we do also want to think about the presentation of the text and the different skills in the presentation. Because it's presented very purposefully and strategically. The order, the flow, what points first, what points second, what points third. There are all these little gems in the presentation that we should always take note of.\n\nAnd so when I see, for maybe the third time so far, this allusion to the practice of exchanging self with others, explained later in the text, I start to go, huh, why does Geshe-la keep making this point? It's not like the first time. He's driving our mind to the eighth chapter. So we should think about that. What's the skill there? What's trying to be done by doing that?"
      },
      {
        "speaker": "Kadam Kyle",
        "time": "2:09:05",
        "text": "As already mentioned, if we develop affectionate heartwarming love for all beings, and then focus in meditation on their suffering, we can develop the mind of great compassion, wishing them to be released from their misery. If we focus instead on their lack of pure happiness — how they are deprived of true pleasures and joys — then our affectionate love develops into what is known as wishing love. This is the heartfelt wish that no sentient being is ever separated from happiness and its causes.\n\nOkay, so elsewhere Geshe-la explains that if we can't develop renunciation, it's almost impossible to develop great compassion. Because how can you wish others to be free of suffering if you're not wishing that for yourself?\n\nAnd so we're invited into improving our own renunciation, and through doing that, we'll develop the correct object of great compassion. We won't be wishing people just to be free of temporary suffering. We'll be wishing people to attain permanent freedom from suffering. Basically, we won't just be wishing a samsaric improvement for people. We'll be wishing for them to realize emptiness, which is the highest form of great compassion. Because the answer is embedded in the wish — I want you to be free of suffering, through realizing emptiness. It's the most profound type of compassion we can develop."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "2:09:05",
        "text": "So we can all ask ourselves, how is our renunciation going? Do we think of it as a constantly positive and joyful mind? The synonym non-attachment is useful. That's the mental factor.\n\nNon-attachment isn't the absence of attachment. Because a baby has an absence of attachment for alcohol, for example. That doesn't mean they have non-attachment. There's just no attachment. Because they don't know about it. So non-attachment is a mental factor that actively opposes attachment and craving. A virtuous mental factor.\n\nSo because renunciation does this, it brings us incredible joy. Because there's no feelings like I need to be different than what I am. I need to have this. I wish things were like this. There's none of those thoughts. And if we were just us, minus all those thoughts, we'd basically already be incredibly happy. Just take us, subtract all the discontented thoughts in our life.\n\nAs Geshe-la says in How to Transform Your Life, if we just didn't have delusions, there'd be nothing to stop our peaceful and happy mind. So non-attachment is an incredibly happy and peaceful mind. And renunciation is non-attachment. So we can just ask, is that our experience of it? Do we really know what that feels like? Do we know about the peace and bliss of renunciation and non-attachment? Or is that something that is a little bit obtuse for us right now?"
      },
      {
        "speaker": "Kadam Kyle",
        "time": "2:09:05",
        "text": "The section Joyful Path of Good Fortune is the most extensive explanation of how to develop renunciation. Anyone want to guess how many pages is just on renunciation in Joyful Path? 40? 60? So page 321 to page 453. 132 pages on renunciation. So there's a bit to learn.\n\nWe chose Meaningful to Behold because renunciation pervades the whole book and it constantly comes up in lots of ways. There's a point where Shantideva can't stop talking about death and lower rebirth. Like every single page. When I first started teaching it in Providence, Rhode Island, people were a bit riled up by Shantideva being so hardcore. And I was like, it's okay, he doesn't really mean it. But then the next page — if you get angry for one moment, you'll be dragged down by the demons of the Lord of Death into hell. And I'm like, yeah, it's all right. Don't worry. Next page, you're all going to die and all your family's going to die. So it does ramp up quite a bit. And Shantideva is the example of a renunciate. An incredible, beautiful example."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "2:09:05",
        "text": "I wanted to focus on one specific area — the general sufferings. Why are we in samsara? We're in samsara because we have no wish to leave samsara. Why do we have no wish to leave samsara? Because we're attached to the people, places and things of samsara. Why do we suffer? Because we're in samsara. Why are we in samsara? Because we've made no effort to escape samsara. Why do we make no effort? Because we have no wish. Why do we have no wish? Because we're attached to the people, places and things of samsara.\n\nBecause the mind of attachment is so fundamental, really kind of like a DNA level — a lot of attachment in us. We call it an innate delusion, which is a delusion we bring with us from life to life. Because it's so ingrained at a fundamental level, we have to think about the different types of suffering extensively. And we have to get to a place where we love thinking about that.\n\nWhich is not a natural conclusion at first. Because you're going, I don't love thinking about that. So we want to get to a place — and this is a huge moment in our spiritual life — where we feel, I love thinking about the sufferings of samsara. Why? Because of the output of that. By thinking about the sufferings of samsara, I stop being attached to the people, places and things of samsara. Therefore, I want to leave samsara. Therefore, I put effort into leaving samsara. Therefore, I do leave samsara. Therefore, I end suffering forever.\n\nIf we trace it back, they're like a bunch of dominoes. My permanent freedom from suffering is inextricably linked with thinking about the sufferings of samsara. Then we'll start to love thinking about the sufferings of samsara. Because we love the idea of permanent freedom."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "2:09:05",
        "text": "So there's different types. There's three types: manifest suffering, changing suffering, pervasive suffering. Then there's the human sufferings: birth, sickness, aging and death. Encountering what we don't like, being separate from what we do like. Failing to satisfy our desires. And then there's the general sufferings — the ones I want to touch on now.\n\nUncertainty, having no satisfaction, having to leave our body over and over again, having to take rebirth over and over again, having to lose status over and over again, having no companionship. They are general sufferings because they pervade every single realm. It doesn't matter if you go to the highest or the lowest. These are our guarantees.\n\nLet's look at uncertainty. In samsara, no condition is certain. Experiences and relationships quickly change. High rebirth soon turns into low rebirth. Friends turn into enemies, and enemies turn into friends."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "2:09:05",
        "text": "[Reading from Meaningful to Behold:] The seventh Dalai Lama said, High status soon turns into servitude. Beauty quickly changes, like a flower in autumn. Wealth is soon lost, as if merely lent. Life quickly perishes, like lightning in the sky.\n\nWe may think that high status brings security, but if we check, we will see that high status is extremely unstable. Those in high positions have greater responsibilities, bringing with them more anxieties and experiences of mental pain, due to criticism by others, and even threats to their life. In a democracy, politicians easily lose their popularity and good reputation.\n\nOur beauty is fragile. Even when we're young, our physical appearance varies greatly, depending on our state of mind. In the morning, we may get out of bed feeling wonderful and looking radiant. Within just one hour, things may start to go wrong, and we begin to look downcast. Our face soon becomes dull and lifeless, and our body loses its vitality. Our beauty is as changeable as our mind.\n\nThere are gigantic industries right now, trying to help people stay beautiful forever. It's impossible. I mean, we're not our body anyway. Why do we need to be beautiful? It's just like a lump of flesh that we've possessed. Our very subtle mind is like a ghost. It's just possessed this lump of flesh, and animated it for 80 years, and then it's just going to leave it behind. So why are we so obsessed with this lump of flesh that we've animated?"
      },
      {
        "speaker": "Kadam Kyle",
        "time": "2:09:05",
        "text": "Friendships are unstable. When we first make friends, it feels as if we're going to be friends forever. BFFs, as they say. But our feelings change, and sometimes our good feelings turn into bitter hostility. It can even happen with our Sangha friends, which is completely tragic. But karma changes — just enemies.\n\nIt takes only a few words to destroy trust and open communication between friends. The smallest event or the slightest thought can transform our feelings of friendliness into feelings of jealousy or resentment. For those whose minds are still bound by delusions, friendships are unreliable and uncertain. In Guide to the Bodhisattva's Way of Life, Shantideva says, One moment they're friends, the next moment they become enemies. Even while they're enjoying themselves, they become angry. How unreliable worldly beings are."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "2:09:05",
        "text": "[The Shariputra fish story from Meaningful to Behold:]\n\nThere was once a couple who lived in a house together with their son and his wife. Behind the house was a small lake. The father was very fond of fishing every day. He would catch fish and bring them home for the family to eat. One day a stranger fell in love with the son's wife and committed adultery with her. When the son found out, he killed him. Since the murdered man was so attached to the wife, he was reborn as their child.\n\nShortly afterwards, the old mother died, and since she was so attached to the house and the family, she was reborn as their pet dog. Later the old father died, and since he was so fond of fishing, he took rebirth as one of the fish in the lake. The son then went fishing and caught the fish. He took it home, and his wife fried it. The dog smelled the fish and came to get the bones.\n\nAs the son ate the fish that was his father, he cradled the child, who was his enemy, and kicked away the dog that was his mother. With his clairvoyance, Shariputra beheld the scene and declared, \"Some sorrow makes me laugh!\"\n\nThe thing is, when you have clairvoyance like that, that's what everything looks like. It's really freaky and messed up. All the romance goes away very quickly. All the pretension. Because you just see this everywhere. These networks of suffering and pain. So when people are really binary about their enemies and their team and that team — from this point of view, it doesn't make total sense."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "2:09:05",
        "text": "So how can we make this practical and useful for us to work on? Whenever we're meditating on renunciation, there's a little checklist we can do. It works with developing any virtuous mind or opposing any non-virtuous mind.\n\nThree questions: Do I really want to overcome my attachment? Do I think I can? And do I have a mental image of what that looks like and feels like?\n\nIf we can't answer these somewhat affirmatively, then reading about the sufferings of samsara doesn't land, it just feels abstract, or it might feel depressing or offensive. From one point of view, we have what's called the Stockholm Syndrome. We're defensive of our prison. And so when we first start thinking about the sufferings of samsara, because we've invested ourselves in samsara, it feels upsetting. It's basically our attachment making us unhappy.\n\nSo first: Do I really want to let go of my attachment? Do we have a powerful wish? If no, we can think about all the suffering and pain that it causes. Find a variety of problem that is personal to us.\n\nSecond: Do I believe I can? Not just intellectually, but a real heartfelt answer. Do I really believe I can stop looking for happiness outside myself forever?\n\nThird: Do I have a mental image of what non-attachment would look like? Can I really see in my mind's eye what it would look like? Do I love that vision?\n\nOnce you can get to yes, yes, yes, then we start to think, I can't wait to think about the sufferings of samsara again."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "2:09:05",
        "text": "So it's helpful to just take one of these at first, like uncertainty. All we're doing is noticing uncertainty in general, and then the pain that it causes.\n\nIt could be the pain of worry. What's going to happen? I don't know. What's going to happen in the news? What's going to happen in the country? What's going to happen in my body? What's going to happen with my friend? I don't know, I don't know, I don't know. And we can think about the pain of that worry and just keep noticing it. Ah, that's the suffering of uncertainty.\n\nWe also want to preemptively label everything as uncertain. There's a great mantra: this is going to change. This will change. And I really love that mantra. Everything. It could be the most delightful experience. It could be the worst experience. It could be some boring experience. And we just keep trying to label everything. This will change. This will change.\n\nYou could use the phrase, this is uncertain. That does the same thing. It has a slightly different feeling or emotion to it. But it's getting at the same idea. Because all changing things are uncertain.\n\nSo we want to start noticing it over and over and over again. And this is kind of hard, because our mind grasps at permanence very powerfully. It grasps that it's always going to be this way. To oppose that takes a vigilance throughout the day. This is uncertain. This is uncertain.\n\nWhat does it feel like to say the existence of KMC Brooklyn is uncertain? Does that bother us? The thing is, it's just true. Everything is uncertain."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "2:09:05",
        "text": "One thing that happens when we start to ponder in this way is that we feel a lot lighter, actually, in the long run. Because we stop expecting certainty. And expecting certainty is incredibly misery-inducing. It never works out. So we just stop doing that, and we feel lighter.\n\nBut then we do get quite interested in the long game. How am I going to navigate uncertainty? When we really attune to uncertainty, we start asking, what are the skills and abilities and traits that I should invest in so I can navigate uncertainty?\n\nSome people will conclude, that means I need money, that means I need a security system, that means I need a bunker, that means I need longevity experimental drugs. But ultimately, it's really a peaceful mind, and virtues that help us navigate uncertainty to the best degree. A deeply peaceful mind, and a virtuous mind is the best trait, the best skill to navigate uncertainty.\n\nSo we start to get the sense of, that's where I want to invest my energy. It's not wealth, it's not health, it's not property, it's not actually other people — it's my own peaceful mind and my virtues. That's my tool to navigate it.\n\nI think this is one of the really interesting effects. The more you stay thinking about it, you become very interested in: what's going to help me make it through the uncertainty of samsara? It's our Dharma practice. And especially a peaceful mind.\n\nSo let's try to catch it, a million bajillion times over this week. Just keep naming it, noticing uncertainty, noticing the suffering of uncertainty.\n\nAlright, that's enough. Let's have a little time for discussion now."
      }
    ],
    "conclusion": [
      {
        "speaker": "Kadam Kyle",
        "time": "3:19:35",
        "text": "All right. Thanks everyone. Oh, it's late. Let's just finish up with a final little takeaway practice. Maybe just one thing."
      },
      {
        "speaker": "Adriana",
        "time": "3:20:12",
        "text": "Neil got a promotion in our discussion section. He's now the CPO — the Chief Peace Officer. He's in the C-suite because that's what's gonna help him transform."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "3:20:32",
        "text": "That's very cute. Yeah, we'll all update our views appropriately. Thank you. Okay, one practice for the week. Anyone wanna call something out?"
      },
      {
        "speaker": "Anne",
        "time": "3:21:07",
        "text": "I love the idea of saying the mantra all day long — this is what will change."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "3:21:13",
        "text": "Yeah, good, that's what I'd like us to do too. So going around all day: this is gonna change, or this is uncertain. Basically synonymous but slightly different emotion to both of them.\n\nBut yeah, this is gonna change, it's gonna change. The good, the bad, the neutral, the whole thing. Let's really try to attune to it.\n\nThat peace in the heart? Yeah. We can, if you'd like to direct it towards cultivating some peace in the heart, then that's great. It will definitely naturally happen though too, because the more we think about that truth of uncertainty, we think I gotta have something to navigate it. It's only my peace. It's not controlling external things that will help me navigate it.\n\nYeah, okay. Wonderful, thank you all so much. Let's dedicate here to the virtues we've collected through practicing, meditating, discussing. May all living beings find lasting peace of mind, enlightenment. We can make any personal prayers."
      }
    ]
  }
}