{
  "classId": "2025-11-16",
  "date": "November 16, 2025",
  "session1": {
    "classIntro": [
      {
        "speaker": "Kadam Kyle",
        "time": "0:08",
        "text": "Okay, we're about to begin in a second, and as we meditate today in this session, we can, if we notice any certain challenges, oh, testing, testing, it is, but did you just lower the volume? Jack it up. Okay, I'll just move back a little bit.\n\nOkay, no, not that much. Oh, you like that, Ryan? Okay, we trust the music guy.\n\nYeah, okay, keep it, keep it, keep it. Exactly, yeah, exactly. We always move to the least common denominator.\n\nIt's a good choice. Yeah. Yeah, so when we're doing the practice, we can remember the instruction we looked at sort of towards the end of the last class about how repealing our unrealistic expectations of our samsaric experience to be a good time is really important.\n\nAnd this is a great thing to do whenever you meditate, which is to be like, I'm in samsara, bound by the chains of karma so hard to release, and the iron net of self grasping, the pitch black darkness of ignorance, getting chucked down the rivers of the four rivers of birth, aging, sickness and death. That's my situation, and I'm doing my best here. And my mind is enmeshed in delusions.\n\nAnd my being is enmeshed in all the negative karma that's in there. So it's not always going to be easy. Sometimes our mind is going to be an absolute train wreck mess.\n\nAnd basically, that's not a problem if we don't have expectations for it to be other than that. If we have expectations that our samsaric minds should just be perfect, and great, and always happy, and really good at meditating, then we're going to be miserable a lot of the time. Eventually, our minds will be that way, but it will be as we dissolve our samsara away.\n\nSo the point is, this is just a great thing to do in every meditation, actually before we do anything, is just to repeal these expectations. And just remember, I'm in samsara. I have a samsaric body and mind that I think is me.\n\nI'm always negative karma I'm working through. And my butt's getting kicked by a lot of delusions. Oh, I'm just normal.\n\nCool. And then we just sort of take the pressure off. And then we can just enjoy and do our best from there.\n\nOkay, so just give us a minute to reflect on this, and then we'll go into the practice. Okay, so we can just remember that we're swept along by the four powerful rivers, earth aging, sickness and death, tightly bound by the chains of karma, so hard to release, ensnared in the iron net of self-grasping, in the pitch black darkness of ignorance. This is just the normal situation as a samsaric being.\n\nSo we can just repeal any expectations that it should be other than this. We can think, I'm just going to do my best, happily, not expecting anything in particular, not even expecting it to go well. Then we can begin the practice."
      }
    ],
    "chantedPrayers": {
      "time": "5:27",
      "text": "LIBERATING PRAYER\n\nO Blessed One, Shakyamuni Buddha,\nPrecious treasury of compassion,\nBestower of supreme inner peace,\nYou, who love all beings without exception,\nAre the source of happiness and goodness;\nAnd you guide us to the liberating path.\n\nYour body is a wishfulfilling jewel,\nYour speech is supreme, purifying nectar,\nAnd your mind is refuge for all living beings.\n\nWith folded hands I turn to you,\nSupreme unchanging friend,\nI request from the depths of my heart:\n\nPlease give me the light of your wisdom\nTo dispel the darkness of my mind\nAnd to heal my mental continuum.\n\nPlease nourish me with your goodness,\nThat I in turn may nourish all beings\nWith an unceasing banquet of delight.\n\nThrough your compassionate intention,\nYour blessings and virtuous deeds,\nAnd my strong wish to rely upon you,\nMay all suffering quickly cease\nAnd all happiness and joy be fulfilled;\nAnd may holy Dharma flourish for evermore.\n\nGOING FOR REFUGE\n\nI and all sentient beings, until we achieve enlightenment,\nGo for refuge to Buddha, Dharma and Sangha. (3x)\n\nGENERATING BODHICHITTA\n\nThrough the virtues I collect by giving and other perfections,\nMay I become a Buddha for the benefit of all. (3x)\n\nGENERATING THE FOUR IMMEASURABLES\n\nMay everyone be happy,\nMay everyone be free from misery,\nMay no one ever be separated from their happiness,\nMay everyone have equanimity, free from hatred and attachment.\n\nVISUALIZING THE FIELD FOR ACCUMULATING MERIT\n\nIn the space before me is the living Buddha Shakyamuni surrounded by all the Buddhas and Bodhisattvas, like the full moon surrounded by stars.\n\nPRAYER OF SEVEN LIMBS\n\nWith my body, speech and mind, humbly I prostrate,\nAnd make offerings both set out and imagined.\nI confess my wrong deeds from all time,\nAnd rejoice in the virtues of all.\nPlease stay until samsara ceases,\nAnd turn the Wheel of Dharma for us.\nI dedicate all virtues to great enlightenment.\n\nOFFERING THE MANDALA\n\nThe ground sprinkled with perfume and spread with flowers,\nThe Great Mountain, four lands, sun and moon,\nSeen as a Buddha Land and offered thus,\nMay all beings enjoy such Pure Lands.\n\nI offer without any sense of loss\nThe objects that give rise to my attachment, hatred and confusion,\nMy friends, enemies and strangers, our bodies and enjoyments;\nPlease accept these and bless me to be released directly from the three poisons.\n\nIDAM GURU RATNA MANDALAKAM NIRYATAYAMI\n\nPRAYER OF THE STAGES OF THE PATH\n\nThe path begins with strong reliance\nOn my kind Teacher, source of all good;\nO Bless me with this understanding\nTo follow him with great devotion.\n\nThis human life with all its freedoms,\nExtremely rare, with so much meaning;\nO Bless me with this understanding\nAll day and night to seize its essence.\n\nMy body, like a water bubble,\nDecays and dies so very quickly;\nAfter death come results of karma,\nJust like the shadow of a body.\n\nWith this firm knowledge and remembrance\nBless me to be extremely cautious,\nAlways avoiding harmful actions\nAnd gathering abundant virtue.\n\nSamsara's pleasures are deceptive,\nGive no contentment, only torment;\nSo please bless me to strive sincerely\nTo gain the bliss of perfect freedom.\n\nO Bless me so that from this pure thought\nCome mindfulness and greatest caution,\nTo keep as my essential practice\nThe doctrine's root, the Pratimoksha.\n\nJust like myself all my kind mothers\nAre drowning in samsara's ocean;\nO So that I may soon release them,\nBless me to train in bodhichitta.\n\nBut I cannot become a Buddha\nBy this alone without three ethics;\nSo bless me with the strength to practice\nThe Bodhisattva's ordination.\n\nBy pacifying my distractions\nAnd analyzing perfect meanings,\nBless me to quickly gain the union\nOf special insight and quiescence.\n\nWhen I become a pure container\nThrough common paths, bless me to enter\nThe essence practice of good fortune,\nThe supreme vehicle, Vajrayana.\n\nThe two attainments both depend on\nMy sacred vows and my commitments;\nBless me to understand this clearly\nAnd keep them at the cost of my life.\n\nBy constant practice in four sessions,\nThe way explained by holy Teachers,\nO Bless me to gain both the stages,\nWhich are the essence of the Tantras.\n\nMay those who guide me on the good path,\nAnd my companions all have long lives;\nBless me to pacify completely\nAll obstacles, outer and inner.\n\nMay I always find perfect Teachers,\nAnd take delight in holy Dharma,\nAccomplish all grounds and paths swiftly,\nAnd gain the state of Vajradhara.\n\nRECEIVING BLESSINGS AND PURIFYING\n\nFrom the hearts of all the holy beings, streams of light and nectar flow down, granting blessings and purifying."
    },
    "guidedMeditation": [
      {
        "speaker": "Kadam Kyle",
        "time": "21:35",
        "text": "Feel that our mind mixes with our Guru's mind, like water mixing with water. We can feel that the ordinary appearance of us dissolves away into emptiness. Instead we can think, I am a Bodhisattva and a Bodhisattva community.\n\nJust imagine and feel what it would be like to be a Bodhisattva, a friend of the world. Just think, I am a Bodhisattva and a Bodhisattva community. Hold this beneficial belief in placement meditation.\n\nThen with this identity we can guide ourselves in one of our six session Guru Yoga practices. Whatever way we would approach it could be through using the Bodhisattva vows, the tantric vows, or whatever you've been emphasizing. Just give yourself some space to really steep into the practice.\n\nThen in our own time we can gradually arise from our practice."
      }
    ],
    "postMeditation": [
      {
        "speaker": "Kadam Kyle",
        "time": "21:35",
        "text": "Okay, hi everyone. Just from a purely housekeeping point of view, just a reminder, next week there is the exam from the previous book, 4 to 6 p.m. If you weren't part of the previous book or just recently joined, then you have a week of doing whatever else you'd like to do next week. If you feel frisky, you're welcome to come proctor the exam, so Sumit doesn't have to do it. If you're interested, just message me and we'd be happy to hire you for a couple of hours to hang out here. Otherwise, just have the class in your heart for the day, instead of the class in person.\n\nSo that's 4 to 6 next week. Then the week after that, what we're going to start to do is, at the beginning of each class we will read the appropriate bit from Guide to the Bodhisattva's Way of Life, as the sort of root text, and we'll do a couple of pages, basically, that are pairing or surrounding the text that we're studying that day. Usually we don't do that many verses in the commentary, but it's nice to get a few shots at the words and reciting them, just because they're so blessed and beautiful.\n\nSo that will be in two weeks, we'll start the beginning class reading. Yeah, like 10, 15 verses or something like that together. Suzanne, yeah?\n\nYou want to be off for Thanksgiving again? Yeah, we'll do a poll on who's around. We can do it now, if you want to do the poll now, or if you want to do it digitally, we can do it digitally.\n\nWe can do a poll whether we should do the poll now. That's very exciting. Okay, how about this, we'll try now.\n\nWe'll just do one class, like four to six, basically. So who can not do four to six on the 30th? Suzanne?\n\nThree. Okay, so we'll have class, and then if you have family stuff, whatever, then no worries at all. No pressure.\n\nBecause we know, we're modern people, we've got things going on. We have to cherish our families, and that weekend is really important for a lot of families. So please, there's no pressure at all if it doesn't work.\n\nBut we'll just do it a little bit lighter, four to six, and if you have to be on Zoom or whatever, while you're recovering from your turkey, we'll go for it. I was just figuring that a lot of people are back at work Monday anyway, so by the time Sunday night comes along, the weekend has sort of simmered down. Okay.\n\nThat's good. So let's see, online there's Adriana, Dale, Fran, Grady, and Kristen, and also Grady iPhone. Very nice, he's appearing in two forms.\n\nSo already emanating. Already, which is a little bit like showing off, but it's okay. We're not jealous.\n\nAnd then in person there's Sumit, Sharon, and P, Margaret, Maura, Byron, Michael, Jose, Ryan, and Kay, Mimi, and Suzanne, and myself. All right. So then last week we were up to all sorts of fun and wild and crazy things.\n\nWe were trying to continue our succession practice, making them like pillars of our day, joyful, delightful moments in our day, like a little respite. We were trying to upgrade it a little bit. Maybe we were bringing in aspects of thinking about renunciation, thinking about how we can't expect things to work in samsara.\n\nMaybe we brought in other facets, like a little bit on the six perfections, or developing bodhicitta, et cetera. And so a reminder from last week, the best form of a little day to share goes like this. This is what I practiced, XYZ.\n\nThis is the result I saw, ABC. This is my conclusion, LMNOP. There we go, like that.\n\nSo it's nice, this is like a nice way to share. So this is kind of what I practiced. This is kind of how it went.\n\nAnd this is like my conclusion from that. Okay, so over to you. Anyone have anything they'd like to share from the week?\n\nAny little practice bits and bops? Sumit, yes."
      }
    ],
    "practiceReports": [
      {
        "speaker": "Sumit",
        "time": "39:56",
        "text": "I've been fortunate to have a good work situation for several years, and things really turned. And so I tried to practice renunciation, and you know, Lord, my expectations, the thing we're talking about. And it's been really hard, because I really feel convinced that what I'm being asked to do is worse for the kids, you know?\n\nAnd I'm like, well, I don't have the power. It's how it is, and it doesn't feel right at all. And it feels really bad.\n\nAnd, but the alternative, basically, constantly getting arguments in my head, in the shower. You know, you argue with yourself, right? I've just been doing that too.\n\nSo I'm just, I'm like, because I don't actually want renunciation, right? I'm kind of like, just like, this sucks. And this sucks.\n\nSo it's not going so well, but I am trying it out, right? This whole thing is like, Lord, like, it was really helpful, actually, because it's like, yeah, the thought about how work's been really nice for me for several years, it's like, oh, yeah, this is what work is like for most people. It's very frustrating.\n\nAnd it was just like, that is a solve for me, right? So it does make it better to have that thing, but it's still not that great. So that's my experience."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "41:18",
        "text": "Yeah, fantastic. Thank you very much. Yeah, you're discovering the median mode and mean work experience, which is most people we meet who come to the classes here are coming to some degree because they're not having a fun time in their life, and some part of their not fun time in life is having a not fun time at work.\n\nSo some huge percentage, right? So it is actually very valuable, and it's lovely that you had a good time for so long. It's a little bit rare, I think, but I don't think that's often the case.\n\nAnd it's nice that you're kind of exploring the practice of seeing, like, okay, samsara is not really supposed to work out, including our samsaric job, run by samsaric people, pervaded by delusions. Yeah. Just the last thing on this.\n\nThis practice doesn't mean, for example, that when people are being harmed in a samsaric situation, it doesn't mean we don't care for those people who are being harmed. So it's not like hardening our heart, going, that's samsara. We can kind of do both.\n\nWe can say, yes, it's samsara. This is just showing me, like, samsara's real ugly face. I'm not going to expect it to be better.\n\nI'm not going to expect it to be better. It's just rotten to the core. But I'm still not going to care for the kids, and wish them to be free of suffering, and wish them to be free of samsara.\n\nSo we can kind of have a little bit of both. It's not like we're ignoring their pain. Anyway, thanks so much for sharing.\n\nI really appreciate that you put this into practice with a real-life situation. Others, please? Reports from the field?\n\nSharon, yes, please."
      },
      {
        "speaker": "Sharon",
        "time": "43:33",
        "text": "Well, I was working, in some ways, primarily, on not making it rote for myself, because I have such a habit of that, with, like, saying vows of various things. So I thought it was really interesting, and I just sort of took the time, took some time, and just tried to realize, like, sometimes I would, like, it's not in the books, but, like, listen to certain songs, and I kind of thought, oh, wow, this is totally unlocking a feeling of bodhichitta right now. Because it's kind of doing an end run around whatever, and I sort of just started working, and, like, walking around, and, like, just thinking of the music, and the words, and it was just very beautiful, because I was kind of starting to connect emotionally, and finding, just by taking time and not worrying about some corny song being the thing that gets me to the place, you know?\n\nSo, anyway, I was happy about that."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "44:42",
        "text": "Yeah, that's lovely, Sharon. I really appreciate you sharing that. So it's like you practiced trying to make these sessions a little bit more sort of personally relevant, and something that actually moves our heart, instead of just being something we're checking off a box to do, which is definitely a big invitation, I think, when we originally looked at this, right?\n\nIt's like, make it work. That's the point of it all, is to make it work for us. And so it's great, right?\n\nYou realize, okay, I'm trying to get to these certain minds, like bodhichitta, or whatever, and when I think about that song, it helps me connect to that mind. And that's what you found was helping you get there, right? And that's how we customize our succession practice, which is to bring daily appearances into the path, right?\n\nHaving the whole world teach us lamrim. And often that will make us engage in a sort of more creative way. Like I was just sitting here today looking at the wall doing this.\n\nAnd just thinking, how many teachings could I get from looking at the wall? It just taught me the whole lamrim. And then all of a sudden the whole wall is like a teacher for me, right?\n\nThinking, are my daily practices, are they like walls that constrict me, or are they like walls that hold my dharma roof over my head? How am I approaching them? Or the wall can be seen from many different points of view.\n\nOr some people might focus on the shoddy paint job of the wall, and other people might think it's a real, beautiful, authentic wall. Or some people might think about the bricks that were laid there and the kindness of the people who made those bricks and shipped them around, etc. But it's like I'm just sitting here looking at a wall, but it becomes like a teacher.\n\nIt becomes very poetic and beautiful. So we can do it with anything. And in your case, it was like doing it with a song.\n\nAnd then all of a sudden it opened up the heart, right? And then, fantastic. We're in our dharma experience."
      },
      {
        "speaker": "Margaret",
        "time": "47:03",
        "text": "Yeah, so thanks for that."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "47:05",
        "text": "Others, please. Margaret and then Anne, yes."
      },
      {
        "speaker": "Margaret",
        "time": "47:08",
        "text": "So I was with my mom because my mom had hand surgery and we got into a big argument. And I go over to her place this weekend. I call her on Thursday and I said, Mom, I'm coming over tomorrow.\n\nDon't come over. You don't need to come over ever again. So I feel like I do such hard work with my mom.\n\nSo I go over there. The whole weekend is just but I'm like, I'm going to just focus on my computer. Let this karma pass by, you know.\n\nDo you need anything, Mom? Like when it comes to dinner time, I don't really make a lot of I mean, in the beginning, I used to argue with her and like, Mom, why are you saying that? You know, but now I just let her vent.\n\nOkay. I'm not the face, but I'm like, I'm letting her vent and letting this stuff out, you know. And so this weekend, I found myself just like, when you brought up this thing, like, we're all deluded.\n\nWe're all deluded. Do I expect her to be anything different? Like, it's such an ingrained habit to be angry all the time.\n\nAnd just like lashing out, like calling my brother and just saying, you know, when I die, make sure Margaret doesn't come to my funeral. I'm like, this is the first, like she's really trying to like, you know, get to me. So I'm like, but a part of me is like, when does this end?\n\nYou know what I mean? Like when does, and I question myself, like am I not practicing Dharma? Because I make mistakes, you know what I mean?\n\nLike am I, you know, so I begin to be hard on myself."
      },
      {
        "speaker": "Margaret",
        "time": "49:02",
        "text": "So I just wanted to share that with you."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "49:05",
        "text": "Yeah. Thanks so much, Margaret. Yeah.\n\nSometimes our familial relationships can be our most challenging and tricky ones. And especially when we're trying to care for an aging parent. It is one of the kind of tricky modern experiences that people are going through.\n\nI mean, it's a forever experience, but it's definitely one of the things that many of us are going to go through or have gone through. And it basically teaches us everything. Yeah.\n\nAnd it does sound like you're in the midst of it. I just think that's great. And it's going to keep teaching you everything.\n\nAnd yeah, maybe the job is to be gentle with oneself and just keep practicing and learning. I often just think in those kind of situations, I'll just ask Dorjee Sugden, keep them around if this is favorable for me. If this is what I need, keep me in there.\n\nAnd if it doesn't go away, it's what I need. Sorry. If it's favorable for me, take me out of there.\n\nIf it's favorable for me, keep me in there. But give me the favorable condition. And then just give myself a little bit of space.\n\nAnd if it stays, then it's like, good. You're testing me. This is my exam.\n\nCould you use the mic again? Sorry. And then we'll go on to Ann."
      },
      {
        "speaker": "Margaret",
        "time": "50:36",
        "text": "What I found myself doing was like, I was like, because I saw how angry my mom was and I'm like, it's so painful because I wasn't like getting angry anymore. I'm just sitting there and I'm just going, you know, I'm going to be here for her. I don't know how long she has, you know?\n\nAnd I used to run away. That was what I used to do. So in that aspect, I'm like, I'm not angry with her like I used to be.\n\nAnd I saw myself just going, God, Donji, please help pacify her. And I would be reciting the mantra. I'm like, please pacify her mind because I know it's a delusion."
      },
      {
        "speaker": "Margaret",
        "time": "51:16",
        "text": "So, and it did help actually. And then I told her, I was like, Mom, I'm leaving Sunday. Do you need anything?\n\nAnd she goes, No. She was calmer."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "51:26",
        "text": "Yeah. Yeah. Thank you, Margaret.\n\nThat's lovely that you're bringing in Dorje Sugden to navigate the situation. And you're right. Like, it's probably improved a lot and I hope you can rejoice in that.\n\nI think a lot of people with these situations, they just run away and don't go there. And the fact that you're going into the proverbial lion's den is a lovely thing, right? Anne, please.\n\nThanks."
      },
      {
        "speaker": "Anne",
        "time": "51:53",
        "text": "So I was practicing not expecting too much. But this little pattern happened over and over again all week and this is like a little example. So I signed up for a dental plan, unlimited cleanings, $200 a year.\n\nAnd then I go to schedule my next cleaning and it's like, next appointment available, February. So my first reaction is like super annoyed. And then next reaction is like, well, this is Samsara, what do you expect?\n\nBut then, this is the part that interests me. The next reaction was just like being annoyed at myself for having gotten annoyed. And I did that all week and I realized how high my expectations are for not just like how I respond to the reaction I have for even having that little reaction on the first place like really mad at myself.\n\nAnd like, how is this helping? So I think for part of me, the lower expectations are not just like that situations are going to be wonky, but to be patient with my mind still being wonky for those little reactions and just be satisfied with the fact that I didn't, you know, run to billboard to talk about how awful this company is, right? Yeah.\n\nSo I've really learned a little bit more about being patient with myself."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "53:13",
        "text": "Yeah. Fantastic. Yeah, it's not fun getting scammed, basically.\n\nIt's just like, it stinks. Yeah. But it's great.\n\nYeah. And I'm with you. I think that's one of the applications of this is like as long as we're a samsaric being, we're going to keep getting deluded.\n\nAnd we don't want to turn the anger on the self we normally see. Yeah. Or on our real self.\n\nWe just want to see like, as long as I stay ordinary, I'm going to keep getting deluded. And it's going to be painful. I'm going to have to go through this exact cycle of trying my best and getting walloped until I identify myself as a Buddha.\n\nOkay. Yeah, and in that way we can be really patient. Because, yeah, we can't have both.\n\nWe can't be in samsara and not be deluded. Those are like two contradictory states. Yeah, so it's, yeah, thank you.\n\nIt's great being patient with oneself. Adriana, yes."
      },
      {
        "speaker": "Adriana",
        "time": "54:22",
        "text": "Hi. Well, if I had a lot of money, I would definitely use it to buy Anna a billboard. I think that would be a very good use of money.\n\nBut I was going to say that I have a very toxic workplace for years. So that's good for me and my practice. But through this six-session yoga in the past couple weeks, I have been, I gave myself a new job.\n\nSo my job is to love and respect people who don't love and respect me. They don't have to love and respect me back. Not my problem.\n\nBut my job is to find a way to continually love and respect them. And a couple of weeks, I think a few weeks ago, Karamkara, you said when we were finishing up our book on equanimity, you were talking about like one day you're going to be in a meeting and your boss is going to be yelling at you or you'll be eating a chocolate croissant. It'll be like the same experience.\n\nAnd I thought, oh, that's so cool. I hope that happens to me. And of course, like two weeks later, I had like two men yelling at me and humiliating me.\n\nI was like, oh my God, this is it. This is it. And I kind of forgot they were yelling at me for like 45 minutes or so.\n\nAnd then I was like, okay, so I don't think we have to do that. Like we're going to work together. You're going to get the same result.\n\nBut we could have just like come from a place of like trust and support. And you deeply disrespected me and devalued me. I'm not okay with that.\n\nSo I have to tell you that. And now let's work together. But it's in samsara, this is people doing their best.\n\nI learned that from Emily, that little phrase. It's like, of course, if they could have done better, they would have done it. They don't know another way than to yell at me because it's not fun for them either.\n\nSo I hope this is helping me come to terms more with what it means to be in samsara. It doesn't matter whatever your job title is or whatever the job is. It's the same job.\n\nBecause I'm always focused on like, I need another job. And I was like, yeah, I do need another job. This job.\n\nJust loving and respecting people. And it's really challenging. So it's a good job.\n\nThanks. I'm going to keep going."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "57:04",
        "text": "You need Sumit's job from three years ago. It's all great. Yeah, it's great how you're practicing that.\n\nAnd that's exactly it. It's like, I really like, what was the exact phrase Emily had said to you? People are doing their best in samsara.\n\nIs that what it is?"
      },
      {
        "speaker": "Adriana",
        "time": "57:26",
        "text": "This is this person doing their best."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "57:31",
        "text": "Yeah. Yeah. Yeah, it's a very useful way to think.\n\nI think, yeah. It's like when people are absolutely controlled by delusions, their best is often not something that we're that excited about. Same with ours.\n\nSame with our best. It's not often what people are that excited about either when we're controlled by delusions. And this is just a great way to train our mind.\n\nIt makes us very patient. And we just think, this person is a spiritual teacher for me, really showing me samsara's face. And that's kind.\n\nI needed someone to show me eventually, because I keep thinking it's going to work out. And so this person really is like a teacher for me. Yeah, thank you.\n\nAny last little bits? Okay, Fran, then Mimi, then Suzanne. And then we'll move to the next bit."
      },
      {
        "speaker": "Fran",
        "time": "58:32",
        "text": "So I've been doing my six sessions most days. I think one day I only got to five. I missed one in the afternoon.\n\nAnd first, I'm very proud of myself because this is the longest that I've lasted with any six session practice because we've got other ones and I always start off strong and then I fall off. So last week I was saying how I felt I was really feeling like for the first time that I was walking through life as a Buddhist as opposed to trying to make Buddhism work for me. And I'm still good with that.\n\nI'm also working on having the sessions not be wrote so that I'm at your suggestion in each of the sessions, sometimes picking one and really just dwelling on it a little bit longer than otherwise. I have found and this is where I'm having a little bit of an issue with first I was finding that my seated practice was so much stronger because of this feeling that I've been developing. But now I'm finding that I'm almost avoiding my not avoiding my seated practice but saying, okay, I did that those six sessions.\n\nSo now I don't really have to do a meaningful seated practice, especially because I really went a little bit. So I'm saying this out loud because I need to work on not having the six sessions replace a longer session. I mean, some days it can, but not to use it as sort of an excuse to be lazy with the rest of my meditations."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:00:18",
        "text": "Yeah, thanks for sharing Fran. I had to encourage you to just let it be."
      },
      {
        "speaker": "Fran",
        "time": "1:00:28",
        "text": "Well, that's why I also, I try very hard on myself. So that's part of my lesson is to not be so hard on myself and just let it be."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:00:37",
        "text": "Yeah, I don't think you need to think you need to do another thing. If you do the six sessions, just let it be that for the day. And then if something else happens, cool.\n\nOr if one of those six is a longer thing, cool. But I think part of the point of this exercise is starting to learn we can tap into something very beautiful and profound in a relatively simple way in a very short time, even amidst a busy life. And that if we relate to the seated practice, again, as the china, the fine china in the china cabinet, then it always gets a little weird.\n\nIt's always like something that we have to wait for the right moment. And then it has to be like this. And then it's very formal and it's a bit uncomfortable.\n\nAnd it can be quite pushed. And then it can just take on this strange quality to it. And even when it starts to go well, then it can become an attachment to us.\n\nLike, I need that time. If I don't have that time, that's not good enough. And then what I'm doing isn't okay.\n\nAnd it just creates an unhealthy cycle. So for me, I would just really encourage you. Anytime you hit those six, just think, fantastic.\n\nI did my job for today."
      },
      {
        "speaker": "Fran",
        "time": "1:01:57",
        "text": "Thank you because I really, I think you're right that I'm, because I'm becoming attached to that other practice."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:02:06",
        "text": "Yeah, exactly. Yeah, some theoretical, perfect seated practice. You know, when Genlo was here, if you remember, Michael asked a wonderful question, right, about like trying to make the right amount of time for the practice.\n\nAnd she gave a beautiful answer. And one thing she said in her answer was, in one minute, you can basically have this transcendent experience. I forget her exact words, but it was basically like that.\n\nAnd she had a look in her eyes of like, I know this. And it was very touching for me. I was looking at her as she was saying it, and just like, in less than a minute, she was basically saying, you can tap into something very precious.\n\nAnd so, I hope we can slowly find that out from doing this, yeah. Thank you. Okay, the last two, Mimi and then Suzanne, yeah.\n\nLet's see."
      },
      {
        "speaker": "Suzanne",
        "time": "1:03:09",
        "text": "So, just briefly, two things. So, this week, my practice was not perfect, which is good for me, actually."
      },
      {
        "speaker": "Suzanne",
        "time": "1:03:23",
        "text": "Because I have it like on my log, I have this big line where I've missed two sessions. And then I look back and I'm like, what happened? You know, life just got in the way.\n\nBut I was like, okay, it's okay. It's fine. The one thing, though, that was really beautiful this week was I have been like chit-chatting with a friend.\n\nAnd, you know, we've been doing Dakini yoga together. And so, I will text her and say, you know, are you, she said, I want to, because I've been visualizing myself with this little knife, Vajrayogini's knife, her curved knife. I just think that's so cool and I love it so much.\n\nSo, like, I just see myself walking around. And she said to me, I'm going to do the same thing. And I said, okay.\n\nSo, I'll text her in the morning and I'm like, did you sharpen your knife? And she says, just sharpening it now. And so, the one thing that, you know, I said, let's wear a crown today.\n\nAnd she's like, okay. And, but the one thing that was really funny, and I'll end with this, was I said, you know, I've been so busy all week. Like, I've been trying to do my six sessions.\n\nI'm trying to prepare for my Friday class. I'm trying to study for the test. Just like, I don't have time for anything ordinary.\n\nAnd she said, I think that's the point, Mimi. So, I'll end with that."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:05:07",
        "text": "Thank you. Yeah, so you're just showing the joy of relying on a sangha friend. And that regular sangha support, having like an accountability buddy, and just having some fun with it, and being very playful.\n\nAnd it's lovely. It's so great to have someone like that, that we check in with. Because they lift us up some days, we lift them up some days.\n\nThe days that we're both down, at least we got a buddy, down in dumps together, and the days we're both up, we're just rejoicing and celebrating and making it even stronger. So it's really nice to show that example. Thank you.\n\nSuzanne, please."
      },
      {
        "speaker": "Suzanne",
        "time": "1:05:44",
        "text": "I have been a little distracted the last couple of days, but I think that buddy was me."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:05:51",
        "text": "You were the buddy. Buddy revealed."
      },
      {
        "speaker": "Suzanne",
        "time": "1:05:54",
        "text": "Yes, I think it was me. Good buddy, yeah. So I'm a little in shock, and I feel very numb.\n\nAnd I know as I begin the grieving process for Mia, I'm going to need a lot of patience. So I really think I just need to up that practice. I need to be kind and gentle with myself.\n\nIt's been a long process, and yeah, I know it's not going to be easy going forward. So I just wanted... Luckily, I had already started the patient acceptance, so I'm just going to continue and up it."
      }
    ],
    "shantidevaReading": [],
    "postReading": [],
    "mainTeaching": [
      {
        "speaker": "Kadam Kyle",
        "time": "1:06:36",
        "text": "Yes, thank you for sharing that, Suzanne. Yeah, I think so too. I think patience is our ally, and even being patient with ourself when it's hard for us to be patient.\n\nBasically, that we're trying is a success. And it's always important to remember that. Trying to practice dharma is practicing dharma.\n\nIt's not having the result that's practicing dharma. So trying is succeeding. And so sometimes it's like, okay, I'm going to be patient with myself that I'm trying, and happy that I'm trying.\n\nNot necessarily that I'm feeling better from trying. Yeah, thank you. And we're here for you.\n\nYeah. Okay, lovely data. Everyone, thank you so much for sharing.\n\nIt's definitely a highlight of my week, hearing people's practice, that we're being modern Buddhists. Okay, so then, we are on page 14. No, we're not.\n\nWe're on page 13, I think. Yep. Starting with the phrase, in the first part of verse 1.\n\nSo in the first part of verse 1, Shantideva himself pays homage to the Three Jewels in order to eliminate the obstacles that might arise while composing this text. He prostrates first to the Saggathas, or Buddhas, who are endowed with the truth body, Dharmakaya, of an enlightened being, as well as with all Dharma jewels. He then pays homage to the Sangha by prostrating to the Bodhisattvas, the Buddhas' noble sons and daughters.\n\nAnd lastly, he pays homage to the abbots and preceptors and all those worthy of veneration. This concludes his expression of worship. Promise of composition.\n\nNext comes the traditional promise of composition. It was customary for authors to include such a promise at the beginning of their work to serve as a brief introduction to their intended subject matter. It is Shantideva's intention in this text to present a synthesis of all the paths leading to the attainment of highest enlightenment, Buddhahood.\n\nThis is the meaning of Bodhisattva Karyavatara, for it is only by engaging in the Bodhisattva's way of life, venturing into the activities of the sons and daughters of the Saggathas, that we can attain this highest goal. There are two benefits of studying this precious text. The temporary benefit is that we gain an understanding of the entire path to enlightenment and are thereby enabled to practice it.\n\nThe ultimate benefit is that by depending upon this text, we will attain the fully enlightened state of Buddhahood. The ultimate benefit depends upon the temporary benefit, and the temporary benefit relies upon the meaning of the text, which in turn relies upon the text itself. This dependent relationship is known as the relationship of the text.\n\nThus, Shantideva's promise of composition in verse 1 indicates that his text has been composed in accordance with Buddhist scriptures and contains the four qualities of meaning, temporary benefit, ultimate benefit, and relationship. Reason for composition? Next, Shantideva explains what his reasons are for composing this text.\n\nHe admits that it will not contain anything that has not been explained before. Also, since he has no skill in the art of rhetoric or poetry, he has no intention of benefiting others who have already understood the teachings of Buddha. Rather, he wrote this text so that his own virtues would increase, his own understanding of the scriptures would not decline, and his own mind would become better acquainted with the meaning of the scriptures.\n\nHe goes on to say that through the power of his faith, composition, and wisdom, he will explain the meaning of all the scriptures, and thus his own realizations will increase for some time. He hopes that if others, equal in good fortune to himself, were to behold this text, it would prove meaningful for them as well. This concludes the preliminary explanation.\n\nIn verse 4, Shantideva begins his presentation of the actual path to be followed by those wishing to enter the Bodhisattva's way of life. Okay, so just briefly on the reason for composition, because we did talk about this a little bit at the end of the last book. And part of this is just the kind of classic humility of a Buddhist teacher.\n\nHe's just saying, yeah, I'm not saying anything that's new. I got no particular skills. I'm just an ordinary person doing my best here.\n\nThey're not putting on a show. They're just so humble, these kinds of practitioners. That's what they would say.\n\nThey couldn't say anything other than that. It's an unusual kind of humility. But then he says this helpful point, which is that basically through writing the text, he's doing it kind of just for the good karma of it.\n\nAnd he'll say, and I hope other people will benefit too, but principally I'm just kind of doing it for the good karma, which is, again, all these things are teachings. It's not about the reason for composition as some historical fact. It's a teaching.\n\nAnd so we can think in our own actions in our life, how often are we thinking, I'm doing this for the good karma. Like really happily. Because it's a happy feeling when we think that.\n\nI'm doing this for the good karma that's going to come. Versus we're just doing it on autopilot. Or just doing it because we're supposed to do it.\n\nOr doing it because someone told us to do it. So we want to connect to this sense of delight of doing something for the merit that will be created from it. It's a whole big section on accumulating merit in this book.\n\nSo we're not going to do it in all of its glory right now. But it's more just a question for each of us to probe. Like how often are we really connecting to the good karma we're creating in the actions we do?\n\nAnd finding that alone to be delightful. It's like if we do our water offerings in our shrine. It's like are we connecting to the good karma we're creating?\n\nAnd being really delighted about that and happy with ourself. Or if we put out some publicity. Put out some cards around.\n\nAre we thinking about the good karma that we're creating? Or if we assist a class here. Are we thinking, this is amazing.\n\nI'm creating so much good karma by doing this. And this is a training. It's like training and thinking in this way will actually increase our faith in karma.\n\nAnd it will also uplift the mind. If we don't regularly practice thinking this way, then our faith in karma and our experience of it will just be a bit abstract and kind of separate. So we kind of want to keep remembering it throughout the day in any good action we do.\n\nThis also eliminates perfectionism, which is fantastic. Because we think, I'm delighted about the merit I created. I'm just so happy with that.\n\nEverything else is gravy. It's like extra. But we really start to live in that space.\n\nWhich is a very actually relaxed space to be in. It's like trusting our intention. Trusting the karma we're creating.\n\nI just wanted to say this a little bit. Again, all these points, they're personal advice for us. What would it be like to have this same approach?\n\nThe actual explanation of the stage of the path to enlightenment. This is two parts. The exhortation to grasp the significance of this precious human life.\n\nThe method for making this precious human life meaningful. Exhortation to grasp the significance of this precious human life. Shantideva begins by reminding us that we now have a most rare and precious possession.\n\nA fully endowed human life. In contrast with the overwhelming majority of beings in the universe, including most of our fellow humans, we have the opportunity to do something truly meaningful with our lives. We're free of certain restrictions and in possession of certain abilities and beneficial circumstances that make it possible for us to attain goals far beyond the reach of most beings.\n\nBut if we do not make use of our present existence in the most worthwhile way possible, worthwhile manner possible, it will be extremely difficult to gain such a beneficially endowed human life again. To appreciate these points more fully, we must acquaint ourselves with the following detailed analysis. First of all, why is our present state of existence considered to be so rare and so difficult to attain?\n\nThe reason is that we are not born human by chance. Every effect has a cause. And our present existence as human beings, and especially endowed human beings, is the result of a number of specific and hard to create causes.\n\nIn general, birth as a human depends upon having previously practiced pure moral discipline and giving. Specifically, each aspect of a fully endowed human life, as described below, has its own appropriate cause. Furthermore, in order to have attained this life, we must have generated pure thoughts or prayers to receive a bodily vehicle with which we would have the leisure and ability to improve our mind through the continued practice of Dharma or spiritual teachings.\n\nTo be effective, such prayers have to be unpolluted by attachment to temporal comforts and happiness, as it is rare that we create even one of these necessary causes. It follows that the fruit resulting from a combination of them all must be extremely rare to find. Okay, so this meditation that's being described here is fantastic.\n\nIt's a huge, encouraging meditation to do. An analogy that I find helpful is like, we're born in this ocean of suffering, which is samsara. And every condition we need for a precious human life is a bit like a board.\n\nOkay, it's like just a single board, each condition. So some people are born into this life in samsara as a human. That's one board.\n\nOkay, so just being a human, you're in a huge, terrifying ocean with the sea monsters, the lord of death, swirling about with a board. It's not a particularly precious situation, right? We're not going to get very far holding on to a board.\n\nEach additional condition is like another board. How many boards do we need before we get like a boat? The analogy doesn't totally work, because at some point they get put together.\n\nThey're all together, not just floating random boards, right? So each condition that we have is like another board. So we need like 20, 30, 50, I don't know what number it is, to get like a boat, like a little raft at least, to even just be able to do anything in the ocean of samsara, spiritually.\n\nSo each effect that kind of makes up a precious human life is like one of these boards. But what happens in a lot of our past lives is that we were reborn in the ocean of samsara, and we had like three of the effects. So we had, let's say we were born in a place where Buddha has taught, or sorry, in like an era where Buddha has taught, where Buddha has appeared.\n\nCool, one board. But we're not in one of the countries where that's the case. So we have no access to the teachings, there's no liberation possible, right?\n\nSo it's like we had like a board or two, but we didn't have enough boards to actually make our practice work. Or we had a bunch of the boards, like we had good sense faculties. We were not born as a hell being, a hungry spirit, an animal, ordinary God.\n\nWe were born in a place where there is religion, where there's Buddha Dharma. But we just didn't get the board of not holding wrong views. Whoop, that's not going anywhere.\n\nSo you see, like each one of these has an effect of a certain karma. But in each life, to get all the effects you need for a precious human life at once is incredibly sort of impossible, basically, to get. It's just in so many of our human lives we've gotten a handful of them, but not all of them at once.\n\nSome of these are really hard to do, right? Like, what does Geshe say here? In order to attain this life, we must have generated pure thoughts of prayers to receive a bodily vehicle with which we would have the leisure and ability to improve our mind through the continued practice of Dharma or spiritual teachings.\n\nSo there was some little person in our past lives who said they did something specifically with that intention to create a bodily vehicle for spiritual growth. Not just a bodily vehicle, but they purposely wanted to create a precious human life. So they did actions, and it probably wasn't just one, because it's incredibly unlikely we would have stumbled into just the one of them.\n\nThey probably created a ton of actions for that specific result. Just any action done with that intention. With the intention to create a bodily vehicle.\n\nSo any good, positive thing. So they did that. Now, in addition, the prayers had to be unpolluted by attachment to temporal comforts and happiness.\n\nSo they did it free of the eight worldly concerns. How many of our actions in this life have been done free of the eight worldly concerns? But there's some.\n\nThere's some that are completely pure actions, even just seeing a Buddha is a pure action. But a lot of the things we do, like a lot of our meditations, are about being happy now, right? Feeling good now in this life.\n\nSo this person, past us, or many past uses, did these completely exalted actions free of the eight worldly concerns to create this life. So when we start pondering this, we start to feel like I've landed up in a life with a bunch of these results that are really hard to create. I got them, and I didn't just get them, but I got them all at once, which is incredibly uncommon.\n\nAnd when we start to ponder this sort of improbability of it, we start to get this really nice sense, like, wow, I've really hit the jackpot here. I've got to make something of this shot. And in addition, we start to feel uplifted because we feel like in our lineage, in our karmic lineage, there are these amazing, beautiful spiritual people.\n\nWe don't know them, but they gave us these conditions. And sometimes we don't think of ourselves that way. Maybe when we came into this life, we didn't feel particularly spiritually oriented.\n\nBut there had to be spiritually oriented people who were very sincere, really going for it to give us this opportunity. And so for me, I don't know, when I start to think about that, I feel really good inside and feel uplifted. It's similar to when people came from a family who went through very difficult immigration experiences to create the life that we have now or went through depression era difficulties and so on.\n\nThere's a sense of looking back on those ancestors and going like, wow, you all basically just sacrificed and went through hell so I could have this. There's a sense of gratitude for those people. And we just feel like we're part of this lineage of kindness where people have passed us a baton.\n\nAnd they were like, yeah, maybe in this life, I'm not going to make it spiritually, but I really hope future me does. And I'm rooting for them. And so for me, when I start to feel that way, I feel this gratitude of these past people.\n\nAnd I feel uplifted to think, wow, there's these yogis and yoginis in this lineage who lived. And even if I don't feel like that right now, I know they were there and they gave me this. So there's a sense of gratitude and wanting to pay them back and pay it forward.\n\nBut there's also a sense of spiritual potential. Like, wow, there are serious practitioners in my mind stream. Or else this wouldn't have appeared in the way it did.\n\nSo this is just a great way to ponder and think. And the result is an incredibly uplifted feeling."
      },
      {
        "speaker": "Sharon",
        "time": "1:26:24",
        "text": "Nico, yes, please. So if they were so good with their moral discipline and other spiritual behaviors, why did they not get enlightened? Yeah, because it's...\n\nOr at least end up in a pure land. Yeah, because it's hard."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:26:48",
        "text": "It's just really hard. Like, so you think they created all these individual causes, which is amazing, right? But maybe they were just missing some certain specific one in their life.\n\nFor example, maybe they didn't have practice to... They didn't have the teachings on emptiness. But they had other things.\n\nOr maybe they had a teacher, but the teachings had degraded a lot. And so there wasn't a full path available to them. Or there wasn't high Surya Tantra, so they couldn't become enlightened quickly in one life.\n\nIt's hard to get all the things right, even if someone is amazing, to attain a pure land."
      },
      {
        "speaker": "Sharon",
        "time": "1:27:40",
        "text": "And it kind of sounds like we're talking about them as if they're human."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "1:27:44",
        "text": "Yeah, or gods. They could be gods if they created these causes. Yeah, but humans are gods, yeah.\n\nYeah. Yeah, like for me... Well, anyway, yeah.\n\nThe point is, we just try to reflect on these incredible, hard-to-create causes that have all happened at once. That's the thing that we want to connect to. And feel this sense of gratitude.\n\nWe'll get into that more and more detail in a moment. A big part, though, about this meditation on precious human life is about our belief in enlightenment. And we're going to learn more about this, of course.\n\nAnd we already know a lot about it. But I just want to really encourage us all, like maybe this is something that we can kind of imbue within our succession practice, or like put into it this week. It's just increasing our faith in enlightenment.\n\nBecause it can, again, it can increase until we're a Buddha. So there's no limit on how far it can go. We can keep improving our faith in enlightenment.\n\nAnd this is something that really benefits from just little dips in, to improve our believing faith, admiring faith, and wishing faith in enlightenment. Here we're mostly talking about our believing faith, like kind of comprehending it and its potential for ourself. But it can also be a little bit of the other two, of course.\n\nAnd if we can kind of tap into this six times a day, for like even 20 seconds, just increasing our believing faith, and maybe admiring, wishing faith in enlightenment, it will start to really move in a positive direction. A lot of our problems in our practice come from just not having that much faith in enlightenment. And it's kind of because it's only in the Precious Human Life meditation that we're like, we're kind of like, well, that's just the first meditation.\n\nThere's all these other meditations I've got to do. And so we can get a little bit like ignore it, and kind of skip on to the next meditations, and not give it like it's time, right? To just keep connecting to the thought, like I can become enlightened.\n\nI can become enlightened. I can become enlightened. Even just like as a mantra, that will increase our faith in enlightenment.\n\nSo I wanted to just read a dear little paragraph. Does anyone know which one I want to read? It's from Mirror of Dharma.\n\nMy favorite. Not that I have a favorite, but it's my favorite one. Well, I'm not reading it enough, obviously, in the class.\n\nSo as we might know, all of the teachings of Kadampa Buddhism are within what's called the Ganden Oral Lineage. But there are certain teachings that we say like, that's a special Ganden Oral Lineage instruction. Which means like, something very definitive that sort of holds the entire meaning in a simple way.\n\nThere's something like about, and often there are teachings that came from Geshe-la later on in Oral Instructions of Mahamudra, Mirror of Dharma Editions, How to Transform Your Life, which are his most recent teachings that he gave, right? There are things like Geshe-la wanted to say very concretely and specifically that we like to say, that's like a special Ganden Oral Lineage instruction. Basically, it's very clearly from the point of view of highest yoga tantra, but also contains everything.\n\nSo it's like, it's very, just very, very beautiful and special and unique. Like a little extra, extra, extra special jewel. And this is definitely one of them.\n\nBecause Geshe-la put this paragraph and versions of it in multiple books in Oral Instructions of Mahamudra, Mirror of Dharma Editions, and How to Transform Your Life, his three most recent books. He put some version of this exact statement. And when he taught on this in London, in the Mirror of Dharma Transmission, this is where right afterwards he gave the teaching on Nagarjuna's intention.\n\nShe said it's like the highest view. And this practice, this teaching helps us understand enlightenment. So we're not going to obviously get into it all, because we've got to take a break, but I'm going to read it.\n\nAnd so next time, I take out Mirror of Dharma Editions, and I say, I say, I'm going to read my favorite bit. I really hope we know. And go, I know what it is.\n\nI know your favorite bit. Okay, so Geshe says here, we should know that we're thinking I, I, day and night, even during sleep. Because of this, we perceive an I as our self.\n\nThis way of identifying our self is wrong, because the I that we normally see does not exist. Through this, we can understand how we are identifying our self mistakenly all the time. For example, suppose a practitioner called John, through perceiving his body or mind, which are his basis of imputation, spontaneously thinks, I am John.\n\nBecause as a basis of imputation, his body and mind are contaminated by this inner poison of delusions. His recognition of himself as John will cause him to experience suffering continually. I'm going to read that sentence again, because it's like, it's hard to say which is the most important one of all these, but this is like one of the key, mega, mega, mega key points.\n\nActually to understand all of Kadampa Buddhism, to understand renunciation, to understand Tantra, to understand enlightenment. This point. So I'm just going to read it again, a little slower.\n\nBecause his basis of imputation, his body and mind, are contaminated by the inner poison of delusions, his recognition of himself as John will cause him to experience suffering continually. If John does not wish to experience suffering, he needs to change his basis of imputation from his contaminated body and mind to an uncontaminated body and mind. Such as the body and mind of Haruka, Vajragini, or any other guru deity.\n\nThis is not only for John, but for everyone. Anyone who does not wish to experience suffering needs to change their basis of imputation. It's on How to Transform Your Life, which is a free e-book.\n\nAnd for anyone, they don't need a Tantric empowerment to read it and practice it. Geshe just says, people need to move from identifying themselves as a contaminated body and mind to the union of appearance and emptiness. I think it's what he says.\n\nIt's just the same meaning. But this is just a little bit more Tantrically themed. But anyone can do this.\n\nOkay, so, all I want to say right now about this is that understanding this paragraph will give us an incredible faith in enlightenment. Like, we'll just feel So, enlightenment is just moving the thought, I, from a body and mind that suffers to a Buddha's body and mind. That's all enlightenment is.\n\nIt's just learning to think, I, on a Buddha's body and mind. That's it. That's all enlightenment is.\n\nAnd when we really take that in, we'll just see the entire spiritual path is very simple. It's just so simple. We were just going around imputing I on a suffering body and mind, trying to make that one happy.\n\nThat's why it's complicated. So instead of trying to make a suffering body and mind happy, which is impossible, all we need to do is stop thinking of that as us, and start thinking of a Buddha's body and mind as us. And so, there's a difference between doing it and understanding that's all we need to do.\n\nWe're going to, of course, work on doing it. That's what tantric practice is about. That's what the entire Gandhana lineage is about, is doing it.\n\nBut there's a lot of benefit to just feeling like we fully comprehend and have faith in that truth. That's what we mean by belief in enlightenment. If we can just simply reach a state of mind that thinks, that's all I need to do, and really have that touch our heart, just that thought.\n\nNot even, I can do it today, or even in this life, or I even know how to do it exactly. We don't even need to get to that yet. But just the sense of, that's all I have to do.\n\nStop thinking I, on an ordinary or suffering body and mind, and start thinking I, on a body and mind that's free of suffering, a Buddha's body and mind. That's all enlightenment is. If we can just get that believing faith, that'll make everything just fall into place.\n\nIt's a little bit like, like if you read like a code, or something like that, and all the words are scrambled, and the letters are all mixed and jumbled, and then someone gave you like a little codex or something, like a little computer program or something, that just made it all instantly make sense. Just like solved the code instantly. That's sort of like, if we can get a believing faith, in this one point, all the dharma, all the teachings, just snap into place.\n\nAnd there's a sense of, well I can do that then, of course. Suffers, because he imputes his eye on the Pittsburgh Pirates. If he just imputed his eye on a winning baseball team, he wouldn't suffer less.\n\nI'm just sort of joking. But it's a bit like that. It's like, he's only in pain, because he's chosen a terrible baseball team, that will forever lose, until the end of time.\n\nIt's like with Brooklyn Nets, too. No, that's close to home. No, no, no, sorry, sorry.\n\nYeah, yeah, yeah, sorry, sorry. So the analogy obviously isn't perfect, because the baseball team's not going to make us happy, right? But that analogy is actually a little bit helpful in showing how simple it is.\n\nIt's like, you're just identifying with a losing team of losers. So you're going to keep being unhappy. You can just change what team you identify with.\n\nYou don't have to be from there. You can just choose. And so in the same way, we can actually choose who we identify with as a person.\n\nWe can just stop identifying as an ordinary body and mind. Identify with a Buddhist body and mind. And when we do that, and we don't stop doing that, that's enlightenment.\n\nOkay, so we'll just dedicate here. We can think through the virtues we've collected, through practicing, meditating, discussing. May all living beings find lasting peace of mind, enlightenment.\n\nYou can make any personal prayers or dedications. Okay, thank you. So we'll come back at 6.16. Thanks."
      }
    ]
  },
  "session2": {
    "chantedPrayers": {
      "time": "1:58:00",
      "text": "LIBERATING PRAYER\n\nO Blessed One, Shakyamuni Buddha,\nPrecious treasury of compassion,\nBestower of supreme inner peace,\nYou, who love all beings without exception,\nAre the source of happiness and goodness;\nAnd you guide us to the liberating path.\n\nYour body is a wishfulfilling jewel,\nYour speech is supreme, purifying nectar,\nAnd your mind is refuge for all living beings.\n\nWith folded hands I turn to you,\nSupreme unchanging friend,\nI request from the depths of my heart:\n\nPlease give me the light of your wisdom\nTo dispel the darkness of my mind\nAnd to heal my mental continuum.\n\nPlease nourish me with your goodness,\nThat I in turn may nourish all beings\nWith an unceasing banquet of delight.\n\nThrough your compassionate intention,\nYour blessings and virtuous deeds,\nAnd my strong wish to rely upon you,\nMay all suffering quickly cease\nAnd all happiness and joy be fulfilled;\nAnd may holy Dharma flourish for evermore."
    },
    "teaching": [
      {
        "speaker": "Kadam Kyle",
        "time": "2:20:03",
        "text": "What are the other ways to increase our faith in enlightenment? Like if you're teaching a GP called, How to Develop Faith in Enlightenment? Like what would you tell the students who came?\n\nLet's get Miss Mimi the mic. Anyone feeling a... Yeah, yeah, please."
      },
      {
        "speaker": "Suzanne",
        "time": "2:20:30",
        "text": "To identify with their potential."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "2:20:33",
        "text": "And what does that mean exactly?"
      },
      {
        "speaker": "Kadam Kyle",
        "time": "2:20:39",
        "text": "Yeah, yeah, yeah, yeah. Basically in the sense of, it mostly means stop identifying with the delusions as a self, right? So this is like the gold nugget and the water and the salt, or the water and the dirt, or the clear sky and the clouds.\n\nAll those analogies, right? What can I try to get at this point, right? Because most people just identify with the clouds, the salt, the dirt, and the dirt.\n\nSo we don't have to do that. If we just stop thinking they're us, then yeah, we do believe that we can become enlightened much more easily."
      },
      {
        "speaker": "Anne",
        "time": "2:21:14",
        "text": "And yes. So I'm remembering this wrong from the silent retreat, but it was something you said that went something like, if I can have a little peace, I can have a lot of peace. If I have a lot of peace, I can have total peace.\n\nIf I have total peace, I can have enlightenment."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "2:21:31",
        "text": "Yeah, that's probably the best GP teaching. Maybe in general. But definitely if you want to try to convey that people can attain enlightenment at that point.\n\nIt's just logical, right? We're just saying enlightenment is permanent inner peace. If through meditating you can find a little peace, then you can meditate and find a lot of peace.\n\nIf you can find a lot of peace, you can find lasting peace. So why can you not become enlightened? And that's fantastic.\n\nI milk that thing all the time. I remember actually in that retreat, I was meditating in that session, and I got so inspired. I gave the teaching, but I was just so touched actually by reflecting on that reasoning again.\n\nYeah, that's a great one. Others? Faith and enlightenment?"
      },
      {
        "speaker": "Sharon",
        "time": "2:22:21",
        "text": "Oh, Grady, yes. So we know that to develop faith, you consider the benefits of enlightenment, right? So you can just go through the list of the benefits of becoming enlightened, which is a plethora of things, but all your suffering is gone.\n\nAnd it's the only true way to help people is to become enlightened. So just going through the list of benefits."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "2:22:57",
        "text": "Yeah, thanks, Grady. So you're kind of going in the admiring faith route. And it is one of the interesting things because we might think, well, I can't have admiring faith in it because my belief in it is weak.\n\nBut it's not always like that. They're all supportive of each other. So actually, the more we admire an object of faith, the more we'll believe in it.\n\nAnd the more we believe in it, the more we will also admire it. So sometimes, actually, you can go admiring first because if you admire, then you get blessed. And when your mind is blessed, it's more clear.\n\nAnd then you can see it as it is more clearly. So yeah, that's definitely a way in. Any others?\n\nSharon, yeah? Can someone chuck her the mic? Sorry.\n\nOne day we'll have a floating mic kind of from the ceiling that will just automatically move to whoever's talking."
      },
      {
        "speaker": "Sharon",
        "time": "2:23:55",
        "text": "It's kind of like the last two put together, which is kind of the continuum of seeing our own progress, even if it's just a little bit, oh, I'm a little less neurotic than I was. And then also at that point to start looking, oh, and here are these other people in my sangha or other teachers that I see, and they seem to have all these good qualities. So kind of just feel it as a continuum that I'm on and see others on that as well, if that makes sense."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "2:24:23",
        "text": "Yeah, those are both two good ones. So just rejoicing in our own small growth and success, like our little dharma jewels, as we know from the Refuge section, from Joyful Path and Good Fortune, rejoicing in our own little dharma jewels is a huge encouragement, actually, that we can keep growing. And then rejoicing in others, like our sangha, teachers, etc., gives us more faith. Sumit, look at this. We've got a whole bundle of strategies. This is great."
      },
      {
        "speaker": "Sumit",
        "time": "2:24:56",
        "text": "I'd like to point out that probably your experiences of failing at achieving a goal or external goals, and that there's stuff out there that you can't control, whereas this is an internal development when there's nothing. It's actually just up to you. And so this is of a different nature than all the other things you've tried in your life.\n\nUnlike all the other stuff in your life, this is actually fully in your control. And so therefore, you can achieve this if you put your mind to it."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "2:25:26",
        "text": "Yeah, thank you. So it's like speaking to people's discouragement, which is one of the obstacles in believing in their enlightenment, and letting them let go of that discouragement. Because a lot of our discouragement comes from trying to control external conditions, which is mind-numbingly discouraging for most people, because it just never works out.\n\nAnd so if you're like, Hey, you're actually not a failure. You're just normal. You've been trying to do something that can't work and doesn't work.\n\nSo actually, you don't need to be so discouraged about your life. This is a spiritual endeavor, just about controlling the mind. If I can control my mind, I can control basically all things.\n\nOr what need is there to control anything else? That idea is basically a belief in enlightenment. Yeah, so that's lovely.\n\nIt's showing it's like an internal journey in dealing with the obstacles of discouragement. Margaret, last one?"
      },
      {
        "speaker": "Margaret",
        "time": "2:26:27",
        "text": "I was thinking if it was like the first GP class, and we were talking about how life is rare, and what is the meaning of this life and the purpose of this life? Aside from just living a regular life and doing what everyone is doing, but there's a way out as well, into our suffering. And there's a beautiful mind that we have that we can do, and we can transform that with this human life."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "2:27:04",
        "text": "Yeah, so you're talking a little bit about how our life is rare, precious, and immensely meaningful, these qualities of our precious human life. And the opposite of pursuing that is basically trying to look outside of ourselves. So what you're describing is often Geshe's first thing he'll say.\n\nIt's just like, we've sought happiness outside of ourselves for so long, trying to find the right partner and position, etc. And we know how that's gone. We have no less problems today and no fewer suffering.\n\nIn fact, the problems and suffering we experience are maybe far greater than they were previously. It shows that our happiness and suffering don't come from external things, they come from the mind. So you're kind of like, with that method, it would be more like closing the other options off from working.\n\nAnd you're like, darn, I guess I have to become enlightened. And that's like a wishing faith kind of on the way in. Yeah, darn, exactly.\n\nIt's like, the rest of it is not going to work. Anyway, we could keep kind of pondering this. A couple of other simple things.\n\nLooking at Buddha, feeling that he's alive, actually gives us faith and enlightenment. Just feeling like he's living and looking at us back. Like looking right at us with loving eyes.\n\nThis is the gazing practice. It's one of the easiest things to do. And getting a picture that you really, really love to help you do this is wonderful.\n\nLike I have this huge face of Vajragini that I do this with. And for some reason that picture just helps me see enlightenment as possible. Just feeling like that's Vajragini looking at me.\n\nBut finding an image or whatever that really connects to you and works. It's a very simple way to believe in enlightenment. Basically the power of the object.\n\nAnd then last is to reflect on the quote from the Mahamudra teachings. If you know your own mind, you should become a Buddha. Or you'll become a Buddha.\n\nYou should not look for Buddhahood elsewhere. Which is related to some of the points that were made. But this is specifically about understanding another definition of mind.\n\nIt's just knowing our very subtle mind directly. Which is like, wow, just knowing my mind. That's so easy.\n\nI could do that. That's just inside me. I actually hit that very subtle mind every night in deep sleep.\n\nSo my enlightenment is so close. If I just could recognize it in deep sleep, I would almost be there. So it's like this definition or this way of thinking about enlightenment is very encouraging to meditate on.\n\nIf you know your own mind, you'll become a Buddha. You should not look for Buddhahood elsewhere. Okay, so this is great.\n\nSo now we have like a million strategies. And what's nice to do is to like work on some of them. And maybe like in our six sessions, we can reflect on maybe one in all six.\n\nOr maybe we can take a different one. And like just keep deepening it. Keep deepening our faith in Buddhahood.\n\nOkay, thanks everyone for the great wisdom. A present situation can be understood in terms of the following analogy. If a person comes across a nugget of gold, but does not recognize its rarity and worth, he may easily throw it away.\n\nAt this moment, we have attained a precious human life far more valuable than gold. But if we do not recognize its worth, we're apt to squander it in meaningless and purposeless pursuits. Thus, it is very important, first of all, to recognize the eight freedoms and ten endowments of this rare and precious opportunity.\n\nThe eight freedoms or leisures are in reference to being free from eight states of bondage, four encountered even when born as a human being. The four freedoms from the bondage of non-human states of existence are freedom from being born as a hell being, freedom from being born as a hungry spirit, freedom from being born as an animal, freedom from being born as an ordinary god. So those are four different meditations you can do anytime you'd like.\n\nHey, I'm not a hell being. That's awesome. Obviously, we don't exactly remember being one, but we've been one a large majority of the time in samsara, like 99.999% of the time. Large percent. So, hey, I'm not one. Wow, this is way better.\n\nThat's a reason to be happy. It's like, I don't know, if you have a cold or something, and then you stop having a cold, you're like, wow, I'm happy for like one minute. Wow, freedom from a cold.\n\nAh, this is like nirvana, where we feel grateful, right? So we can do that with all these states, which are much worse than a cold. No, I'm not in hell.\n\nAwesome. Freedom from being born as a hungry spirit. Same thing.\n\nFreedom from being born as an animal. Freedom from being born as an ordinary god. So the analogy I often use, which was taught to me by a teacher of mine, he said, a rebirth in hell, or like a mountain, like a huge mountain, like Kilimanjaro or something like this, some huge, massive mountain.\n\nThat's like the rebirth in hell. And then the rebirth as a hungry spirit is like the snowtop on a mountain, like a little snowtop, cute snowtop, not like all snow, just the top, like proportionally. And then the rebirth as an animal are like the trees and rocks up there.\n\nIt's not much, but there's just a few smattering up there. And then a rebirth as a human is like if you sprinkle a little packet of pepper on that mountain. That's the proportion, something like that.\n\nIt's not perfect, but you get the idea. Like proportionally, it's incredibly rare. So we can just think every day, wow, I'm not born as these things, and start to feel happy about that alone.\n\nFour freedoms from obstacles found within human existence are freedom from being born and remaining in a country where there's no religion, freedom from being born and remaining in a country where there's no Buddha Dharma, freedom from being born and remaining with mental or physical disabilities, freedom from holding wrong views, denying Dharma, such as disbelief in the karmic law of cause and effect, the continuity of consciousness, and so forth. Being born where there's no religion, this is called a barbaric land. Dun-dun-dun.\n\nYep, the world's turning into this. It's something to behold. Yes, obviously.\n\nIf we have no religion, no Dharma, well, there's no possibility for enlightenment there. So then it's just an ordinary life. It's basically like living like an animal in our life.\n\nA bit on mental and physical disabilities. This doesn't necessarily mean the typical ones. It just means having mental or physical limitations that prevent your liberation.\n\nSo you can have a limitation, mental or physical, that helps your liberation. Like a certain sickness that helps you develop compassion and so on. So it's not like a very binary kind of statement here.\n\nWe can think about that for ourselves, but what would be a limitation, mental or physical, that would really be like a strict hindrance in us becoming free? And I think we could come up with some. You said being blind.\n\nI think for some people, yeah, that's really hard. Because there's not always teachings that you can hear. These days it's better, but if you think about a hundred years ago, just being blind was incredibly dangerous too.\n\nYou're just not going to live very long at that point. And you're just at the whim of other people. These days it's a little better, at least.\n\nYeah, I know it's better, but it's not perfect. It does make things harder. Same with hearing.\n\nFor a long time, if you lose your hearing, well, that's it. And there's no sign language and there's no literacy. So you're not getting any new information from that on.\n\nSo you can think that would be a huge hindrance. There's no new info you're ever going to get in your life. Except maybe some inference from looking at stuff.\n\nIt's very, very challenging. Holding wrong views. This is the biggest one, obviously, because it just closes the door.\n\nAnd this doesn't mean having doubts. Doubts are something we want to oppose and deal with. But a wrong view is a decision.\n\nLike, this is wrong. So it's saying like, there is no karma. A doubt is like, well, maybe there is, maybe there isn't.\n\nOr I'm not so sure. The wrong view is when we've decided for a fact. And that makes things incredibly difficult at that point to go any further.\n\nThese eight states are called the eight freedoms because they are free from obstacles that oppose or completely prevent our practice of dharma. Ten endowments are of two types. The five personal and the five circumstantial endowments.\n\nI like leisures. I know the freedoms were the leisures. These aren't leisures.\n\nAnyway, darn. Endowments. Being born human, being born and remaining in a country where dharma is flourishing, a so-called central land.\n\nBeing born and remaining with complete powers, free from mental and physical disabilities. Not having committed any of the five actions of immediate retribution. These are killing one's mother, killing one's father, killing an arhat, shedding the blood of a Buddha with harmful intention, and causing division within a spiritual community.\n\nThe five actions of immediate retribution are, generally speaking, so powerfully negative that the karma ripens very, very quickly. Yeah. A lot of other karma takes a long time to come about.\n\nBut they're just so negative that it just sort of explodes very quickly. Having faith in three sets of Buddhist teachings, Tripitaka and the Buddhist teachings as a whole. Yep, so that's one we have to some degree, but we can improve.\n\nFive circumstantial endowments are taking human rebirth in a world where Buddha has appeared. Taking human rebirth in a world where Buddha has taught dharma. Taking human rebirth in a world where pure dharma is still being taught.\n\nTaking human rebirth in a world where there are people practicing pure dharma. Taking human rebirth in a world where there are benefactors and sponsors for dharma practitioners. Okay, so we are in one of those worlds.\n\nAnd we should be very grateful to those people who have allowed us to be in one of those worlds. Because, no guarantee. That might not last forever.\n\nSo there are people who have worked very hard to make sure we are in one of these worlds. Like, for example, to have this center, which for some people is their first and only dharma center. There were lots of people involved in making sure this appeared.\n\nWhich is part of our precious human life, is having the center. It's actually part of our conditions. Some people live in places in the world where there is no dharma center.\n\nSo we have one. And so we can be very grateful to those people who made sure this was here. Especially Geshe-la, because he said explicitly we need a center in Brooklyn.\n\nHe requested Gen-la Dekyong to start the center. And she's like, basically, she's the most powerful teacher in the whole world. And he asked her specifically to leave everything she's doing and come here and start a center in Brooklyn.\n\nSo he wanted something here so badly. And we're receiving that. Which is incredible.\n\nAnd then all the other teachers and managers and students, some of the people in this room, who've helped this place exist and be here. We can feel really grateful for them. And appreciative of them.\n\nMany people have worked very hard. So, anyway, the circumstantial endowments are fragile, right? And we have them right now.\n\nSo we can be really grateful. These ten states are called endowments because they complete the conditions conducive to the practice of dharma. It is because of our cumulative virtuous actions that we have now attained this precious human life endowed with the 18 and above characteristics.\n\nTherefore, now is the time to rejoice at our extraordinary good fortune. So you can ask yourself, how often do we sit around rejoicing, jumping around with delight at our extraordinary good fortune? When was the last time you did that?\n\nGoing, whoo! Yeah! I have such good fortune.\n\nOh, my gosh. We can all ask ourselves, when was the last time we did that? Or do we just go, yeah.\n\nThat's not exactly how I want it to be. Exactly. My coffee is cold.\n\nWhy can't my sangha be a little bit more inspiring than they are? They're okay, but they could be a little wiser, maybe. No, we won't think that.\n\nBut it's just so easy to be so negative and cynical and skeptical. And so many people in the world just live in this horrible, sad place. It's a very sad world to inhabit.\n\nSo don't feed into that. That's just nonsense. And we want to be rejoicing at our extraordinary good fortune.\n\nBasically, we don't need anything else to happen in our life in order to be incredibly delighted. It's enough to just have the conditions we have. If we could compare them to what is the average experience, if we could just actually compare it and see it, what we have right now is enough to be exploding with delight.\n\nSo let's all work on that. And thinking about our potential, our faith in enlightenment, is a key to this. The more we do that, the more we'll get the sense of that's part of my good fortune.\n\nIt's not just that I have these conditions. These conditions matter because they lead to enlightenment. Anyway, that's in the next sentence.\n\nOkay. So what is the purpose of this precious human life and why is it so valuable to us? The purpose and value of such an existence lie in the opportunity it affords us to accomplish one of three outstanding aims.\n\nThe greatest goal now available to us is attaining the attainment of enlightenment, the complete and perfect awakening of a Buddha. The intermediate goal is the attainment of personal liberation from samsara, the vicious cycle of birth and death fraught with suffering and dissatisfaction. So like when we're eating an ice cream, we can think, this is the vicious cycle of birth and death, fraught with suffering and dissatisfaction.\n\nIt is. It's definitely part of it."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "2:44:18",
        "text": "Our delicious ice cream. While the smallest goal is to win rebirth as a god or a human being. Yay!\n\nSmallest goal. We got one. We've won a rebirth as a human being.\n\nPrecious human life. In general, we remain completely unaware of the value of our present situation. In particular, we are blind to the precious opportunity we now have to attain one of these three goals.\n\nInstead, maybe, this isn't saying we definitely do this, but maybe we just check ourselves. Instead we waste our time and squander this precious opportunity by running after the temporary pleasures of this life. If we're to recognize fully the value and potential of this precious human life, we would certainly take advantage of it by studying Dharma and seeking one of the three goals.\n\nWhich is great. We can reverse this and say, okay, if I don't take advantage of it by studying Dharma and seeking one of the three goals regularly, or if that's unappealing to me sometimes or not something I'm into, then it is a sign I don't recognize fully the value and potential of the precious human life. That's it.\n\nThat's the only problem. Okay, great. I just got to work on that.\n\nAs Shantideva says, if no meaning is derived from this precious rebirth now, how can we ever hope to come across it again in the future? I'm going to say a little bit more about this, but I just want to read the little story. This is like, the dude, oh, anyway, I'll just read it.\n\nThere's a story that illustrates the importance of taking full advantage of our precious human life. In a remote village in Tibet, there lived a man who had no legs. One day, as he was making his slow labored way across the countryside with the aid of crutches, he accidentally fell over the edge of a cliff.\n\nAs luck would have it, he landed on the back of a wild horse grazing below. The horse was so startled that it galled off with the man holding on for dear life. Quite a long time passed, and to the wonderment of the other villagers, the man showed no signs of tiring, of his unusual mount.\n\nWhy don't you get off that horse, they shouted to him as he raced by. Not on your life, he shouted back to them. This is the first time in my life I've ever been on horseback.\n\nWhen can a legless man like me ever hope for such an opportunity again? So this is a great image. He's just having a great time, this guy.\n\nI'm going to take full advantage of it while I can. And off he went, clutching on to the back of the wild horse. Just as the man in the story took advantage of his unusual luck, so should we take full advantage of our present, fully endowed human life by training our mind to practice the Dharma.\n\nI guess we can imagine this experience of having a realization of precious human life. And admire that too, right? And think, what does that feel like?\n\nAnd this image is just an analog, but it's a sense of, wow, I just got so lucky and I'm so happy about it. And I'm going to own this thing. I'm going to really make the most of it.\n\nAnd so, with the realization of precious human life, we want to imagine it and envision it, what that feels like. What that kind of sense of gratitude and joy is like. And then once we imagine it, we can admire it, and admire how useful and beautiful that feeling would be for ourself and other people.\n\nAnd then that will organically give us a wish, wanting to cultivate that realization ourself. So with every Dharma object, especially these Lamrim objects, this simple sequence is very, very practical and useful. Just think.\n\nSo it's imagine, admire, wish. So imagine, what's the object feel like? And kind of like, what's the joy of the object?\n\nLike, where is it coming from? We really try to envision what that would feel like. Just like an actor playing a part, right?\n\nWe'd say, what does it feel like to be Hamlet, or something like that. That's not a joyful mind, but anyway. What's it feel like?\n\nWhat does it feel like to be this character? So we're thinking, what's it feel like on the inside to have precious human life feeling? Like an experience of this meditation.\n\nAnd we get a mental image of what that would feel like, and what the joy would be like, and then we admire it, and we go, wow, that would be so beautiful, and cool, and I want that feeling. Thank you very much. And then we can meditate on that wish.\n\nSo it's imagine, admire, wish. This is just a very skillful way to approach every Lam Rim meditation. Even before we get working at the details.\n\nLike, okay, my life is rare, precious, and that's meaningful, and it's rare because of this, and then the blind turtle analogy, and then, you know. Before we start hacking away at the details, just this alone can really start getting things moving. It's a simple method.\n\nOkay. Last thing. It is about imagining our enlightenment, which is another way to increase our faith in enlightenment.\n\nI don't think we listed it, technically, even though it was a little bit related to the piece I read from The Heir of Dharma with additions. yeah, I just wanted to talk about maybe a way or two to help this practice work. And so one of them is just thinking, like, who am I going to help with my enlightenment?\n\nAnd what's that going to be like to help them? And what we're trying to do here is we're trying to move it from an abstract kind of generality, like, I'm just going to be in Vajragini blasting everyone with billions of blessings in a Pure Land, which is like, yeah, that is very inspiring, too. But sometimes it's just helpful to kind of make it slightly more tangible for our mind, like where we're at.\n\nSo just think, who am I going to help with my enlightenment? Who am I going to help? And there's different kind of groups of people that will get us into imagining it.\n\nWe're trying to remember here that part of enlightenment is a compassionate mind, or bodhichitta. So it's hard to imagine enlightenment without imagining the compassion that's there. That's the only reason we even become enlightened.\n\nSo here we're kind of more like tapping into the compassion side instead of just the all the cool abilities we'll have and how good we'll feel. So we're thinking, who am I going to help? We're like, what's it going to be like when I can help them?\n\nThere's different groups. So group one is like people we've been trying to help who we've been unable to help thus far. And it's just so nice to connect to this feeling of like, I'll be able to help more.\n\nI'm not sure to the degree, but I'll be able to help more. And what would that be like to help those people? It's often like family and friends, or it could be some issue that we particularly care about or feel sensitive about.\n\nAnd so that's like a really nice group to think about. And we can even think like person by person. I'd help them like this.\n\nAnd I'd help them like that. And I'd help them like this. And I'd help them like that.\n\nAnd just starting to bring it alive. Like we think about our son. And we're like, I'm going to help my son like this.\n\nAnd then we think about our depressed auntie or something. And I'd help the depressed auntie like that. And then I'd think about my lonely neighbor.\n\nAnd I'd help my lonely neighbor like that. Because again, we're just trying to conceptualize something that's beyond conception. But doing this starts to just make it closer.\n\nOkay, so that's one group. People we've been trying to help or we've been maybe failing spectacularly at so far or just feeling frustrated that we're unable to be there for them. Another group is the people who are linked to like the sort of like through the wounds that we have ourself personally.\n\nAnd this is just, this is a really nice way to think about our enlightenment. Like there's this, in the Lam Chung story as we might know. We're going to get it in this book so we don't need to go through it now.\n\nBut at the end of it, because he was deemed the dumbest person on earth and was helped through Buddha's very skillful methods. At the end of it, it says basically when he became a Buddha he was known as being like the most skillful for helping very difficult people. Like people who were really hard to get to.\n\nHe became like the guy for that job. So there's this link between our like awakening and the challenges we deal with. Like often we feel, we identify with our strengths.\n\nAnd we think like, I'm going to be that kind of Buddha because those are my kind of strengths. But it's almost like, it's almost probably the opposite. Which is like the weaknesses that we break through are going to be the things that really make us a Buddha.\n\nAnd it's those weaknesses that we break through, because those are the things holding us back. It's not our strengths that are holding us back. And so it's like those are going to be the things that touch our heart the most.\n\nAnd move us the most. That we're going to be the most inspired by. So I just really like to think about Lam Chung in that example, right?\n\nIt's like he became someone who could help the people like him. Because he was a person like him. And he had to deal with the pain of that.\n\nThe pain of feeling rejected by his family. By being looked down upon. By being viewed as hopeless.\n\nBy feeling like an idiot. He had to like deal with the pain of that. And he knew that pain so deeply.\n\nSo it's like he became someone who could help the most difficult cases. Very skillfully. So it's nice to think like in our enlightenment one day, we're going to have like a special place in our heart.\n\nAnd like a special karmic ability. Obviously we're going to help everyone equally. But we're going to have like a special karmic link or ability to help those people who've suffered in the ways that we have.\n\nEspecially in the biggest ways that we have. So like all we do is we just think about our biggest difficulties. Like the biggest obstacles to our awakening.\n\nOr the things that we've worked to in our life. The things that were the hardest. Or maybe like wounds that we haven't healed yet in our life.\n\nMaybe from our past. Or certain delusions that are just really intransigent and calcified in our mind and just not moving anywhere. And we can think like one day, when I'm a Buddha, and even before then, when we're a Bodhisattva and we have just like a little bit more ordinary than a Buddha, like I'm going to have such an ability to help those people in those situations.\n\nActually even in this life, even before I'm a Bodhisattva, I'm going to have an ability. Once I really break through this, I'm going to really know how to help with this kind of situation. And have like a blessing to it.\n\nBut when I'm a Buddha, I'm going to like, I'll be there. And maybe people can even pray to me. Right?\n\nTo help with that kind of condition. So anyway, I just find this to be a really nice thing to think about and ponder. It just like makes our enlightenment a little bit more personal.\n\nBecause it is personal. Like look at all the Buddhas. They're all different.\n\nThey're not clones. Right? There's not a bunch of clones.\n\nIt's all different. And we have karmic connection. There's infinite Buddhas.\n\nBut these are the Buddhas that appear to us. Now, why don't the other infinite Buddhas appear? Because we have a karmic link with them.\n\nSo it's like, we're going to have that with people. Right? And I would imagine, personally, the people who are going through what we're going, that we went through, that we broke through, will have a special connection with.\n\nSo, when we're imagining our enlightenment, we can imagine helping those people who have the struggles that we had. And how lovely that would be. To appear in their world and help them and guide them and liberate them and protect them.\n\nAnd to be a light in their dark world where they think there's no answer. Like a dear teacher to me has dealt with incredible sickness. And he has a vow, basically, to help anyone who asks him about very serious sickness, to help them.\n\nAnd he's very busy and he has a lot of things to do. And I'll hear him sometimes in his room, talking to some of these people for hours. Just trying to help them.\n\nAnd he has a lot of other things to do that he's not doing. Because he wants to help them. But he just has this, like, place in his heart.\n\nRight? And he has an ability to help those people. Because of his own journey.\n\nSo it's nice to think of this like our most difficult delusions, our most difficult experiences, our biggest pains, they're actually not like weaknesses. They'll be like our strengths. Right?\n\nAnd we're going to get a blessing working through them. And we'll become enlightened, probably, when we finally work through them. And that will give us an ability to heal other people, really.\n\nLike through our wisdom and our insights. So this is a really nice way to think about our future enlightenment. Think about those people that we can heal.\n\nAnd then lastly, just that we will allow the Mahayana to continue to flourish. The Mahayana Dharma. So when we become enlightened, we'll be a lineage holder in the fullest sense.\n\nAnd that's such an incredible honor. And to just think, like, being that person in a world. What an amazing role.\n\nIt's like Buddha in this world. as we might know, right, all the Buddhas were like, the story goes, he chose this world, basically. Everyone was divvying up who they were going to help.\n\nAnd everyone was like, I don't want that world. The people there, in this part of that world, have too much attachment. It's a simplistic explanation, because the Buddhas don't think that totally.\n\nBut they were like, basically he said, I want that world. I want those people that suffer from horrible attachment. Which is like the defining characteristic of this world.\n\nThe unforgetting world is what it's called. Anyway, so he chose this world and he's like this bearer of the Dharma in this world. He's the reason this is appearing to us.\n\nSo it's like, imagine what it would be like to be like that in a world. And to just be able to establish the Buddha Dharma in a world that didn't have it. And how lovely that would be, to be like the holder of the Mahayana, or the starter, or the lineage holder, the founder of it.\n\nAnyway, I'm not going to find my citation. But the reflection goes, this is one of the reasons to encourage our bodhicitta, we contemplate how tragic it would be for the Mahayana to disappear from this world. The Dharma to disappear.\n\nAnd we think, one day when I'm enlightened, I'll prevent that from ever occurring. In this world and in future worlds. And wouldn't that be so beautiful to be a founder like that, like a founding Buddha, like that.\n\nOkay, so those are just a few ways to bring our imagining of ourself as a Buddha, or our future enlightenment to life a little bit. Especially through compassion. Obviously our tantric practice is the main way we do this.\n\nBut these ways in, connect to our heart in a very beautiful and loving way. So thinking about the people we were trying to help, who we just can't. The people who suffer, in the kind of unique and specific ways that we've dealt with, that we're trying to break through.\n\nAnd then thinking about being like a sort of flag bearer, like a lineage holder, founder Buddha in a world. And what a gift it would be to those people of that world. Just like what Buddha did for us.\n\nWhich is incredibly kind. Okay, I think that's it. So then we'll have a little time for discussion now.\n\nLet's see. I don't like having to do this when there's more people. Anyway, maybe we'll figure out an automated way to do this in the future.\n\nBut for tonight, I'll do it. Anne P., you're with Margaret, right in front of you. And then Sharon, you're with Mimi.\n\nAnd Suzanne, you're with Ryan. And then Anne and Jose. Have you guys been partners yet?\n\nOh, last week. Oops. Okay, just kidding.\n\nOh no, now it's getting confusing. Okay, Anne and Maura. Maura, do you have a partner yet?\n\nNo. Okay, good. And then Jose, Byron, and Michael.\n\nYeah, I think I did it. Oh, Sumit! Okay, Sumit and Byron.\n\nThere we go. And Jose and Michael. There we go."
      },
      {
        "speaker": "Student",
        "time": "3:04:16",
        "text": "I'm going to do a presentation."
      },
      {
        "speaker": "Sumit",
        "time": "3:04:22",
        "text": "You work in here for a year. Sharon, do you want me to find a way for you to use some of these documents? Okay."
      },
      {
        "speaker": "Student",
        "time": "3:04:31",
        "text": "I don't know if I practiced this, but I feel like the background is similar to mine. It seems so true."
      },
      {
        "speaker": "Student",
        "time": "3:04:56",
        "text": "even small things like that or smaller scales like climate or anything like that. It was This is a great point."
      },
      {
        "speaker": "Student",
        "time": "3:05:11",
        "text": "I think it's a good point. You download the app. And then you download the app.\n\nAnd then you put it on your screen. And then everybody can get all the entire parts of it. So you can do that.\n\nYeah. So start a show. Call it a day.\n\nYeah. I think it's a great insight. That's really good.\n\nYeah. That's really helpful. That's really helpful.\n\nYeah. Yeah. Yeah.\n\nYeah. Yeah. Yeah."
      },
      {
        "speaker": "Student",
        "time": "3:06:02",
        "text": "Yeah. Yeah. Yeah.\n\nYeah. Yeah. That's better.\n\nWhat do you mean? Thank you. Like what?\n\nThe Secondhnob. Yeah. There you go."
      },
      {
        "speaker": "Student",
        "time": "3:06:59",
        "text": "I've only been doing this for so long right here. Like, I think that maybe it'll benefit someone, maybe not. So I'm doing this for myself so I can improve my hair and I will champion it and I think that's what I'm hoping to do.\n\nLike, I don't know if it's good or bad, but it's great. I'm glad I'm doing this for myself."
      },
      {
        "speaker": "Suzanne",
        "time": "3:07:19",
        "text": "I don't know if it's good or bad, but it's great. I get to have freedoms from love circles."
      },
      {
        "speaker": "Student",
        "time": "3:07:24",
        "text": "I just tend to have a lot of fun. I like her a lot, but I tend to be a stand-in. It's hard for me to have a lot more merit out of it.\n\nIt's a test, but I also like to do a lot of different things, which is like, you know, once you work out with someone, you get a merit out of it. It's still a nice thing to do. It's still a nice thing to do.\n\nIt's not a big deal. It's not a big deal. Yeah, you're right.\n\nI really like to see their faith. It's actually not something that's in their circumstance, you're in the chair, but you give your all to it. I've seen people do that many times.\n\nThey're serious. They're serious and self-reliant. And you're just self-reliant."
      },
      {
        "speaker": "Student",
        "time": "3:08:13",
        "text": "So, yeah. It's a lot of work. But, yeah...\n\nIt's a lot of work and a lot of fun, I love what you're saying, but I'm stuck with those people that are really precious to me. I have seen a lot of pictures of them, too. I used to ask a lot of people to let me know what was going on.\n\nI used to ask people to let me know what was going on."
      },
      {
        "speaker": "Student",
        "time": "3:18:00",
        "text": "got news. Thank you! Thank you!\n\nThank you, Lord."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "3:18:18",
        "text": "Welcome back everyone. So then over the next week, you know, two weeks, anything that you'd like to particularly emphasize please? For example, believing that we can become enlightened- Oh, Kristen's arm.\n\nIt's your hand. Yeah."
      },
      {
        "speaker": "Adriana",
        "time": "3:18:44",
        "text": "That's okay. I like this idea of imagining all the people I'm gonna help when I'm enlightened, and how."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "3:18:52",
        "text": "Yeah. Yeah, that's a nice thing to bring in to the succession practice. For example, thinking about all the delightful ways we're gonna help them.\n\nYeah, thank you."
      },
      {
        "speaker": "Anne",
        "time": "3:19:12",
        "text": "Yeah, I really liked what you said at the beginning, that Shantideva was just like, I'm gonna do this for my spiritual growth, and accumulate merit. I'm like, if that's good enough for Shantideva, it's good enough for me. And just like, I need to be like a merit hog for a couple weeks.\n\nYeah."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "3:19:31",
        "text": "Yeah, there's no limit on how much merit we're allowed to create. As much as we can get, basically, is what we want to aim for. And doing every activity with that intention is just really, really nice.\n\nYeah. Yeah, thanks."
      },
      {
        "speaker": "Margaret",
        "time": "3:19:51",
        "text": "Something's, I'm thinking, because we spoke, you spoke something about how we should think about the good karma that we're creating. But we can't see the karma, and then we want, we expect the results. And I think that's the setback that sets us back from wanting to practice, because we don't see results.\n\nSo I think one thing is like, observe to see like, when are we happy, or sad when we don't have results? And what is our faith when that arises? And how can we change that faith?\n\nAnd I, for me, one of the things I think about is, when I first started, like how much more deluded I was, and how much I've actually progressed in my practice, even though it feels like with my mom."
      },
      {
        "speaker": "Kadam Kyle",
        "time": "3:20:52",
        "text": "Yeah, it's a good point. And this is one of the challenges, right, with understanding karma, is that it's planting seeds. It's not instant.\n\nIf it was instant, it'd be great. Well, it would be terrible. It would just probably instantly just go to hell, and it wouldn't be that great.\n\nBut anyway, but it would be more clear if it was instant, or at least very quick. But it's not, it's just planting seeds. And I'm in a big field with billions of other seeds.\n\nSo yeah, we do need to increase our faith in karma over time. And there's lots of little points about karma throughout this book that we'll try to, we can try to work on. And so we don't expect instant change.\n\nYeah. We can expect some change, as you said, noticing patterns, but it's not instant. Yeah.\n\nOkay. We're going to dedicate now, just a reminder, Adriana and Emily's course is Saturday on how to deal with difficult family, in case you have any of those people. Come along, 11 to 2.\n\nAnd then we have our Vajrasattva course, all day retreat, Pure Mind, Pure World, December 6th. So come along if you'd like to purify in December. So we can do the 9-line miksamma.\n\nThank you."
      }
    ],
    "conclusion": []
  }
}